sol4ik/audio-steganography/try/fm4/s6e2ccxh/common/s6e2ccxh.h
typedef struct stc_ethernet_mac_mmc_ipc_intr_mask_rx_field
{
    union {
        struct {
            __IO  uint32_t  BL                   :14;
            __IO  uint32_t  RESERVED0            :2;
            __IO  uint32_t  BH                   :14;
            __IO  uint32_t  RESERVED2            :2;
        };
        struct {
            __IO  uint32_t  BL0                  :1;
            __IO  uint32_t  BL1                  :1;
            __IO  uint32_t  BL2                  :1;
            __IO  uint32_t  BL3                  :1;
            __IO  uint32_t  BL4                  :1;
            __IO  uint32_t  BL5                  :1;
            __IO  uint32_t  BL6                  :1;
            __IO  uint32_t  BL7                  :1;
            __IO  uint32_t  BL8                  :1;
            __IO  uint32_t  BL9                  :1;
            __IO  uint32_t  BL10                 :1;
            __IO  uint32_t  BL11                 :1;
            __IO  uint32_t  BL12                 :1;
            __IO  uint32_t  BL13                 :1;
            __IO  uint32_t  RESERVED1            :2;
            __IO  uint32_t  BH0                  :1;
            __IO  uint32_t  BH1                  :1;
            __IO  uint32_t  BH2                  :1;
            __IO  uint32_t  BH3                  :1;
            __IO  uint32_t  BH4                  :1;
            __IO  uint32_t  BH5                  :1;
            __IO  uint32_t  BH6                  :1;
            __IO  uint32_t  BH7                  :1;
            __IO  uint32_t  BH8                  :1;
            __IO  uint32_t  BH9                  :1;
            __IO  uint32_t  BH10                 :1;
            __IO  uint32_t  BH11                 :1;
            __IO  uint32_t  BH12                 :1;
            __IO  uint32_t  BH13                 :1;
            __IO  uint32_t  RESERVED3            :2;
        };
    };
} stc_ethernet_mac_mmc_ipc_intr_mask_rx_field_t;

typedef struct stc_ethernet_mac_mmc_ipc_intr_rx_field
{
    union {
        struct {
            __IO  uint32_t  BL                   :14;
            __IO  uint32_t  RESERVED0            :2;
            __IO  uint32_t  BH                   :14;
            __IO  uint32_t  RESERVED2            :2;
        };
        struct {
            __IO  uint32_t  BL0                  :1;
            __IO  uint32_t  BL1                  :1;
            __IO  uint32_t  BL2                  :1;
            __IO  uint32_t  BL3                  :1;
            __IO  uint32_t  BL4                  :1;
            __IO  uint32_t  BL5                  :1;
            __IO  uint32_t  BL6                  :1;
            __IO  uint32_t  BL7                  :1;
            __IO  uint32_t  BL8                  :1;
            __IO  uint32_t  BL9                  :1;
            __IO  uint32_t  BL10                 :1;
            __IO  uint32_t  BL11                 :1;
            __IO  uint32_t  BL12                 :1;
            __IO  uint32_t  BL13                 :1;
            __IO  uint32_t  RESERVED1            :2;
            __IO  uint32_t  BH0                  :1;
            __IO  uint32_t  BH1                  :1;
            __IO  uint32_t  BH2                  :1;
            __IO  uint32_t  BH3                  :1;
            __IO  uint32_t  BH4                  :1;
            __IO  uint32_t  BH5                  :1;
            __IO  uint32_t  BH6                  :1;
            __IO  uint32_t  BH7                  :1;
            __IO  uint32_t  BH8                  :1;
            __IO  uint32_t  BH9                  :1;
            __IO  uint32_t  BH10                 :1;
            __IO  uint32_t  BH11                 :1;
            __IO  uint32_t  BH12                 :1;
            __IO  uint32_t  BH13                 :1;
            __IO  uint32_t  RESERVED3            :2;
        };
    };
} stc_ethernet_mac_mmc_ipc_intr_rx_field_t;

typedef struct stc_ethernet_mac_tscr_field
{
    union {
        struct {
            __IO  uint32_t  TSE                  :1;
            __IO  uint32_t  TFCU                 :1;
            __IO  uint32_t  TSI                  :1;
            __IO  uint32_t  TSU                  :1;
            __IO  uint32_t  TITE                 :1;
            __IO  uint32_t  TARU                 :1;
            __IO  uint32_t  RESERVED0            :2;
            __IO  uint32_t  TSEA                 :1;
            __IO  uint32_t  TSDB                 :1;
            __IO  uint32_t  TSV2E                :1;
            __IO  uint32_t  TETSP                :1;
            __IO  uint32_t  TSIP6E               :1;
            __IO  uint32_t  TSIP4E               :1;
            __IO  uint32_t  TETSEM               :1;
            __IO  uint32_t  TSMRM                :1;
            __IO  uint32_t  TSPS                 :2;
            __IO  uint32_t  TSENMF               :1;
            __IO  uint32_t  RESERVED2            :5;
            __IO  uint32_t  ATSFC                :1;
            __IO  uint32_t  RESERVED3            :7;
        };
        struct {
            __IO  uint32_t  RESERVED1            :16;
            __IO  uint32_t  TSPS0                :1;
            __IO  uint32_t  TSPS1                :1;
            __IO  uint32_t  RESERVED4            :14;
        };
    };
} stc_ethernet_mac_tscr_field_t;

typedef struct stc_ethernet_mac_ssir_field
{
    union {
        struct {
            __IO  uint32_t  SSINC                :8;
            __IO  uint32_t  RESERVED0            :24;
        };
        struct {
            __IO  uint32_t  SSINC0               :1;
            __IO  uint32_t  SSINC1               :1;
            __IO  uint32_t  SSINC2               :1;
            __IO  uint32_t  SSINC3               :1;
            __IO  uint32_t  SSINC4               :1;
            __IO  uint32_t  SSINC5               :1;
            __IO  uint32_t  SSINC6               :1;
            __IO  uint32_t  SSINC7               :1;
            __IO  uint32_t  RESERVED1            :24;
        };
    };
} stc_ethernet_mac_ssir_field_t;

typedef struct stc_ethernet_mac_stsr_field
{
    union {
        struct {
            __IO  uint32_t  TSS                  :32;
        };
        struct {
            __IO  uint32_t  TSS0                 :1;
            __IO  uint32_t  TSS1                 :1;
            __IO  uint32_t  TSS2                 :1;
            __IO  uint32_t  TSS3                 :1;
            __IO  uint32_t  TSS4                 :1;
            __IO  uint32_t  TSS5                 :1;
            __IO  uint32_t  TSS6                 :1;
            __IO  uint32_t  TSS7                 :1;
            __IO  uint32_t  TSS8                 :1;
            __IO  uint32_t  TSS9                 :1;
            __IO  uint32_t  TSS10                :1;
            __IO  uint32_t  TSS11                :1;
            __IO  uint32_t  TSS12                :1;
            __IO  uint32_t  TSS13                :1;
            __IO  uint32_t  TSS14                :1;
            __IO  uint32_t  TSS15                :1;
            __IO  uint32_t  TSS16                :1;
            __IO  uint32_t  TSS17                :1;
            __IO  uint32_t  TSS18                :1;
            __IO  uint32_t  TSS19                :1;
            __IO  uint32_t  TSS20                :1;
            __IO  uint32_t  TSS21                :1;
            __IO  uint32_t  TSS22                :1;
            __IO  uint32_t  TSS23                :1;
            __IO  uint32_t  TSS24                :1;
            __IO  uint32_t  TSS25                :1;
            __IO  uint32_t  TSS26                :1;
            __IO  uint32_t  TSS27                :1;
            __IO  uint32_t  TSS28                :1;
            __IO  uint32_t  TSS29                :1;
            __IO  uint32_t  TSS30                :1;
            __IO  uint32_t  TSS31                :1;
        };
    };
} stc_ethernet_mac_stsr_field_t;

