sol4ik/audio-steganography/try/fm4/s6e2ccxh/common/s6e2ccxh.h
typedef struct stc_hsspi_cscfg_field
{
    union {
        struct {
            __IO  uint32_t  SRAM                 :1;
            __IO  uint32_t  MBM                  :2;
            __IO  uint32_t  RESERVED1            :5;
            __IO  uint32_t  SSEL0EN              :1;
            __IO  uint32_t  SSEL1EN              :1;
            __IO  uint32_t  SSEL2EN              :1;
            __IO  uint32_t  SSEL3EN              :1;
            __IO  uint32_t  RESERVED2            :4;
            __IO  uint32_t  MSEL                 :4;
            __IO  uint32_t  RESERVED4            :12;
        };
        struct {
            __IO  uint32_t  RESERVED0            :1;
            __IO  uint32_t  MBM0                 :1;
            __IO  uint32_t  MBM1                 :1;
            __IO  uint32_t  RESERVED3            :13;
            __IO  uint32_t  MSEL0                :1;
            __IO  uint32_t  MSEL1                :1;
            __IO  uint32_t  MSEL2                :1;
            __IO  uint32_t  MSEL3                :1;
            __IO  uint32_t  RESERVED5            :12;
        };
    };
} stc_hsspi_cscfg_field_t;

typedef struct stc_hsspi_csitime_field
{
    union {
        struct {
            __IO  uint32_t  ITIME                :16;
            __IO  uint32_t  RESERVED0            :16;
        };
        struct {
            __IO  uint32_t  ITIME0               :1;
            __IO  uint32_t  ITIME1               :1;
            __IO  uint32_t  ITIME2               :1;
            __IO  uint32_t  ITIME3               :1;
            __IO  uint32_t  ITIME4               :1;
            __IO  uint32_t  ITIME5               :1;
            __IO  uint32_t  ITIME6               :1;
            __IO  uint32_t  ITIME7               :1;
            __IO  uint32_t  ITIME8               :1;
            __IO  uint32_t  ITIME9               :1;
            __IO  uint32_t  ITIME10              :1;
            __IO  uint32_t  ITIME11              :1;
            __IO  uint32_t  ITIME12              :1;
            __IO  uint32_t  ITIME13              :1;
            __IO  uint32_t  ITIME14              :1;
            __IO  uint32_t  ITIME15              :1;
            __IO  uint32_t  RESERVED1            :16;
        };
    };
} stc_hsspi_csitime_field_t;

typedef struct stc_hsspi_csaext_field
{
    union {
        struct {
            __IO  uint32_t  RESERVED0            :13;
            __IO  uint32_t  AEXT                 :19;
        };
        struct {
            __IO  uint32_t  RESERVED1            :13;
            __IO  uint32_t  AEXT0                :1;
            __IO  uint32_t  AEXT1                :1;
            __IO  uint32_t  AEXT2                :1;
            __IO  uint32_t  AEXT3                :1;
            __IO  uint32_t  AEXT4                :1;
            __IO  uint32_t  AEXT5                :1;
            __IO  uint32_t  AEXT6                :1;
            __IO  uint32_t  AEXT7                :1;
            __IO  uint32_t  AEXT8                :1;
            __IO  uint32_t  AEXT9                :1;
            __IO  uint32_t  AEXT10               :1;
            __IO  uint32_t  AEXT11               :1;
            __IO  uint32_t  AEXT12               :1;
            __IO  uint32_t  AEXT13               :1;
            __IO  uint32_t  AEXT14               :1;
            __IO  uint32_t  AEXT15               :1;
            __IO  uint32_t  AEXT16               :1;
            __IO  uint32_t  AEXT17               :1;
            __IO  uint32_t  AEXT18               :1;
        };
    };
} stc_hsspi_csaext_field_t;

typedef struct stc_hsspi_rdcsdc0_field
{
    union {
        struct {
            __IO  uint16_t  DEC                  :1;
            __IO  uint16_t  TRP                  :2;
            __IO  uint16_t  CONT                 :1;
            __IO  uint16_t  RESERVED1            :4;
            __IO  uint16_t  RDCSDATA             :8;
        };
        struct {
            __IO  uint16_t  RESERVED0            :1;
            __IO  uint16_t  TRP0                 :1;
            __IO  uint16_t  TRP1                 :1;
            __IO  uint16_t  RESERVED2            :5;
            __IO  uint16_t  RDCSDATA0            :1;
            __IO  uint16_t  RDCSDATA1            :1;
            __IO  uint16_t  RDCSDATA2            :1;
            __IO  uint16_t  RDCSDATA3            :1;
            __IO  uint16_t  RDCSDATA4            :1;
            __IO  uint16_t  RDCSDATA5            :1;
            __IO  uint16_t  RDCSDATA6            :1;
            __IO  uint16_t  RDCSDATA7            :1;
        };
    };
} stc_hsspi_rdcsdc0_field_t;

typedef struct stc_hsspi_rdcsdc1_field
{
    union {
        struct {
            __IO  uint16_t  DEC                  :1;
            __IO  uint16_t  TRP                  :2;
            __IO  uint16_t  CONT                 :1;
            __IO  uint16_t  RESERVED1            :4;
            __IO  uint16_t  RDCSDATA             :8;
        };
        struct {
            __IO  uint16_t  RESERVED0            :1;
            __IO  uint16_t  TRP0                 :1;
            __IO  uint16_t  TRP1                 :1;
            __IO  uint16_t  RESERVED2            :5;
            __IO  uint16_t  RDCSDATA0            :1;
            __IO  uint16_t  RDCSDATA1            :1;
            __IO  uint16_t  RDCSDATA2            :1;
            __IO  uint16_t  RDCSDATA3            :1;
            __IO  uint16_t  RDCSDATA4            :1;
            __IO  uint16_t  RDCSDATA5            :1;
            __IO  uint16_t  RDCSDATA6            :1;
            __IO  uint16_t  RDCSDATA7            :1;
        };
    };
} stc_hsspi_rdcsdc1_field_t;

typedef struct stc_hsspi_rdcsdc2_field
{
    union {
        struct {
            __IO  uint16_t  DEC                  :1;
            __IO  uint16_t  TRP                  :2;
            __IO  uint16_t  CONT                 :1;
            __IO  uint16_t  RESERVED1            :4;
            __IO  uint16_t  RDCSDATA             :8;
        };
        struct {
            __IO  uint16_t  RESERVED0            :1;
            __IO  uint16_t  TRP0                 :1;
            __IO  uint16_t  TRP1                 :1;
            __IO  uint16_t  RESERVED2            :5;
            __IO  uint16_t  RDCSDATA0            :1;
            __IO  uint16_t  RDCSDATA1            :1;
            __IO  uint16_t  RDCSDATA2            :1;
            __IO  uint16_t  RDCSDATA3            :1;
            __IO  uint16_t  RDCSDATA4            :1;
            __IO  uint16_t  RDCSDATA5            :1;
            __IO  uint16_t  RDCSDATA6            :1;
            __IO  uint16_t  RDCSDATA7            :1;
        };
    };
} stc_hsspi_rdcsdc2_field_t;

typedef struct stc_hsspi_rdcsdc3_field
{
    union {
        struct {
            __IO  uint16_t  DEC                  :1;
            __IO  uint16_t  TRP                  :2;
            __IO  uint16_t  CONT                 :1;
            __IO  uint16_t  RESERVED1            :4;
            __IO  uint16_t  RDCSDATA             :8;
        };
        struct {
            __IO  uint16_t  RESERVED0            :1;
            __IO  uint16_t  TRP0                 :1;
            __IO  uint16_t  TRP1                 :1;
            __IO  uint16_t  RESERVED2            :5;
            __IO  uint16_t  RDCSDATA0            :1;
            __IO  uint16_t  RDCSDATA1            :1;
            __IO  uint16_t  RDCSDATA2            :1;
            __IO  uint16_t  RDCSDATA3            :1;
            __IO  uint16_t  RDCSDATA4            :1;
            __IO  uint16_t  RDCSDATA5            :1;
            __IO  uint16_t  RDCSDATA6            :1;
            __IO  uint16_t  RDCSDATA7            :1;
        };
    };
} stc_hsspi_rdcsdc3_field_t;

typedef struct stc_hsspi_rdcsdc4_field
{
    union {
        struct {
            __IO  uint16_t  DEC                  :1;
            __IO  uint16_t  TRP                  :2;
            __IO  uint16_t  CONT                 :1;
            __IO  uint16_t  RESERVED1            :4;
            __IO  uint16_t  RDCSDATA             :8;
        };
        struct {
            __IO  uint16_t  RESERVED0            :1;
            __IO  uint16_t  TRP0                 :1;
            __IO  uint16_t  TRP1                 :1;
            __IO  uint16_t  RESERVED2            :5;
            __IO  uint16_t  RDCSDATA0            :1;
            __IO  uint16_t  RDCSDATA1            :1;
            __IO  uint16_t  RDCSDATA2            :1;
            __IO  uint16_t  RDCSDATA3            :1;
            __IO  uint16_t  RDCSDATA4            :1;
            __IO  uint16_t  RDCSDATA5            :1;
            __IO  uint16_t  RDCSDATA6            :1;
            __IO  uint16_t  RDCSDATA7            :1;
        };
    };
} stc_hsspi_rdcsdc4_field_t;

typedef struct stc_hsspi_rdcsdc5_field
{
    union {
        struct {
            __IO  uint16_t  DEC                  :1;
            __IO  uint16_t  TRP                  :2;
            __IO  uint16_t  CONT                 :1;
            __IO  uint16_t  RESERVED1            :4;
            __IO  uint16_t  RDCSDATA             :8;
        };
        struct {
            __IO  uint16_t  RESERVED0            :1;
            __IO  uint16_t  TRP0                 :1;
            __IO  uint16_t  TRP1                 :1;
            __IO  uint16_t  RESERVED2            :5;
            __IO  uint16_t  RDCSDATA0            :1;
            __IO  uint16_t  RDCSDATA1            :1;
            __IO  uint16_t  RDCSDATA2            :1;
            __IO  uint16_t  RDCSDATA3            :1;
            __IO  uint16_t  RDCSDATA4            :1;
            __IO  uint16_t  RDCSDATA5            :1;
            __IO  uint16_t  RDCSDATA6            :1;
            __IO  uint16_t  RDCSDATA7            :1;
        };
    };
} stc_hsspi_rdcsdc5_field_t;

typedef struct stc_hsspi_rdcsdc6_field
{
    union {
        struct {
            __IO  uint16_t  DEC                  :1;
            __IO  uint16_t  TRP                  :2;
            __IO  uint16_t  CONT                 :1;
            __IO  uint16_t  RESERVED1            :4;
            __IO  uint16_t  RDCSDATA             :8;
        };
        struct {
            __IO  uint16_t  RESERVED0            :1;
            __IO  uint16_t  TRP0                 :1;
            __IO  uint16_t  TRP1                 :1;
            __IO  uint16_t  RESERVED2            :5;
            __IO  uint16_t  RDCSDATA0            :1;
            __IO  uint16_t  RDCSDATA1            :1;
            __IO  uint16_t  RDCSDATA2            :1;
            __IO  uint16_t  RDCSDATA3            :1;
            __IO  uint16_t  RDCSDATA4            :1;
            __IO  uint16_t  RDCSDATA5            :1;
            __IO  uint16_t  RDCSDATA6            :1;
            __IO  uint16_t  RDCSDATA7            :1;
        };
    };
} stc_hsspi_rdcsdc6_field_t;

typedef struct stc_hsspi_rdcsdc7_field
{
    union {
        struct {
            __IO  uint16_t  DEC                  :1;
            __IO  uint16_t  TRP                  :2;
            __IO  uint16_t  CONT                 :1;
            __IO  uint16_t  RESERVED1            :4;
            __IO  uint16_t  RDCSDATA             :8;
        };
        struct {
            __IO  uint16_t  RESERVED0            :1;
            __IO  uint16_t  TRP0                 :1;
            __IO  uint16_t  TRP1                 :1;
            __IO  uint16_t  RESERVED2            :5;
            __IO  uint16_t  RDCSDATA0            :1;
            __IO  uint16_t  RDCSDATA1            :1;
            __IO  uint16_t  RDCSDATA2            :1;
            __IO  uint16_t  RDCSDATA3            :1;
            __IO  uint16_t  RDCSDATA4            :1;
            __IO  uint16_t  RDCSDATA5            :1;
            __IO  uint16_t  RDCSDATA6            :1;
            __IO  uint16_t  RDCSDATA7            :1;
        };
    };
} stc_hsspi_rdcsdc7_field_t;

typedef struct stc_hsspi_wrcsdc0_field
{
    union {
        struct {
            __IO  uint16_t  DEC                  :1;
            __IO  uint16_t  TRP                  :2;
            __IO  uint16_t  CONT                 :1;
            __IO  uint16_t  RESERVED1            :4;
            __IO  uint16_t  WRCSDATA             :8;
        };
        struct {
            __IO  uint16_t  RESERVED0            :1;
            __IO  uint16_t  TRP0                 :1;
            __IO  uint16_t  TRP1                 :1;
            __IO  uint16_t  RESERVED2            :5;
            __IO  uint16_t  WRCSDATA0            :1;
            __IO  uint16_t  WRCSDATA1            :1;
            __IO  uint16_t  WRCSDATA2            :1;
            __IO  uint16_t  WRCSDATA3            :1;
            __IO  uint16_t  WRCSDATA4            :1;
            __IO  uint16_t  WRCSDATA5            :1;
            __IO  uint16_t  WRCSDATA6            :1;
            __IO  uint16_t  WRCSDATA7            :1;
        };
    };
} stc_hsspi_wrcsdc0_field_t;

typedef struct stc_hsspi_wrcsdc1_field
{
    union {
        struct {
            __IO  uint16_t  DEC                  :1;
            __IO  uint16_t  TRP                  :2;
            __IO  uint16_t  CONT                 :1;
            __IO  uint16_t  RESERVED1            :4;
            __IO  uint16_t  WRCSDATA             :8;
        };
        struct {
            __IO  uint16_t  RESERVED0            :1;
            __IO  uint16_t  TRP0                 :1;
            __IO  uint16_t  TRP1                 :1;
            __IO  uint16_t  RESERVED2            :5;
            __IO  uint16_t  WRCSDATA0            :1;
            __IO  uint16_t  WRCSDATA1            :1;
            __IO  uint16_t  WRCSDATA2            :1;
            __IO  uint16_t  WRCSDATA3            :1;
            __IO  uint16_t  WRCSDATA4            :1;
            __IO  uint16_t  WRCSDATA5            :1;
            __IO  uint16_t  WRCSDATA6            :1;
            __IO  uint16_t  WRCSDATA7            :1;
        };
    };
} stc_hsspi_wrcsdc1_field_t;

typedef struct stc_hsspi_wrcsdc2_field
{
    union {
        struct {
            __IO  uint16_t  DEC                  :1;
            __IO  uint16_t  TRP                  :2;
            __IO  uint16_t  CONT                 :1;
            __IO  uint16_t  RESERVED1            :4;
            __IO  uint16_t  WRCSDATA             :8;
        };
        struct {
            __IO  uint16_t  RESERVED0            :1;
            __IO  uint16_t  TRP0                 :1;
            __IO  uint16_t  TRP1                 :1;
            __IO  uint16_t  RESERVED2            :5;
            __IO  uint16_t  WRCSDATA0            :1;
            __IO  uint16_t  WRCSDATA1            :1;
            __IO  uint16_t  WRCSDATA2            :1;
            __IO  uint16_t  WRCSDATA3            :1;
            __IO  uint16_t  WRCSDATA4            :1;
            __IO  uint16_t  WRCSDATA5            :1;
            __IO  uint16_t  WRCSDATA6            :1;
            __IO  uint16_t  WRCSDATA7            :1;
        };
    };
} stc_hsspi_wrcsdc2_field_t;

typedef struct stc_hsspi_wrcsdc3_field
{
    union {
        struct {
            __IO  uint16_t  DEC                  :1;
            __IO  uint16_t  TRP                  :2;
            __IO  uint16_t  CONT                 :1;
            __IO  uint16_t  RESERVED1            :4;
            __IO  uint16_t  WRCSDATA             :8;
        };
        struct {
            __IO  uint16_t  RESERVED0            :1;
            __IO  uint16_t  TRP0                 :1;
            __IO  uint16_t  TRP1                 :1;
            __IO  uint16_t  RESERVED2            :5;
            __IO  uint16_t  WRCSDATA0            :1;
            __IO  uint16_t  WRCSDATA1            :1;
            __IO  uint16_t  WRCSDATA2            :1;
            __IO  uint16_t  WRCSDATA3            :1;
            __IO  uint16_t  WRCSDATA4            :1;
            __IO  uint16_t  WRCSDATA5            :1;
            __IO  uint16_t  WRCSDATA6            :1;
            __IO  uint16_t  WRCSDATA7            :1;
        };
    };
} stc_hsspi_wrcsdc3_field_t;

