sol4ik/audio-steganography/try/fm4/s6e2ccxh/common/s6e2ccxh.h
/*******************************************************************************
* USBETHERCLK_MODULE
*******************************************************************************/
typedef struct stc_usbetherclk_uccr_field
{
    union {
        struct {
            __IO   uint8_t  UCEN0                :1;
            __IO   uint8_t  UCSEL                :2;
            __IO   uint8_t  UCEN1                :1;
            __IO   uint8_t  ECEN                 :1;
            __IO   uint8_t  ECSEL                :2;
            __IO   uint8_t  RESERVED2            :1;
        };
        struct {
            __IO   uint8_t  RESERVED0            :1;
            __IO   uint8_t  UCSEL0               :1;
            __IO   uint8_t  UCSEL1               :1;
            __IO   uint8_t  RESERVED1            :2;
            __IO   uint8_t  ECSEL0               :1;
            __IO   uint8_t  ECSEL1               :1;
            __IO   uint8_t  RESERVED3            :1;
        };
    };
} stc_usbetherclk_uccr_field_t;

typedef struct stc_usbetherclk_upcr1_field
{
        __IO   uint8_t  UPLLEN                   :1;
        __IO   uint8_t  UPINC                    :1;
        __IO   uint8_t  RESERVED0                :6;
} stc_usbetherclk_upcr1_field_t;

typedef struct stc_usbetherclk_upcr2_field
{
    union {
        struct {
            __IO   uint8_t  UPOWT                :3;
            __IO   uint8_t  RESERVED0            :5;
        };
        struct {
            __IO   uint8_t  UPOWT0               :1;
            __IO   uint8_t  UPOWT1               :1;
            __IO   uint8_t  UPOWT2               :1;
            __IO   uint8_t  RESERVED1            :5;
        };
    };
} stc_usbetherclk_upcr2_field_t;

typedef struct stc_usbetherclk_upcr3_field
{
    union {
        struct {
            __IO   uint8_t  UPLLK                :5;
            __IO   uint8_t  RESERVED0            :3;
        };
        struct {
            __IO   uint8_t  UPLLK0               :1;
            __IO   uint8_t  UPLLK1               :1;
            __IO   uint8_t  UPLLK2               :1;
            __IO   uint8_t  UPLLK3               :1;
            __IO   uint8_t  UPLLK4               :1;
            __IO   uint8_t  RESERVED1            :3;
        };
    };
} stc_usbetherclk_upcr3_field_t;

typedef struct stc_usbetherclk_upcr4_field
{
    union {
        struct {
            __IO   uint8_t  UPLLN                :7;
            __IO   uint8_t  RESERVED0            :1;
        };
        struct {
            __IO   uint8_t  UPLLN0               :1;
            __IO   uint8_t  UPLLN1               :1;
            __IO   uint8_t  UPLLN2               :1;
            __IO   uint8_t  UPLLN3               :1;
            __IO   uint8_t  UPLLN4               :1;
            __IO   uint8_t  UPLLN5               :1;
            __IO   uint8_t  UPLLN6               :1;
            __IO   uint8_t  RESERVED1            :1;
        };
    };
} stc_usbetherclk_upcr4_field_t;

typedef struct stc_usbetherclk_up_str_field
{
        __IO   uint8_t  UPRDY                    :1;
        __IO   uint8_t  RESERVED0                :7;
} stc_usbetherclk_up_str_field_t;

typedef struct stc_usbetherclk_upint_enr_field
{
        __IO   uint8_t  UPCSE                    :1;
        __IO   uint8_t  RESERVED0                :7;
} stc_usbetherclk_upint_enr_field_t;

typedef struct stc_usbetherclk_upint_clr_field
{
        __IO   uint8_t  UPCSC                    :1;
        __IO   uint8_t  RESERVED0                :7;
} stc_usbetherclk_upint_clr_field_t;

typedef struct stc_usbetherclk_upint_str_field
{
        __IO   uint8_t  UPCSI                    :1;
        __IO   uint8_t  RESERVED0                :7;
} stc_usbetherclk_upint_str_field_t;

typedef struct stc_usbetherclk_upcr5_field
{
    union {
        struct {
            __IO   uint8_t  UPLLM                :4;
            __IO   uint8_t  RESERVED0            :4;
        };
        struct {
            __IO   uint8_t  UPLLM0               :1;
            __IO   uint8_t  UPLLM1               :1;
            __IO   uint8_t  UPLLM2               :1;
            __IO   uint8_t  UPLLM3               :1;
            __IO   uint8_t  RESERVED1            :4;
        };
    };
} stc_usbetherclk_upcr5_field_t;

typedef struct stc_usbetherclk_upcr6_field
{
    union {
        struct {
            __IO   uint8_t  UBSR                 :4;
            __IO   uint8_t  RESERVED0            :4;
        };
        struct {
            __IO   uint8_t  UBSR0                :1;
            __IO   uint8_t  UBSR1                :1;
            __IO   uint8_t  UBSR2                :1;
            __IO   uint8_t  UBSR3                :1;
            __IO   uint8_t  RESERVED1            :4;
        };
    };
} stc_usbetherclk_upcr6_field_t;

typedef struct stc_usbetherclk_upcr7_field
{
        __IO   uint8_t  EPLLEN                   :1;
        __IO   uint8_t  RESERVED0                :7;
} stc_usbetherclk_upcr7_field_t;

typedef struct stc_usbetherclk_usben0_field
{
        __IO   uint8_t  USBEN0                   :1;
        __IO   uint8_t  RESERVED0                :7;
} stc_usbetherclk_usben0_field_t;

typedef struct stc_usbetherclk_usben1_field
{
        __IO   uint8_t  USBEN1                   :1;
        __IO   uint8_t  RESERVED0                :7;
} stc_usbetherclk_usben1_field_t;

/*******************************************************************************
* WC_MODULE
*******************************************************************************/
typedef struct stc_wc_wcrd_field
{
    union {
        struct {
            __IO   uint8_t  CTR                  :6;
            __IO   uint8_t  RESERVED0            :2;
        };
        struct {
            __IO   uint8_t  CTR0                 :1;
            __IO   uint8_t  CTR1                 :1;
            __IO   uint8_t  CTR2                 :1;
            __IO   uint8_t  CTR3                 :1;
            __IO   uint8_t  CTR4                 :1;
            __IO   uint8_t  CTR5                 :1;
            __IO   uint8_t  RESERVED1            :2;
        };
    };
} stc_wc_wcrd_field_t;

typedef struct stc_wc_wcrl_field
{
    union {
        struct {
            __IO   uint8_t  RLC                  :6;
            __IO   uint8_t  RESERVED0            :2;
        };
        struct {
            __IO   uint8_t  RLC0                 :1;
            __IO   uint8_t  RLC1                 :1;
            __IO   uint8_t  RLC2                 :1;
            __IO   uint8_t  RLC3                 :1;
            __IO   uint8_t  RLC4                 :1;
            __IO   uint8_t  RLC5                 :1;
            __IO   uint8_t  RESERVED1            :2;
        };
    };
} stc_wc_wcrl_field_t;

