sol4ik/audio-steganography/try/fm4/s6e2ccxh/common/s6e2ccxh.h
/*******************************************************************************
* CANFD_MODULE
*   register structur
*******************************************************************************/
typedef struct
{
    union {
        __IO uint32_t CREL;
        stc_canfd_crel_field_t CREL_f;
        struct {
          union {
            __IO uint16_t CRELL;
            struct {
              __IO uint8_t CRELLL;
              __IO uint8_t CRELLH;
            };
          };
          union {
            __IO uint16_t CRELH;
            struct {
              __IO uint8_t CRELHL;
              __IO uint8_t CRELHH;
            };
          };
        };
    };
    union {
        __IO uint32_t ENDN;
        stc_canfd_endn_field_t ENDN_f;
        struct {
          union {
            __IO uint16_t ENDNL;
            struct {
              __IO uint8_t ENDNLL;
              __IO uint8_t ENDNLH;
            };
          };
          union {
            __IO uint16_t ENDNH;
            struct {
              __IO uint8_t ENDNHL;
              __IO uint8_t ENDNHH;
            };
          };
        };
    };
        __IO  uint8_t RESERVED0[4];
    union {
        __IO uint32_t FBTP;
        stc_canfd_fbtp_field_t FBTP_f;
        struct {
          union {
            __IO uint16_t FBTPL;
            struct {
              __IO uint8_t FBTPLL;
              __IO uint8_t FBTPLH;
            };
          };
          union {
            __IO uint16_t FBTPH;
            struct {
              __IO uint8_t FBTPHL;
              __IO uint8_t FBTPHH;
            };
          };
        };
    };
    union {
        __IO uint32_t TEST;
        stc_canfd_test_field_t TEST_f;
        struct {
          union {
            __IO uint16_t TESTL;
            struct {
              __IO uint8_t TESTLL;
              __IO uint8_t TESTLH;
            };
          };
          union {
            __IO uint16_t TESTH;
            struct {
              __IO uint8_t TESTHL;
              __IO uint8_t TESTHH;
            };
          };
        };
    };
    union {
        __IO uint32_t RWD;
        stc_canfd_rwd_field_t RWD_f;
        struct {
          union {
            __IO uint16_t RWDL;
            struct {
              __IO uint8_t RWDLL;
              __IO uint8_t RWDLH;
            };
          };
          union {
            __IO uint16_t RWDH;
            struct {
              __IO uint8_t RWDHL;
              __IO uint8_t RWDHH;
            };
          };
        };
    };
    union {
        __IO uint32_t CCCR;
        stc_canfd_cccr_field_t CCCR_f;
        struct {
          union {
            __IO uint16_t CCCRL;
            struct {
              __IO uint8_t CCCRLL;
              __IO uint8_t CCCRLH;
            };
          };
          union {
            __IO uint16_t CCCRH;
            struct {
              __IO uint8_t CCCRHL;
              __IO uint8_t CCCRHH;
            };
          };
        };
    };
    union {
        __IO uint32_t BTP;
        stc_canfd_btp_field_t BTP_f;
        struct {
          union {
            __IO uint16_t BTPL;
            struct {
              __IO uint8_t BTPLL;
              __IO uint8_t BTPLH;
            };
          };
          union {
            __IO uint16_t BTPH;
            struct {
              __IO uint8_t BTPHL;
              __IO uint8_t BTPHH;
            };
          };
        };
    };
    union {
        __IO uint32_t TSCC;
        stc_canfd_tscc_field_t TSCC_f;
        struct {
          union {
            __IO uint16_t TSCCL;
            struct {
              __IO uint8_t TSCCLL;
              __IO uint8_t TSCCLH;
            };
          };
          union {
            __IO uint16_t TSCCH;
            struct {
              __IO uint8_t TSCCHL;
              __IO uint8_t TSCCHH;
            };
          };
        };
    };
    union {
        __IO uint32_t TSCV;
        stc_canfd_tscv_field_t TSCV_f;
        struct {
          union {
            __IO uint16_t TSCVL;
            struct {
              __IO uint8_t TSCVLL;
              __IO uint8_t TSCVLH;
            };
          };
          union {
            __IO uint16_t TSCVH;
            struct {
              __IO uint8_t TSCVHL;
              __IO uint8_t TSCVHH;
            };
          };
        };
    };
    union {
        __IO uint32_t TOCC;
        stc_canfd_tocc_field_t TOCC_f;
        struct {
          union {
            __IO uint16_t TOCCL;
            struct {
              __IO uint8_t TOCCLL;
              __IO uint8_t TOCCLH;
            };
          };
          union {
            __IO uint16_t TOCCH;
            struct {
              __IO uint8_t TOCCHL;
              __IO uint8_t TOCCHH;
            };
          };
        };
    };
    union {
        __IO uint32_t TOCV;
        stc_canfd_tocv_field_t TOCV_f;
        struct {
          union {
            __IO uint16_t TOCVL;
            struct {
              __IO uint8_t TOCVLL;
              __IO uint8_t TOCVLH;
            };
          };
          union {
            __IO uint16_t TOCVH;
            struct {
              __IO uint8_t TOCVHL;
              __IO uint8_t TOCVHH;
            };
          };
        };
    };
        __IO  uint8_t RESERVED1[16];
    union {
        __IO uint32_t ECR;
        stc_canfd_ecr_field_t ECR_f;
        struct {
          union {
            __IO uint16_t ECRL;
            struct {
              __IO uint8_t ECRLL;
              __IO uint8_t ECRLH;
            };
          };
          union {
            __IO uint16_t ECRH;
            struct {
              __IO uint8_t ECRHL;
              __IO uint8_t ECRHH;
            };
          };
        };
    };
    union {
        __IO uint32_t PSR;
        stc_canfd_psr_field_t PSR_f;
        struct {
          union {
            __IO uint16_t PSRL;
            struct {
              __IO uint8_t PSRLL;
              __IO uint8_t PSRLH;
            };
          };
          union {
            __IO uint16_t PSRH;
            struct {
              __IO uint8_t PSRHL;
              __IO uint8_t PSRHH;
            };
          };
        };
    };
        __IO  uint8_t RESERVED2[8];
    union {
        __IO uint32_t IR;
        stc_canfd_ir_field_t IR_f;
        struct {
          union {
            __IO uint16_t IRL;
            struct {
              __IO uint8_t IRLL;
              __IO uint8_t IRLH;
            };
          };
          union {
            __IO uint16_t IRH;
            struct {
              __IO uint8_t IRHL;
              __IO uint8_t IRHH;
            };
          };
        };
    };
    union {
        __IO uint32_t IE;
        stc_canfd_ie_field_t IE_f;
        struct {
          union {
            __IO uint16_t IEL;
            struct {
              __IO uint8_t IELL;
              __IO uint8_t IELH;
            };
          };
          union {
            __IO uint16_t IEH;
            struct {
              __IO uint8_t IEHL;
              __IO uint8_t IEHH;
            };
          };
        };
    };
    union {
        __IO uint32_t ILS;
        stc_canfd_ils_field_t ILS_f;
        struct {
          union {
            __IO uint16_t ILSL;
            struct {
              __IO uint8_t ILSLL;
              __IO uint8_t ILSLH;
            };
          };
          union {
            __IO uint16_t ILSH;
            struct {
              __IO uint8_t ILSHL;
              __IO uint8_t ILSHH;
            };
          };
        };
    };
    union {
        __IO uint32_t ILE;
        stc_canfd_ile_field_t ILE_f;
        struct {
          union {
            __IO uint16_t ILEL;
            struct {
              __IO uint8_t ILELL;
              __IO uint8_t ILELH;
            };
          };
          union {
            __IO uint16_t ILEH;
            struct {
              __IO uint8_t ILEHL;
              __IO uint8_t ILEHH;
            };
          };
        };
    };
        __IO  uint8_t RESERVED3[32];
    union {
        __IO uint32_t GFC;
        stc_canfd_gfc_field_t GFC_f;
        struct {
          union {
            __IO uint16_t GFCL;
            struct {
              __IO uint8_t GFCLL;
              __IO uint8_t GFCLH;
            };
          };
          union {
            __IO uint16_t GFCH;
            struct {
              __IO uint8_t GFCHL;
              __IO uint8_t GFCHH;
            };
          };
        };
    };
    union {
        __IO uint32_t SIDFC;
        stc_canfd_sidfc_field_t SIDFC_f;
        struct {
          union {
            __IO uint16_t SIDFCL;
            struct {
              __IO uint8_t SIDFCLL;
              __IO uint8_t SIDFCLH;
            };
          };
          union {
            __IO uint16_t SIDFCH;
            struct {
              __IO uint8_t SIDFCHL;
              __IO uint8_t SIDFCHH;
            };
          };
        };
    };
    union {
        __IO uint32_t XIDFC;
        stc_canfd_xidfc_field_t XIDFC_f;
        struct {
          union {
            __IO uint16_t XIDFCL;
            struct {
              __IO uint8_t XIDFCLL;
              __IO uint8_t XIDFCLH;
            };
          };
          union {
            __IO uint16_t XIDFCH;
            struct {
              __IO uint8_t XIDFCHL;
              __IO uint8_t XIDFCHH;
            };
          };
        };
    };
        __IO  uint8_t RESERVED4[4];
    union {
        __IO uint32_t XIDAM;
        stc_canfd_xidam_field_t XIDAM_f;
        struct {
          union {
            __IO uint16_t XIDAML;
            struct {
              __IO uint8_t XIDAMLL;
              __IO uint8_t XIDAMLH;
            };
          };
          union {
            __IO uint16_t XIDAMH;
            struct {
              __IO uint8_t XIDAMHL;
              __IO uint8_t XIDAMHH;
            };
          };
        };
    };
    union {
        __IO uint32_t HPMS;
        stc_canfd_hpms_field_t HPMS_f;
        struct {
          union {
            __IO uint16_t HPMSL;
            struct {
              __IO uint8_t HPMSLL;
              __IO uint8_t HPMSLH;
            };
          };
          union {
            __IO uint16_t HPMSH;
            struct {
              __IO uint8_t HPMSHL;
              __IO uint8_t HPMSHH;
            };
          };
        };
    };
    union {
        __IO uint32_t NDAT1;
        stc_canfd_ndat1_field_t NDAT1_f;
        struct {
          union {
            __IO uint16_t NDAT1L;
            struct {
              __IO uint8_t NDAT1LL;
              __IO uint8_t NDAT1LH;
            };
          };
          union {
            __IO uint16_t NDAT1H;
            struct {
              __IO uint8_t NDAT1HL;
              __IO uint8_t NDAT1HH;
            };
          };
        };
    };
    union {
        __IO uint32_t NDAT2;
        stc_canfd_ndat2_field_t NDAT2_f;
        struct {
          union {
            __IO uint16_t NDAT2L;
            struct {
              __IO uint8_t NDAT2LL;
              __IO uint8_t NDAT2LH;
            };
          };
          union {
            __IO uint16_t NDAT2H;
            struct {
              __IO uint8_t NDAT2HL;
              __IO uint8_t NDAT2HH;
            };
          };
        };
    };
    union {
        __IO uint32_t RXF0C;
        stc_canfd_rxf0c_field_t RXF0C_f;
        struct {
          union {
            __IO uint16_t RXF0CL;
            struct {
              __IO uint8_t RXF0CLL;
              __IO uint8_t RXF0CLH;
            };
          };
          union {
            __IO uint16_t RXF0CH;
            struct {
              __IO uint8_t RXF0CHL;
              __IO uint8_t RXF0CHH;
            };
          };
        };
    };
    union {
        __IO uint32_t RXF0S;
        stc_canfd_rxf0s_field_t RXF0S_f;
        struct {
          union {
            __IO uint16_t RXF0SL;
            struct {
              __IO uint8_t RXF0SLL;
              __IO uint8_t RXF0SLH;
            };
          };
          union {
            __IO uint16_t RXF0SH;
            struct {
              __IO uint8_t RXF0SHL;
              __IO uint8_t RXF0SHH;
            };
          };
        };
    };
    union {
        __IO uint32_t RXF0A;
        stc_canfd_rxf0a_field_t RXF0A_f;
        struct {
          union {
            __IO uint16_t RXF0AL;
            struct {
              __IO uint8_t RXF0ALL;
              __IO uint8_t RXF0ALH;
            };
          };
          union {
            __IO uint16_t RXF0AH;
            struct {
              __IO uint8_t RXF0AHL;
              __IO uint8_t RXF0AHH;
            };
          };
        };
    };
    union {
        __IO uint32_t RXBC;
        stc_canfd_rxbc_field_t RXBC_f;
        struct {
          union {
            __IO uint16_t RXBCL;
            struct {
              __IO uint8_t RXBCLL;
              __IO uint8_t RXBCLH;
            };
          };
          union {
            __IO uint16_t RXBCH;
            struct {
              __IO uint8_t RXBCHL;
              __IO uint8_t RXBCHH;
            };
          };
        };
    };
    union {
        __IO uint32_t RXF1C;
        stc_canfd_rxf1c_field_t RXF1C_f;
        struct {
          union {
            __IO uint16_t RXF1CL;
            struct {
              __IO uint8_t RXF1CLL;
              __IO uint8_t RXF1CLH;
            };
          };
          union {
            __IO uint16_t RXF1CH;
            struct {
              __IO uint8_t RXF1CHL;
              __IO uint8_t RXF1CHH;
            };
          };
        };
    };
    union {
        __IO uint32_t RXF1S;
        stc_canfd_rxf1s_field_t RXF1S_f;
        struct {
          union {
            __IO uint16_t RXF1SL;
            struct {
              __IO uint8_t RXF1SLL;
              __IO uint8_t RXF1SLH;
            };
          };
          union {
            __IO uint16_t RXF1SH;
            struct {
              __IO uint8_t RXF1SHL;
              __IO uint8_t RXF1SHH;
            };
          };
        };
    };
    union {
        __IO uint32_t RXF1A;
        stc_canfd_rxf1a_field_t RXF1A_f;
        struct {
          union {
            __IO uint16_t RXF1AL;
            struct {
              __IO uint8_t RXF1ALL;
              __IO uint8_t RXF1ALH;
            };
          };
          union {
            __IO uint16_t RXF1AH;
            struct {
              __IO uint8_t RXF1AHL;
              __IO uint8_t RXF1AHH;
            };
          };
        };
    };
    union {
        __IO uint32_t RXESC;
        stc_canfd_rxesc_field_t RXESC_f;
        struct {
          union {
            __IO uint16_t RXESCL;
            struct {
              __IO uint8_t RXESCLL;
              __IO uint8_t RXESCLH;
            };
          };
          union {
            __IO uint16_t RXESCH;
            struct {
              __IO uint8_t RXESCHL;
              __IO uint8_t RXESCHH;
            };
          };
        };
    };
    union {
        __IO uint32_t TXBC;
        stc_canfd_txbc_field_t TXBC_f;
        struct {
          union {
            __IO uint16_t TXBCL;
            struct {
              __IO uint8_t TXBCLL;
              __IO uint8_t TXBCLH;
            };
          };
          union {
            __IO uint16_t TXBCH;
            struct {
              __IO uint8_t TXBCHL;
              __IO uint8_t TXBCHH;
            };
          };
        };
    };
    union {
        __IO uint32_t TXFQS;
        stc_canfd_txfqs_field_t TXFQS_f;
        struct {
          union {
            __IO uint16_t TXFQSL;
            struct {
              __IO uint8_t TXFQSLL;
              __IO uint8_t TXFQSLH;
            };
          };
          union {
            __IO uint16_t TXFQSH;
            struct {
              __IO uint8_t TXFQSHL;
              __IO uint8_t TXFQSHH;
            };
          };
        };
    };
    union {
        __IO uint32_t TXESC;
        stc_canfd_txesc_field_t TXESC_f;
        struct {
          union {
            __IO uint16_t TXESCL;
            struct {
              __IO uint8_t TXESCLL;
              __IO uint8_t TXESCLH;
            };
          };
          union {
            __IO uint16_t TXESCH;
            struct {
              __IO uint8_t TXESCHL;
              __IO uint8_t TXESCHH;
            };
          };
        };
    };
    union {
        __IO uint32_t TXBRP;
        stc_canfd_txbrp_field_t TXBRP_f;
        struct {
          union {
            __IO uint16_t TXBRPL;
            struct {
              __IO uint8_t TXBRPLL;
              __IO uint8_t TXBRPLH;
            };
          };
          union {
            __IO uint16_t TXBRPH;
            struct {
              __IO uint8_t TXBRPHL;
              __IO uint8_t TXBRPHH;
            };
          };
        };
    };
    union {
        __IO uint32_t TXBAR;
        stc_canfd_txbar_field_t TXBAR_f;
        struct {
          union {
            __IO uint16_t TXBARL;
            struct {
              __IO uint8_t TXBARLL;
              __IO uint8_t TXBARLH;
            };
          };
          union {
            __IO uint16_t TXBARH;
            struct {
              __IO uint8_t TXBARHL;
              __IO uint8_t TXBARHH;
            };
          };
        };
    };
    union {
        __IO uint32_t TXBCR;
        stc_canfd_txbcr_field_t TXBCR_f;
        struct {
          union {
            __IO uint16_t TXBCRL;
            struct {
              __IO uint8_t TXBCRLL;
              __IO uint8_t TXBCRLH;
            };
          };
          union {
            __IO uint16_t TXBCRH;
            struct {
              __IO uint8_t TXBCRHL;
              __IO uint8_t TXBCRHH;
            };
          };
        };
    };
    union {
        __IO uint32_t TXBTO;
        stc_canfd_txbto_field_t TXBTO_f;
        struct {
          union {
            __IO uint16_t TXBTOL;
            struct {
              __IO uint8_t TXBTOLL;
              __IO uint8_t TXBTOLH;
            };
          };
          union {
            __IO uint16_t TXBTOH;
            struct {
              __IO uint8_t TXBTOHL;
              __IO uint8_t TXBTOHH;
            };
          };
        };
    };
    union {
        __IO uint32_t TXBCF;
        stc_canfd_txbcf_field_t TXBCF_f;
        struct {
          union {
            __IO uint16_t TXBCFL;
            struct {
              __IO uint8_t TXBCFLL;
              __IO uint8_t TXBCFLH;
            };
          };
          union {
            __IO uint16_t TXBCFH;
            struct {
              __IO uint8_t TXBCFHL;
              __IO uint8_t TXBCFHH;
            };
          };
        };
    };
    union {
        __IO uint32_t TXBTIE;
        stc_canfd_txbtie_field_t TXBTIE_f;
        struct {
          union {
            __IO uint16_t TXBTIEL;
            struct {
              __IO uint8_t TXBTIELL;
              __IO uint8_t TXBTIELH;
            };
          };
          union {
            __IO uint16_t TXBTIEH;
            struct {
              __IO uint8_t TXBTIEHL;
              __IO uint8_t TXBTIEHH;
            };
          };
        };
    };
    union {
        __IO uint32_t TXBCIE;
        stc_canfd_txbcie_field_t TXBCIE_f;
        struct {
          union {
            __IO uint16_t TXBCIEL;
            struct {
              __IO uint8_t TXBCIELL;
              __IO uint8_t TXBCIELH;
            };
          };
          union {
            __IO uint16_t TXBCIEH;
            struct {
              __IO uint8_t TXBCIEHL;
              __IO uint8_t TXBCIEHH;
            };
          };
        };
    };
        __IO  uint8_t RESERVED5[8];
    union {
        __IO uint32_t TXEFC;
        stc_canfd_txefc_field_t TXEFC_f;
        struct {
          union {
            __IO uint16_t TXEFCL;
            struct {
              __IO uint8_t TXEFCLL;
              __IO uint8_t TXEFCLH;
            };
          };
          union {
            __IO uint16_t TXEFCH;
            struct {
              __IO uint8_t TXEFCHL;
              __IO uint8_t TXEFCHH;
            };
          };
        };
    };
    union {
        __IO uint32_t TXFS;
        stc_canfd_txfs_field_t TXFS_f;
        struct {
          union {
            __IO uint16_t TXFSL;
            struct {
              __IO uint8_t TXFSLL;
              __IO uint8_t TXFSLH;
            };
          };
          union {
            __IO uint16_t TXFSH;
            struct {
              __IO uint8_t TXFSHL;
              __IO uint8_t TXFSHH;
            };
          };
        };
    };
    union {
        __IO uint32_t TXFA;
        stc_canfd_txfa_field_t TXFA_f;
        struct {
          union {
            __IO uint16_t TXFAL;
            struct {
              __IO uint8_t TXFALL;
              __IO uint8_t TXFALH;
            };
          };
          union {
            __IO uint16_t TXFAH;
            struct {
              __IO uint8_t TXFAHL;
              __IO uint8_t TXFAHH;
            };
          };
        };
    };
        __IO  uint8_t RESERVED6[260];
    union {
        __IO  uint8_t FDECR;
        stc_canfd_fdecr_field_t FDECR_f;
    };
    union {
        __IO  uint8_t FDESR;
        stc_canfd_fdesr_field_t FDESR_f;
    };
    union {
        __IO uint16_t FDSEAR;
        stc_canfd_fdsear_field_t FDSEAR_f;
        struct {
            __IO  uint8_t FDSEARL;
            __IO  uint8_t FDSEARH;
        };
    };
        __IO  uint8_t RESERVED7[1];
    union {
        __IO  uint8_t FDESCR;
        stc_canfd_fdescr_field_t FDESCR_f;
    };
    union {
        __IO uint16_t FDDEAR;
        stc_canfd_fddear_field_t FDDEAR_f;
        struct {
            __IO  uint8_t FDDEARL;
            __IO  uint8_t FDDEARH;
        };
    };
        __IO  uint8_t RESERVED8[8];
    union {
        __IO uint16_t TSCNTR;
        stc_canfd_tscntr_field_t TSCNTR_f;
        struct {
            __IO  uint8_t TSCNTRL;
            __IO  uint8_t TSCNTRH;
        };
    };
    union {
        __IO uint16_t TSMDR;
        stc_canfd_tsmdr_field_t TSMDR_f;
        struct {
            __IO  uint8_t TSMDRL;
            __IO  uint8_t TSMDRH;
        };
    };
    union {
        __IO uint32_t TSDIVR;
        stc_canfd_tsdivr_field_t TSDIVR_f;
        struct {
          union {
            __IO uint16_t TSDIVRL;
            struct {
              __IO uint8_t TSDIVRLL;
              __IO uint8_t TSDIVRLH;
            };
          };
          union {
            __IO uint16_t TSDIVRH;
            struct {
              __IO uint8_t TSDIVRHL;
              __IO uint8_t TSDIVRHH;
            };
          };
        };
    };
    union {
        __IO uint16_t TSCDTR;
        stc_canfd_tscdtr_field_t TSCDTR_f;
        struct {
            __IO  uint8_t TSCDTRL;
            __IO  uint8_t TSCDTRH;
        };
    };
    union {
        __IO uint16_t TSCPCLR;
        stc_canfd_tscpclr_field_t TSCPCLR_f;
        struct {
            __IO  uint8_t TSCPCLRL;
            __IO  uint8_t TSCPCLRH;
        };
    };
