sol4ik/audio-steganography/try/fm4/s6e2ccxh/common/s6e2ccxh.h
/*******************************************************************************
* SBSSR_MODULE
*   register structur
*******************************************************************************/
typedef struct
{
        __IO  uint8_t RESERVED0[252];
    union {
        __IO uint16_t BTSSSR;
        stc_sbssr_btsssr_field_t BTSSSR_f;
        struct {
            __IO  uint8_t BTSSSRL;
            __IO  uint8_t BTSSSRH;
        };
    };
} FM_SBSSR_TypeDef, FM4_SBSSR_TypeDef;

/*******************************************************************************
* SDIF_MODULE
*   register structur
*******************************************************************************/
typedef struct
{
    union {
        __IO uint32_t SSA2;
        struct {
          union {
            __IO uint16_t SSA2L;
            struct {
              __IO uint8_t SSA2LL;
              __IO uint8_t SSA2LH;
            };
          };
          union {
            __IO uint16_t SSA2H;
            struct {
              __IO uint8_t SSA2HL;
              __IO uint8_t SSA2HH;
            };
          };
        };
    };
    union {
        __IO uint16_t SBSIZE;
        stc_sdif_sbsize_field_t SBSIZE_f;
        struct {
            __IO  uint8_t SBSIZEL;
            __IO  uint8_t SBSIZEH;
        };
    };
    union {
        __IO uint16_t SBLCNT;
        struct {
            __IO  uint8_t SBLCNTL;
            __IO  uint8_t SBLCNTH;
        };
    };
    union {
        __IO uint32_t SSA1;
        struct {
          union {
            __IO uint16_t SSA1L;
            struct {
              __IO uint8_t SSA1LL;
              __IO uint8_t SSA1LH;
            };
          };
          union {
            __IO uint16_t SSA1H;
            struct {
              __IO uint8_t SSA1HL;
              __IO uint8_t SSA1HH;
            };
          };
        };
    };
    union {
        __IO uint16_t STRSFMD;
        stc_sdif_strsfmd_field_t STRSFMD_f;
        struct {
            __IO  uint8_t STRSFMDL;
            __IO  uint8_t STRSFMDH;
        };
    };
    union {
        __IO uint16_t SCMMD;
        stc_sdif_scmmd_field_t SCMMD_f;
        struct {
            __IO  uint8_t SCMMDL;
            __IO  uint8_t SCMMDH;
        };
    };
    union {
        __IO uint16_t SRESP0;
        struct {
            __IO  uint8_t SRESP0L;
            __IO  uint8_t SRESP0H;
        };
    };
    union {
        __IO uint16_t SRESP1;
        struct {
            __IO  uint8_t SRESP1L;
            __IO  uint8_t SRESP1H;
        };
    };
    union {
        __IO uint16_t SRESP2;
        struct {
            __IO  uint8_t SRESP2L;
            __IO  uint8_t SRESP2H;
        };
    };
    union {
        __IO uint16_t SRESP3;
        struct {
            __IO  uint8_t SRESP3L;
            __IO  uint8_t SRESP3H;
        };
    };
    union {
        __IO uint16_t SRESP4;
        struct {
            __IO  uint8_t SRESP4L;
            __IO  uint8_t SRESP4H;
        };
    };
    union {
        __IO uint16_t SRESP5;
        struct {
            __IO  uint8_t SRESP5L;
            __IO  uint8_t SRESP5H;
        };
    };
    union {
        __IO uint16_t SRESP6;
        struct {
            __IO  uint8_t SRESP6L;
            __IO  uint8_t SRESP6H;
        };
    };
    union {
        __IO uint16_t SRESP7;
        struct {
            __IO  uint8_t SRESP7L;
            __IO  uint8_t SRESP7H;
        };
    };
    union {
        __IO uint32_t SBUFDP;
        struct {
          union {
            __IO uint16_t SBUFDPL;
            struct {
              __IO uint8_t SBUFDPLL;
              __IO uint8_t SBUFDPLH;
            };
          };
          union {
            __IO uint16_t SBUFDPH;
            struct {
              __IO uint8_t SBUFDPHL;
              __IO uint8_t SBUFDPHH;
            };
          };
        };
    };
    union {
        __IO uint32_t SPRSTAT;
        stc_sdif_sprstat_field_t SPRSTAT_f;
        struct {
          union {
            __IO uint16_t SPRSTATL;
            struct {
              __IO uint8_t SPRSTATLL;
              __IO uint8_t SPRSTATLH;
            };
          };
          union {
            __IO uint16_t SPRSTATH;
            struct {
              __IO uint8_t SPRSTATHL;
              __IO uint8_t SPRSTATHH;
            };
          };
        };
    };
    union {
        __IO  uint8_t SHCTL1;
        stc_sdif_shctl1_field_t SHCTL1_f;
    };
    union {
        __IO  uint8_t SPWRCTL;
        stc_sdif_spwrctl_field_t SPWRCTL_f;
    };
    union {
        __IO  uint8_t SBLKGPCTL;
        stc_sdif_sblkgpctl_field_t SBLKGPCTL_f;
    };
    union {
        __IO  uint8_t SWKUPCTL;
        stc_sdif_swkupctl_field_t SWKUPCTL_f;
    };
    union {
        __IO uint16_t SCLKCTL;
        stc_sdif_sclkctl_field_t SCLKCTL_f;
        struct {
            __IO  uint8_t SCLKCTLL;
            __IO  uint8_t SCLKCTLH;
        };
    };
    union {
        __IO  uint8_t STOCTL;
        stc_sdif_stoctl_field_t STOCTL_f;
    };
    union {
        __IO  uint8_t SSRST;
        stc_sdif_ssrst_field_t SSRST_f;
    };
    union {
        __IO uint16_t SNINTST;
        stc_sdif_snintst_field_t SNINTST_f;
        struct {
            __IO  uint8_t SNINTSTL;
            __IO  uint8_t SNINTSTH;
        };
    };
    union {
        __IO uint16_t SEINTST;
        stc_sdif_seintst_field_t SEINTST_f;
        struct {
            __IO  uint8_t SEINTSTL;
            __IO  uint8_t SEINTSTH;
        };
    };
    union {
        __IO uint16_t SNINTSTE;
        stc_sdif_snintste_field_t SNINTSTE_f;
        struct {
            __IO  uint8_t SNINTSTEL;
            __IO  uint8_t SNINTSTEH;
        };
    };
    union {
        __IO uint16_t SEINTSTE;
        stc_sdif_seintste_field_t SEINTSTE_f;
        struct {
            __IO  uint8_t SEINTSTEL;
            __IO  uint8_t SEINTSTEH;
        };
    };
    union {
        __IO uint16_t SNINTSGE;
        stc_sdif_snintsge_field_t SNINTSGE_f;
        struct {
            __IO  uint8_t SNINTSGEL;
            __IO  uint8_t SNINTSGEH;
        };
    };
    union {
        __IO uint16_t SEINTSGE;
        stc_sdif_seintsge_field_t SEINTSGE_f;
        struct {
            __IO  uint8_t SEINTSGEL;
            __IO  uint8_t SEINTSGEH;
        };
    };
    union {
        __IO uint16_t SACMDEST;
        stc_sdif_sacmdest_field_t SACMDEST_f;
        struct {
            __IO  uint8_t SACMDESTL;
            __IO  uint8_t SACMDESTH;
        };
    };
    union {
        __IO uint16_t SHCTL2;
        stc_sdif_shctl2_field_t SHCTL2_f;
        struct {
            __IO  uint8_t SHCTL2L;
            __IO  uint8_t SHCTL2H;
        };
    };
    union {
        __IO uint16_t CAPBLTY0;
        stc_sdif_capblty0_field_t CAPBLTY0_f;
        struct {
            __IO  uint8_t CAPBLTY0L;
            __IO  uint8_t CAPBLTY0H;
        };
    };
    union {
        __IO uint16_t CAPBLTY1;
        stc_sdif_capblty1_field_t CAPBLTY1_f;
        struct {
            __IO  uint8_t CAPBLTY1L;
            __IO  uint8_t CAPBLTY1H;
        };
    };
    union {
        __IO uint16_t CAPBLTY2;
        stc_sdif_capblty2_field_t CAPBLTY2_f;
        struct {
            __IO  uint8_t CAPBLTY2L;
            __IO  uint8_t CAPBLTY2H;
        };
    };
    union {
        __IO uint16_t CAPBLTY3;
        stc_sdif_capblty3_field_t CAPBLTY3_f;
        struct {
            __IO  uint8_t CAPBLTY3L;
            __IO  uint8_t CAPBLTY3H;
        };
    };
    union {
        __IO uint16_t MXCCAPY0;
        stc_sdif_mxccapy0_field_t MXCCAPY0_f;
        struct {
            __IO  uint8_t MXCCAPY0L;
            __IO  uint8_t MXCCAPY0H;
        };
    };
    union {
        __IO uint16_t MXCCAPY1;
        stc_sdif_mxccapy1_field_t MXCCAPY1_f;
        struct {
            __IO  uint8_t MXCCAPY1L;
            __IO  uint8_t MXCCAPY1H;
        };
    };
    union {
        __IO uint16_t MXCCAPY2;
        struct {
            __IO  uint8_t MXCCAPY2L;
            __IO  uint8_t MXCCAPY2H;
        };
    };
    union {
        __IO uint16_t MXCCAPY3;
        struct {
            __IO  uint8_t MXCCAPY3L;
            __IO  uint8_t MXCCAPY3H;
        };
    };
    union {
        __IO uint16_t FEACEST;
        stc_sdif_feacest_field_t FEACEST_f;
        struct {
            __IO  uint8_t FEACESTL;
            __IO  uint8_t FEACESTH;
        };
    };
    union {
        __IO uint16_t SFEEIST;
        stc_sdif_sfeeist_field_t SFEEIST_f;
        struct {
            __IO  uint8_t SFEEISTL;
            __IO  uint8_t SFEEISTH;
        };
    };
    union {
        __IO  uint8_t ADMAEST;
        stc_sdif_admaest_field_t ADMAEST_f;
    };
        __IO  uint8_t RESERVED0[3];
    union {
        __IO uint16_t SADSA0;
        stc_sdif_sadsa0_field_t SADSA0_f;
        struct {
            __IO  uint8_t SADSA0L;
            __IO  uint8_t SADSA0H;
        };
    };
    union {
        __IO uint16_t SADSA1;
        stc_sdif_sadsa1_field_t SADSA1_f;
        struct {
            __IO  uint8_t SADSA1L;
            __IO  uint8_t SADSA1H;
        };
    };
    union {
        __IO uint16_t SADSA2;
        stc_sdif_sadsa2_field_t SADSA2_f;
        struct {
            __IO  uint8_t SADSA2L;
            __IO  uint8_t SADSA2H;
        };
    };
    union {
        __IO uint16_t SADSA3;
        stc_sdif_sadsa3_field_t SADSA3_f;
        struct {
            __IO  uint8_t SADSA3L;
            __IO  uint8_t SADSA3H;
        };
    };
    union {
        __IO uint16_t SPRVAL0;
        stc_sdif_sprval0_field_t SPRVAL0_f;
        struct {
            __IO  uint8_t SPRVAL0L;
            __IO  uint8_t SPRVAL0H;
        };
    };
    union {
        __IO uint16_t SPRVAL1;
        stc_sdif_sprval1_field_t SPRVAL1_f;
        struct {
            __IO  uint8_t SPRVAL1L;
            __IO  uint8_t SPRVAL1H;
        };
    };
    union {
        __IO uint16_t SPRVAL2;
        stc_sdif_sprval2_field_t SPRVAL2_f;
        struct {
            __IO  uint8_t SPRVAL2L;
            __IO  uint8_t SPRVAL2H;
        };
    };
    union {
        __IO uint16_t SPRVAL3;
        stc_sdif_sprval3_field_t SPRVAL3_f;
        struct {
            __IO  uint8_t SPRVAL3L;
            __IO  uint8_t SPRVAL3H;
        };
    };
    union {
        __IO uint16_t SPRVAL4;
        stc_sdif_sprval4_field_t SPRVAL4_f;
        struct {
            __IO  uint8_t SPRVAL4L;
            __IO  uint8_t SPRVAL4H;
        };
    };
    union {
        __IO uint16_t SPRVAL5;
        stc_sdif_sprval5_field_t SPRVAL5_f;
        struct {
            __IO  uint8_t SPRVAL5L;
            __IO  uint8_t SPRVAL5H;
        };
    };
    union {
        __IO uint16_t SPRVAL6;
        stc_sdif_sprval6_field_t SPRVAL6_f;
        struct {
            __IO  uint8_t SPRVAL6L;
            __IO  uint8_t SPRVAL6H;
        };
    };
    union {
        __IO uint16_t SPRVAL7;
        stc_sdif_sprval7_field_t SPRVAL7_f;
        struct {
            __IO  uint8_t SPRVAL7L;
            __IO  uint8_t SPRVAL7H;
        };
    };
        __IO  uint8_t RESERVED1[112];
    union {
        __IO uint16_t SSHBCTLL;
        stc_sdif_sshbctll_field_t SSHBCTLL_f;
        struct {
            __IO  uint8_t SSHBCTLLL;
            __IO  uint8_t SSHBCTLLH;
        };
    };
    union {
        __IO uint16_t SSHBCTLH;
        stc_sdif_sshbctlh_field_t SSHBCTLH_f;
        struct {
            __IO  uint8_t SSHBCTLHL;
            __IO  uint8_t SSHBCTLHH;
        };
    };
        __IO  uint8_t RESERVED2[24];
    union {
        __IO uint16_t SSLIST;
        stc_sdif_sslist_field_t SSLIST_f;
        struct {
            __IO  uint8_t SSLISTL;
            __IO  uint8_t SSLISTH;
        };
    };
    union {
        __IO uint16_t SHCTLV;
        stc_sdif_shctlv_field_t SHCTLV_f;
        struct {
            __IO  uint8_t SHCTLVL;
            __IO  uint8_t SHCTLVH;
        };
    };
    union {
        __IO uint16_t AHBCFGL;
        stc_sdif_ahbcfgl_field_t AHBCFGL_f;
        struct {
            __IO  uint8_t AHBCFGLL;
            __IO  uint8_t AHBCFGLH;
        };
    };
    union {
        __IO uint16_t AHBCFGH;
        struct {
            __IO  uint8_t AHBCFGHL;
            __IO  uint8_t AHBCFGHH;
        };
    };
    union {
        __IO uint16_t SPWSWCL;
        stc_sdif_spwswcl_field_t SPWSWCL_f;
        struct {
            __IO  uint8_t SPWSWCLL;
            __IO  uint8_t SPWSWCLH;
        };
    };
    union {
        __IO uint16_t SPWSWCH;
        struct {
            __IO  uint8_t SPWSWCHL;
            __IO  uint8_t SPWSWCHH;
        };
    };
    union {
        __IO uint16_t STUNSETL;
        stc_sdif_stunsetl_field_t STUNSETL_f;
        struct {
            __IO  uint8_t STUNSETLL;
            __IO  uint8_t STUNSETLH;
        };
    };
    union {
        __IO uint16_t STUNSETH;
        stc_sdif_stunseth_field_t STUNSETH_f;
        struct {
            __IO  uint8_t STUNSETHL;
            __IO  uint8_t STUNSETHH;
        };
    };
    union {
        __IO uint16_t STUNSTL;
        stc_sdif_stunstl_field_t STUNSTL_f;
        struct {
            __IO  uint8_t STUNSTLL;
            __IO  uint8_t STUNSTLH;
        };
    };
    union {
        __IO uint16_t STUNSTH;
        stc_sdif_stunsth_field_t STUNSTH_f;
        struct {
            __IO  uint8_t STUNSTHL;
            __IO  uint8_t STUNSTHH;
        };
    };
        __IO  uint8_t RESERVED3[8];
    union {
        __IO uint16_t PSWISTL;
        stc_sdif_pswistl_field_t PSWISTL_f;
        struct {
            __IO  uint8_t PSWISTLL;
            __IO  uint8_t PSWISTLH;
        };
    };
    union {
        __IO uint16_t PSWISTH;
        struct {
            __IO  uint8_t PSWISTHL;
            __IO  uint8_t PSWISTHH;
        };
    };
    union {
        __IO uint16_t PSWISTEL;
        stc_sdif_pswistel_field_t PSWISTEL_f;
        struct {
            __IO  uint8_t PSWISTELL;
            __IO  uint8_t PSWISTELH;
        };
    };
    union {
        __IO uint16_t PSWISTEH;
        struct {
            __IO  uint8_t PSWISTEHL;
            __IO  uint8_t PSWISTEHH;
        };
    };
    union {
        __IO uint16_t PSWISGEL;
        stc_sdif_pswisgel_field_t PSWISGEL_f;
        struct {
            __IO  uint8_t PSWISGELL;
            __IO  uint8_t PSWISGELH;
        };
    };
    union {
        __IO uint16_t PSWISGEH;
        struct {
            __IO  uint8_t PSWISGEHL;
            __IO  uint8_t PSWISGEHH;
        };
    };
    union {
        __IO uint16_t MMCSDCL;
        stc_sdif_mmcsdcl_field_t MMCSDCL_f;
        struct {
            __IO  uint8_t MMCSDCLL;
            __IO  uint8_t MMCSDCLH;
        };
    };
    union {
        __IO uint16_t MMCSDCH;
        stc_sdif_mmcsdch_field_t MMCSDCH_f;
        struct {
            __IO  uint8_t MMCSDCHL;
            __IO  uint8_t MMCSDCHH;
        };
    };
    union {
        __IO uint16_t MCWIRQC0;
        stc_sdif_mcwirqc0_field_t MCWIRQC0_f;
        struct {
            __IO  uint8_t MCWIRQC0L;
            __IO  uint8_t MCWIRQC0H;
        };
    };
    union {
        __IO uint16_t MCWIRQC1;
        stc_sdif_mcwirqc1_field_t MCWIRQC1_f;
        struct {
            __IO  uint8_t MCWIRQC1L;
            __IO  uint8_t MCWIRQC1H;
        };
    };
    union {
        __IO uint16_t MCWIRQC2;
        stc_sdif_mcwirqc2_field_t MCWIRQC2_f;
        struct {
            __IO  uint8_t MCWIRQC2L;
            __IO  uint8_t MCWIRQC2H;
        };
    };
    union {
        __IO uint16_t MCWIRQC3;
        stc_sdif_mcwirqc3_field_t MCWIRQC3_f;
        struct {
            __IO  uint8_t MCWIRQC3L;
            __IO  uint8_t MCWIRQC3H;
        };
    };
    union {
        __IO uint16_t MCRPCKBL;
        stc_sdif_mcrpckbl_field_t MCRPCKBL_f;
        struct {
            __IO  uint8_t MCRPCKBLL;
            __IO  uint8_t MCRPCKBLH;
        };
    };
    union {
        __IO uint16_t MCRPCKBH;
        struct {
            __IO  uint8_t MCRPCKBHL;
            __IO  uint8_t MCRPCKBHH;
        };
    };
        __IO  uint8_t RESERVED4[32];
    union {
        __IO uint16_t SCDETECS;
        stc_sdif_scdetecs_field_t SCDETECS_f;
        struct {
            __IO  uint8_t SCDETECSL;
            __IO  uint8_t SCDETECSH;
        };
    };
} FM_SDIF_TypeDef, FM4_SDIF_TypeDef;

