sol4ik/audio-steganography/try/fm4/s6e2ccxh/common/s6e2ccxh.h
/*******************************************************************************
* BT Registers BT10
*   Register Definition
*******************************************************************************/
#define FM_BT10_PPG_PRLL                          *((volatile uint16_t*)(0x40025480UL))
#define FM4_BT10_PPG_PRLL                         *((volatile uint16_t*)(0x40025480UL))
#define FM_BT10_PWM_PCSR                          *((volatile uint16_t*)(0x40025480UL))
#define FM4_BT10_PWM_PCSR                         *((volatile uint16_t*)(0x40025480UL))
#define FM_BT10_RT_PCSR                           *((volatile uint16_t*)(0x40025480UL))
#define FM4_BT10_RT_PCSR                          *((volatile uint16_t*)(0x40025480UL))
#define FM_BT10_PPG_PRLH                          *((volatile uint16_t*)(0x40025484UL))
#define FM4_BT10_PPG_PRLH                         *((volatile uint16_t*)(0x40025484UL))
#define FM_BT10_PWC_DTBF                          *((volatile uint16_t*)(0x40025484UL))
#define FM4_BT10_PWC_DTBF                         *((volatile uint16_t*)(0x40025484UL))
#define FM_BT10_PWM_PDUT                          *((volatile uint16_t*)(0x40025484UL))
#define FM4_BT10_PWM_PDUT                         *((volatile uint16_t*)(0x40025484UL))
#define FM_BT10_PPG_TMR                           *((volatile uint16_t*)(0x40025488UL))
#define FM4_BT10_PPG_TMR                          *((volatile uint16_t*)(0x40025488UL))
#define FM_BT10_PWM_TMR                           *((volatile uint16_t*)(0x40025488UL))
#define FM4_BT10_PWM_TMR                          *((volatile uint16_t*)(0x40025488UL))
#define FM_BT10_RT_TMR                            *((volatile uint16_t*)(0x40025488UL))
#define FM4_BT10_RT_TMR                           *((volatile uint16_t*)(0x40025488UL))
#define FM_BT10_PPG_TMCR                          *((volatile uint16_t*)(0x4002548CUL))
#define FM4_BT10_PPG_TMCR                         *((volatile uint16_t*)(0x4002548CUL))
#define FM_BT10_PWC_TMCR                          *((volatile uint16_t*)(0x4002548CUL))
#define FM4_BT10_PWC_TMCR                         *((volatile uint16_t*)(0x4002548CUL))
#define FM_BT10_PWM_TMCR                          *((volatile uint16_t*)(0x4002548CUL))
#define FM4_BT10_PWM_TMCR                         *((volatile uint16_t*)(0x4002548CUL))
#define FM_BT10_RT_TMCR                           *((volatile uint16_t*)(0x4002548CUL))
#define FM4_BT10_RT_TMCR                          *((volatile uint16_t*)(0x4002548CUL))
#define FM_BT10_PPG_STC                           *((volatile  uint8_t*)(0x40025490UL))
#define FM4_BT10_PPG_STC                          *((volatile  uint8_t*)(0x40025490UL))
#define FM_BT10_PWC_STC                           *((volatile  uint8_t*)(0x40025490UL))
#define FM4_BT10_PWC_STC                          *((volatile  uint8_t*)(0x40025490UL))
#define FM_BT10_PWM_STC                           *((volatile  uint8_t*)(0x40025490UL))
#define FM4_BT10_PWM_STC                          *((volatile  uint8_t*)(0x40025490UL))
#define FM_BT10_RT_STC                            *((volatile  uint8_t*)(0x40025490UL))
#define FM4_BT10_RT_STC                           *((volatile  uint8_t*)(0x40025490UL))
#define FM_BT10_PPG_TMCR2                         *((volatile  uint8_t*)(0x40025491UL))
#define FM4_BT10_PPG_TMCR2                        *((volatile  uint8_t*)(0x40025491UL))
#define FM_BT10_PWC_TMCR2                         *((volatile  uint8_t*)(0x40025491UL))
#define FM4_BT10_PWC_TMCR2                        *((volatile  uint8_t*)(0x40025491UL))
#define FM_BT10_PWM_TMCR2                         *((volatile  uint8_t*)(0x40025491UL))
#define FM4_BT10_PWM_TMCR2                        *((volatile  uint8_t*)(0x40025491UL))
#define FM_BT10_RT_TMCR2                          *((volatile  uint8_t*)(0x40025491UL))
#define FM4_BT10_RT_TMCR2                         *((volatile  uint8_t*)(0x40025491UL))

/*******************************************************************************
* BT Registers BT11
*   Register Definition
*******************************************************************************/
#define FM_BT11_PPG_PRLL                          *((volatile uint16_t*)(0x400254C0UL))
#define FM4_BT11_PPG_PRLL                         *((volatile uint16_t*)(0x400254C0UL))
#define FM_BT11_PWM_PCSR                          *((volatile uint16_t*)(0x400254C0UL))
#define FM4_BT11_PWM_PCSR                         *((volatile uint16_t*)(0x400254C0UL))
#define FM_BT11_RT_PCSR                           *((volatile uint16_t*)(0x400254C0UL))
#define FM4_BT11_RT_PCSR                          *((volatile uint16_t*)(0x400254C0UL))
#define FM_BT11_PPG_PRLH                          *((volatile uint16_t*)(0x400254C4UL))
#define FM4_BT11_PPG_PRLH                         *((volatile uint16_t*)(0x400254C4UL))
#define FM_BT11_PWC_DTBF                          *((volatile uint16_t*)(0x400254C4UL))
#define FM4_BT11_PWC_DTBF                         *((volatile uint16_t*)(0x400254C4UL))
#define FM_BT11_PWM_PDUT                          *((volatile uint16_t*)(0x400254C4UL))
#define FM4_BT11_PWM_PDUT                         *((volatile uint16_t*)(0x400254C4UL))
#define FM_BT11_PPG_TMR                           *((volatile uint16_t*)(0x400254C8UL))
#define FM4_BT11_PPG_TMR                          *((volatile uint16_t*)(0x400254C8UL))
#define FM_BT11_PWM_TMR                           *((volatile uint16_t*)(0x400254C8UL))
#define FM4_BT11_PWM_TMR                          *((volatile uint16_t*)(0x400254C8UL))
#define FM_BT11_RT_TMR                            *((volatile uint16_t*)(0x400254C8UL))
#define FM4_BT11_RT_TMR                           *((volatile uint16_t*)(0x400254C8UL))
#define FM_BT11_PPG_TMCR                          *((volatile uint16_t*)(0x400254CCUL))
#define FM4_BT11_PPG_TMCR                         *((volatile uint16_t*)(0x400254CCUL))
#define FM_BT11_PWC_TMCR                          *((volatile uint16_t*)(0x400254CCUL))
#define FM4_BT11_PWC_TMCR                         *((volatile uint16_t*)(0x400254CCUL))
#define FM_BT11_PWM_TMCR                          *((volatile uint16_t*)(0x400254CCUL))
#define FM4_BT11_PWM_TMCR                         *((volatile uint16_t*)(0x400254CCUL))
#define FM_BT11_RT_TMCR                           *((volatile uint16_t*)(0x400254CCUL))
#define FM4_BT11_RT_TMCR                          *((volatile uint16_t*)(0x400254CCUL))
#define FM_BT11_PPG_STC                           *((volatile  uint8_t*)(0x400254D0UL))
#define FM4_BT11_PPG_STC                          *((volatile  uint8_t*)(0x400254D0UL))
#define FM_BT11_PWC_STC                           *((volatile  uint8_t*)(0x400254D0UL))
#define FM4_BT11_PWC_STC                          *((volatile  uint8_t*)(0x400254D0UL))
#define FM_BT11_PWM_STC                           *((volatile  uint8_t*)(0x400254D0UL))
#define FM4_BT11_PWM_STC                          *((volatile  uint8_t*)(0x400254D0UL))
#define FM_BT11_RT_STC                            *((volatile  uint8_t*)(0x400254D0UL))
#define FM4_BT11_RT_STC                           *((volatile  uint8_t*)(0x400254D0UL))
#define FM_BT11_PPG_TMCR2                         *((volatile  uint8_t*)(0x400254D1UL))
#define FM4_BT11_PPG_TMCR2                        *((volatile  uint8_t*)(0x400254D1UL))
#define FM_BT11_PWC_TMCR2                         *((volatile  uint8_t*)(0x400254D1UL))
#define FM4_BT11_PWC_TMCR2                        *((volatile  uint8_t*)(0x400254D1UL))
#define FM_BT11_PWM_TMCR2                         *((volatile  uint8_t*)(0x400254D1UL))
#define FM4_BT11_PWM_TMCR2                        *((volatile  uint8_t*)(0x400254D1UL))
#define FM_BT11_RT_TMCR2                          *((volatile  uint8_t*)(0x400254D1UL))
#define FM4_BT11_RT_TMCR2                         *((volatile  uint8_t*)(0x400254D1UL))

