sol4ik/audio-steganography/try/fm4/s6e2ccxh/common/s6e2ccxh.h
/*******************************************************************************
* HWWDT Registers HWWDT
*   Register Definition
*******************************************************************************/
#define FM_HWWDT_WDG_LDR                          *((volatile uint32_t*)(0x40011000UL))
#define FM4_HWWDT_WDG_LDR                         *((volatile uint32_t*)(0x40011000UL))
#define FM_HWWDT_WDG_VLR                          *((volatile uint32_t*)(0x40011004UL))
#define FM4_HWWDT_WDG_VLR                         *((volatile uint32_t*)(0x40011004UL))
#define FM_HWWDT_WDG_CTL                          *((volatile uint32_t*)(0x40011008UL))
#define FM4_HWWDT_WDG_CTL                         *((volatile uint32_t*)(0x40011008UL))
#define FM_HWWDT_WDG_ICL                          *((volatile uint32_t*)(0x4001100CUL))
#define FM4_HWWDT_WDG_ICL                         *((volatile uint32_t*)(0x4001100CUL))
#define FM_HWWDT_WDG_RIS                          *((volatile uint32_t*)(0x40011010UL))
#define FM4_HWWDT_WDG_RIS                         *((volatile uint32_t*)(0x40011010UL))
#define FM_HWWDT_WDG_LCK                          *((volatile uint32_t*)(0x40011C00UL))
#define FM4_HWWDT_WDG_LCK                         *((volatile uint32_t*)(0x40011C00UL))

/*******************************************************************************
* I2S Registers I2S0
*   Register Definition
*******************************************************************************/
#define FM_I2S0_RXFDAT                            *((volatile uint32_t*)(0x4006C000UL))
#define FM4_I2S0_RXFDAT                           *((volatile uint32_t*)(0x4006C000UL))
#define FM_I2S0_TXFDAT                            *((volatile uint32_t*)(0x4006C004UL))
#define FM4_I2S0_TXFDAT                           *((volatile uint32_t*)(0x4006C004UL))
#define FM_I2S0_CNTREG                            *((volatile uint32_t*)(0x4006C008UL))
#define FM4_I2S0_CNTREG                           *((volatile uint32_t*)(0x4006C008UL))
#define FM_I2S0_MCR0REG                           *((volatile uint32_t*)(0x4006C00CUL))
#define FM4_I2S0_MCR0REG                          *((volatile uint32_t*)(0x4006C00CUL))
#define FM_I2S0_MCR1REG                           *((volatile uint32_t*)(0x4006C010UL))
#define FM4_I2S0_MCR1REG                          *((volatile uint32_t*)(0x4006C010UL))
#define FM_I2S0_MCR2REG                           *((volatile uint32_t*)(0x4006C014UL))
#define FM4_I2S0_MCR2REG                          *((volatile uint32_t*)(0x4006C014UL))
#define FM_I2S0_OPRREG                            *((volatile uint32_t*)(0x4006C018UL))
#define FM4_I2S0_OPRREG                           *((volatile uint32_t*)(0x4006C018UL))
#define FM_I2S0_SRST                              *((volatile uint32_t*)(0x4006C01CUL))
#define FM4_I2S0_SRST                             *((volatile uint32_t*)(0x4006C01CUL))
#define FM_I2S0_INTCNT                            *((volatile uint32_t*)(0x4006C020UL))
#define FM4_I2S0_INTCNT                           *((volatile uint32_t*)(0x4006C020UL))
#define FM_I2S0_STATUS                            *((volatile uint32_t*)(0x4006C024UL))
#define FM4_I2S0_STATUS                           *((volatile uint32_t*)(0x4006C024UL))
#define FM_I2S0_DMAACT                            *((volatile uint32_t*)(0x4006C028UL))
#define FM4_I2S0_DMAACT                           *((volatile uint32_t*)(0x4006C028UL))
#define FM_I2S0_TSTREG                            *((volatile uint32_t*)(0x4006C02CUL))
#define FM4_I2S0_TSTREG                           *((volatile uint32_t*)(0x4006C02CUL))

/*******************************************************************************
* I2SPRE Registers I2SPRE
*   Register Definition
*******************************************************************************/
#define FM_I2SPRE_ICCR                            *((volatile uint32_t*)(0x4003D000UL))
#define FM4_I2SPRE_ICCR                           *((volatile uint32_t*)(0x4003D000UL))
#define FM_I2SPRE_IPCR1                           *((volatile uint32_t*)(0x4003D004UL))
#define FM4_I2SPRE_IPCR1                          *((volatile uint32_t*)(0x4003D004UL))
#define FM_I2SPRE_IPCR2                           *((volatile uint32_t*)(0x4003D008UL))
#define FM4_I2SPRE_IPCR2                          *((volatile uint32_t*)(0x4003D008UL))
#define FM_I2SPRE_IPCR3                           *((volatile uint32_t*)(0x4003D00CUL))
#define FM4_I2SPRE_IPCR3                          *((volatile uint32_t*)(0x4003D00CUL))
#define FM_I2SPRE_IPCR4                           *((volatile uint32_t*)(0x4003D010UL))
#define FM4_I2SPRE_IPCR4                          *((volatile uint32_t*)(0x4003D010UL))
#define FM_I2SPRE_IP_STR                          *((volatile uint32_t*)(0x4003D014UL))
#define FM4_I2SPRE_IP_STR                         *((volatile uint32_t*)(0x4003D014UL))
#define FM_I2SPRE_IPINT_ENR                       *((volatile uint32_t*)(0x4003D018UL))
#define FM4_I2SPRE_IPINT_ENR                      *((volatile uint32_t*)(0x4003D018UL))
#define FM_I2SPRE_IPINT_CLR                       *((volatile uint32_t*)(0x4003D01CUL))
#define FM4_I2SPRE_IPINT_CLR                      *((volatile uint32_t*)(0x4003D01CUL))
#define FM_I2SPRE_IPINT_STR                       *((volatile uint32_t*)(0x4003D020UL))
#define FM4_I2SPRE_IPINT_STR                      *((volatile uint32_t*)(0x4003D020UL))
#define FM_I2SPRE_IPCR5                           *((volatile uint32_t*)(0x4003D024UL))
#define FM4_I2SPRE_IPCR5                          *((volatile uint32_t*)(0x4003D024UL))

/*******************************************************************************
* INTREQ Registers INTREQ
*   Register Definition
*******************************************************************************/
#define FM_INTREQ_DRQSEL                          *((volatile uint32_t*)(0x40031000UL))
#define FM4_INTREQ_DRQSEL                         *((volatile uint32_t*)(0x40031000UL))
#define FM_INTREQ_ODDPKS                          *((volatile  uint8_t*)(0x40031010UL))
#define FM4_INTREQ_ODDPKS                         *((volatile  uint8_t*)(0x40031010UL))
#define FM_INTREQ_ODDPKS1                         *((volatile  uint8_t*)(0x40031014UL))
#define FM4_INTREQ_ODDPKS1                        *((volatile  uint8_t*)(0x40031014UL))
#define FM_INTREQ_IRQ003SEL                       *((volatile uint32_t*)(0x40031110UL))
#define FM4_INTREQ_IRQ003SEL                      *((volatile uint32_t*)(0x40031110UL))
#define FM_INTREQ_IRQ004SEL                       *((volatile uint32_t*)(0x40031114UL))
#define FM4_INTREQ_IRQ004SEL                      *((volatile uint32_t*)(0x40031114UL))
#define FM_INTREQ_IRQ005SEL                       *((volatile uint32_t*)(0x40031118UL))
#define FM4_INTREQ_IRQ005SEL                      *((volatile uint32_t*)(0x40031118UL))
#define FM_INTREQ_IRQ006SEL                       *((volatile uint32_t*)(0x4003111CUL))
#define FM4_INTREQ_IRQ006SEL                      *((volatile uint32_t*)(0x4003111CUL))
#define FM_INTREQ_IRQ007SEL                       *((volatile uint32_t*)(0x40031120UL))
#define FM4_INTREQ_IRQ007SEL                      *((volatile uint32_t*)(0x40031120UL))
#define FM_INTREQ_IRQ008SEL                       *((volatile uint32_t*)(0x40031124UL))
#define FM4_INTREQ_IRQ008SEL                      *((volatile uint32_t*)(0x40031124UL))
#define FM_INTREQ_IRQ009SEL                       *((volatile uint32_t*)(0x40031128UL))
#define FM4_INTREQ_IRQ009SEL                      *((volatile uint32_t*)(0x40031128UL))
#define FM_INTREQ_IRQ010SEL                       *((volatile uint32_t*)(0x4003112CUL))
#define FM4_INTREQ_IRQ010SEL                      *((volatile uint32_t*)(0x4003112CUL))
#define FM_INTREQ_EXC02MON                        *((volatile uint32_t*)(0x40031200UL))
#define FM4_INTREQ_EXC02MON                       *((volatile uint32_t*)(0x40031200UL))
#define FM_INTREQ_IRQ000MON                       *((volatile uint32_t*)(0x40031204UL))
#define FM4_INTREQ_IRQ000MON                      *((volatile uint32_t*)(0x40031204UL))
#define FM_INTREQ_IRQ001MON                       *((volatile uint32_t*)(0x40031208UL))
#define FM4_INTREQ_IRQ001MON                      *((volatile uint32_t*)(0x40031208UL))
#define FM_INTREQ_IRQ002MON                       *((volatile uint32_t*)(0x4003120CUL))
#define FM4_INTREQ_IRQ002MON                      *((volatile uint32_t*)(0x4003120CUL))
#define FM_INTREQ_IRQ003MON                       *((volatile uint32_t*)(0x40031210UL))
#define FM4_INTREQ_IRQ003MON                      *((volatile uint32_t*)(0x40031210UL))
#define FM_INTREQ_IRQ004MON                       *((volatile uint32_t*)(0x40031214UL))
#define FM4_INTREQ_IRQ004MON                      *((volatile uint32_t*)(0x40031214UL))
#define FM_INTREQ_IRQ005MON                       *((volatile uint32_t*)(0x40031218UL))
#define FM4_INTREQ_IRQ005MON                      *((volatile uint32_t*)(0x40031218UL))
#define FM_INTREQ_IRQ006MON                       *((volatile uint32_t*)(0x4003121CUL))
#define FM4_INTREQ_IRQ006MON                      *((volatile uint32_t*)(0x4003121CUL))
#define FM_INTREQ_IRQ007MON                       *((volatile uint32_t*)(0x40031220UL))
#define FM4_INTREQ_IRQ007MON                      *((volatile uint32_t*)(0x40031220UL))
#define FM_INTREQ_IRQ008MON                       *((volatile uint32_t*)(0x40031224UL))
#define FM4_INTREQ_IRQ008MON                      *((volatile uint32_t*)(0x40031224UL))
#define FM_INTREQ_IRQ009MON                       *((volatile uint32_t*)(0x40031228UL))
#define FM4_INTREQ_IRQ009MON                      *((volatile uint32_t*)(0x40031228UL))
#define FM_INTREQ_IRQ010MON                       *((volatile uint32_t*)(0x4003122CUL))
#define FM4_INTREQ_IRQ010MON                      *((volatile uint32_t*)(0x4003122CUL))
#define FM_INTREQ_IRQ011MON                       *((volatile uint32_t*)(0x40031230UL))
#define FM4_INTREQ_IRQ011MON                      *((volatile uint32_t*)(0x40031230UL))
#define FM_INTREQ_IRQ012MON                       *((volatile uint32_t*)(0x40031234UL))
#define FM4_INTREQ_IRQ012MON                      *((volatile uint32_t*)(0x40031234UL))
#define FM_INTREQ_IRQ013MON                       *((volatile uint32_t*)(0x40031238UL))
#define FM4_INTREQ_IRQ013MON                      *((volatile uint32_t*)(0x40031238UL))
#define FM_INTREQ_IRQ014MON                       *((volatile uint32_t*)(0x4003123CUL))
#define FM4_INTREQ_IRQ014MON                      *((volatile uint32_t*)(0x4003123CUL))
#define FM_INTREQ_IRQ015MON                       *((volatile uint32_t*)(0x40031240UL))
#define FM4_INTREQ_IRQ015MON                      *((volatile uint32_t*)(0x40031240UL))
#define FM_INTREQ_IRQ016MON                       *((volatile uint32_t*)(0x40031244UL))
#define FM4_INTREQ_IRQ016MON                      *((volatile uint32_t*)(0x40031244UL))
#define FM_INTREQ_IRQ017MON                       *((volatile uint32_t*)(0x40031248UL))
#define FM4_INTREQ_IRQ017MON                      *((volatile uint32_t*)(0x40031248UL))
#define FM_INTREQ_IRQ018MON                       *((volatile uint32_t*)(0x4003124CUL))
#define FM4_INTREQ_IRQ018MON                      *((volatile uint32_t*)(0x4003124CUL))
#define FM_INTREQ_IRQ019MON                       *((volatile uint32_t*)(0x40031250UL))
#define FM4_INTREQ_IRQ019MON                      *((volatile uint32_t*)(0x40031250UL))
#define FM_INTREQ_IRQ020MON                       *((volatile uint32_t*)(0x40031254UL))
#define FM4_INTREQ_IRQ020MON                      *((volatile uint32_t*)(0x40031254UL))
#define FM_INTREQ_IRQ021MON                       *((volatile uint32_t*)(0x40031258UL))
#define FM4_INTREQ_IRQ021MON                      *((volatile uint32_t*)(0x40031258UL))
#define FM_INTREQ_IRQ022MON                       *((volatile uint32_t*)(0x4003125CUL))
#define FM4_INTREQ_IRQ022MON                      *((volatile uint32_t*)(0x4003125CUL))
#define FM_INTREQ_IRQ023MON                       *((volatile uint32_t*)(0x40031260UL))
#define FM4_INTREQ_IRQ023MON                      *((volatile uint32_t*)(0x40031260UL))
#define FM_INTREQ_IRQ024MON                       *((volatile uint32_t*)(0x40031264UL))
#define FM4_INTREQ_IRQ024MON                      *((volatile uint32_t*)(0x40031264UL))
#define FM_INTREQ_IRQ025MON                       *((volatile uint32_t*)(0x40031268UL))
#define FM4_INTREQ_IRQ025MON                      *((volatile uint32_t*)(0x40031268UL))
#define FM_INTREQ_IRQ026MON                       *((volatile uint32_t*)(0x4003126CUL))
#define FM4_INTREQ_IRQ026MON                      *((volatile uint32_t*)(0x4003126CUL))
#define FM_INTREQ_IRQ027MON                       *((volatile uint32_t*)(0x40031270UL))
#define FM4_INTREQ_IRQ027MON                      *((volatile uint32_t*)(0x40031270UL))
#define FM_INTREQ_IRQ028MON                       *((volatile uint32_t*)(0x40031274UL))
#define FM4_INTREQ_IRQ028MON                      *((volatile uint32_t*)(0x40031274UL))
#define FM_INTREQ_IRQ029MON                       *((volatile uint32_t*)(0x40031278UL))
#define FM4_INTREQ_IRQ029MON                      *((volatile uint32_t*)(0x40031278UL))
#define FM_INTREQ_IRQ030MON                       *((volatile uint32_t*)(0x4003127CUL))
#define FM4_INTREQ_IRQ030MON                      *((volatile uint32_t*)(0x4003127CUL))
#define FM_INTREQ_IRQ031MON                       *((volatile uint32_t*)(0x40031280UL))
#define FM4_INTREQ_IRQ031MON                      *((volatile uint32_t*)(0x40031280UL))
#define FM_INTREQ_IRQ032MON                       *((volatile uint32_t*)(0x40031284UL))
#define FM4_INTREQ_IRQ032MON                      *((volatile uint32_t*)(0x40031284UL))
#define FM_INTREQ_IRQ033MON                       *((volatile uint32_t*)(0x40031288UL))
#define FM4_INTREQ_IRQ033MON                      *((volatile uint32_t*)(0x40031288UL))
#define FM_INTREQ_IRQ034MON                       *((volatile uint32_t*)(0x4003128CUL))
#define FM4_INTREQ_IRQ034MON                      *((volatile uint32_t*)(0x4003128CUL))
#define FM_INTREQ_IRQ035MON                       *((volatile uint32_t*)(0x40031290UL))
#define FM4_INTREQ_IRQ035MON                      *((volatile uint32_t*)(0x40031290UL))
#define FM_INTREQ_IRQ036MON                       *((volatile uint32_t*)(0x40031294UL))
#define FM4_INTREQ_IRQ036MON                      *((volatile uint32_t*)(0x40031294UL))
#define FM_INTREQ_IRQ037MON                       *((volatile uint32_t*)(0x40031298UL))
#define FM4_INTREQ_IRQ037MON                      *((volatile uint32_t*)(0x40031298UL))
#define FM_INTREQ_IRQ038MON                       *((volatile uint32_t*)(0x4003129CUL))
#define FM4_INTREQ_IRQ038MON                      *((volatile uint32_t*)(0x4003129CUL))
#define FM_INTREQ_IRQ039MON                       *((volatile uint32_t*)(0x400312A0UL))
#define FM4_INTREQ_IRQ039MON                      *((volatile uint32_t*)(0x400312A0UL))
#define FM_INTREQ_IRQ040MON                       *((volatile uint32_t*)(0x400312A4UL))
#define FM4_INTREQ_IRQ040MON                      *((volatile uint32_t*)(0x400312A4UL))
#define FM_INTREQ_IRQ041MON                       *((volatile uint32_t*)(0x400312A8UL))
#define FM4_INTREQ_IRQ041MON                      *((volatile uint32_t*)(0x400312A8UL))
#define FM_INTREQ_IRQ042MON                       *((volatile uint32_t*)(0x400312ACUL))
#define FM4_INTREQ_IRQ042MON                      *((volatile uint32_t*)(0x400312ACUL))
#define FM_INTREQ_IRQ043MON                       *((volatile uint32_t*)(0x400312B0UL))
#define FM4_INTREQ_IRQ043MON                      *((volatile uint32_t*)(0x400312B0UL))
#define FM_INTREQ_IRQ044MON                       *((volatile uint32_t*)(0x400312B4UL))
#define FM4_INTREQ_IRQ044MON                      *((volatile uint32_t*)(0x400312B4UL))
#define FM_INTREQ_IRQ045MON                       *((volatile uint32_t*)(0x400312B8UL))
#define FM4_INTREQ_IRQ045MON                      *((volatile uint32_t*)(0x400312B8UL))
#define FM_INTREQ_IRQ046MON                       *((volatile uint32_t*)(0x400312BCUL))
#define FM4_INTREQ_IRQ046MON                      *((volatile uint32_t*)(0x400312BCUL))
#define FM_INTREQ_IRQ047MON                       *((volatile uint32_t*)(0x400312C0UL))
#define FM4_INTREQ_IRQ047MON                      *((volatile uint32_t*)(0x400312C0UL))
#define FM_INTREQ_IRQ048MON                       *((volatile uint32_t*)(0x400312C4UL))
#define FM4_INTREQ_IRQ048MON                      *((volatile uint32_t*)(0x400312C4UL))
#define FM_INTREQ_IRQ049MON                       *((volatile uint32_t*)(0x400312C8UL))
#define FM4_INTREQ_IRQ049MON                      *((volatile uint32_t*)(0x400312C8UL))
#define FM_INTREQ_IRQ050MON                       *((volatile uint32_t*)(0x400312CCUL))
#define FM4_INTREQ_IRQ050MON                      *((volatile uint32_t*)(0x400312CCUL))
#define FM_INTREQ_IRQ051MON                       *((volatile uint32_t*)(0x400312D0UL))
#define FM4_INTREQ_IRQ051MON                      *((volatile uint32_t*)(0x400312D0UL))
#define FM_INTREQ_IRQ052MON                       *((volatile uint32_t*)(0x400312D4UL))
#define FM4_INTREQ_IRQ052MON                      *((volatile uint32_t*)(0x400312D4UL))
#define FM_INTREQ_IRQ053MON                       *((volatile uint32_t*)(0x400312D8UL))
#define FM4_INTREQ_IRQ053MON                      *((volatile uint32_t*)(0x400312D8UL))
#define FM_INTREQ_IRQ054MON                       *((volatile uint32_t*)(0x400312DCUL))
#define FM4_INTREQ_IRQ054MON                      *((volatile uint32_t*)(0x400312DCUL))
#define FM_INTREQ_IRQ055MON                       *((volatile uint32_t*)(0x400312E0UL))
#define FM4_INTREQ_IRQ055MON                      *((volatile uint32_t*)(0x400312E0UL))
#define FM_INTREQ_IRQ056MON                       *((volatile uint32_t*)(0x400312E4UL))
#define FM4_INTREQ_IRQ056MON                      *((volatile uint32_t*)(0x400312E4UL))
#define FM_INTREQ_IRQ057MON                       *((volatile uint32_t*)(0x400312E8UL))
#define FM4_INTREQ_IRQ057MON                      *((volatile uint32_t*)(0x400312E8UL))
#define FM_INTREQ_IRQ058MON                       *((volatile uint32_t*)(0x400312ECUL))
#define FM4_INTREQ_IRQ058MON                      *((volatile uint32_t*)(0x400312ECUL))
#define FM_INTREQ_IRQ059MON                       *((volatile uint32_t*)(0x400312F0UL))
#define FM4_INTREQ_IRQ059MON                      *((volatile uint32_t*)(0x400312F0UL))
#define FM_INTREQ_IRQ060MON                       *((volatile uint32_t*)(0x400312F4UL))
#define FM4_INTREQ_IRQ060MON                      *((volatile uint32_t*)(0x400312F4UL))
#define FM_INTREQ_IRQ061MON                       *((volatile uint32_t*)(0x400312F8UL))
#define FM4_INTREQ_IRQ061MON                      *((volatile uint32_t*)(0x400312F8UL))
#define FM_INTREQ_IRQ062MON                       *((volatile uint32_t*)(0x400312FCUL))
#define FM4_INTREQ_IRQ062MON                      *((volatile uint32_t*)(0x400312FCUL))
#define FM_INTREQ_IRQ063MON                       *((volatile uint32_t*)(0x40031300UL))
#define FM4_INTREQ_IRQ063MON                      *((volatile uint32_t*)(0x40031300UL))
#define FM_INTREQ_IRQ064MON                       *((volatile uint32_t*)(0x40031304UL))
#define FM4_INTREQ_IRQ064MON                      *((volatile uint32_t*)(0x40031304UL))
#define FM_INTREQ_IRQ065MON                       *((volatile uint32_t*)(0x40031308UL))
#define FM4_INTREQ_IRQ065MON                      *((volatile uint32_t*)(0x40031308UL))
#define FM_INTREQ_IRQ066MON                       *((volatile uint32_t*)(0x4003130CUL))
#define FM4_INTREQ_IRQ066MON                      *((volatile uint32_t*)(0x4003130CUL))
#define FM_INTREQ_IRQ067MON                       *((volatile uint32_t*)(0x40031310UL))
#define FM4_INTREQ_IRQ067MON                      *((volatile uint32_t*)(0x40031310UL))
#define FM_INTREQ_IRQ068MON                       *((volatile uint32_t*)(0x40031314UL))
#define FM4_INTREQ_IRQ068MON                      *((volatile uint32_t*)(0x40031314UL))
#define FM_INTREQ_IRQ069MON                       *((volatile uint32_t*)(0x40031318UL))
#define FM4_INTREQ_IRQ069MON                      *((volatile uint32_t*)(0x40031318UL))
#define FM_INTREQ_IRQ070MON                       *((volatile uint32_t*)(0x4003131CUL))
#define FM4_INTREQ_IRQ070MON                      *((volatile uint32_t*)(0x4003131CUL))
#define FM_INTREQ_IRQ071MON                       *((volatile uint32_t*)(0x40031320UL))
#define FM4_INTREQ_IRQ071MON                      *((volatile uint32_t*)(0x40031320UL))
#define FM_INTREQ_IRQ072MON                       *((volatile uint32_t*)(0x40031324UL))
#define FM4_INTREQ_IRQ072MON                      *((volatile uint32_t*)(0x40031324UL))
#define FM_INTREQ_IRQ073MON                       *((volatile uint32_t*)(0x40031328UL))
#define FM4_INTREQ_IRQ073MON                      *((volatile uint32_t*)(0x40031328UL))
#define FM_INTREQ_IRQ074MON                       *((volatile uint32_t*)(0x4003132CUL))
#define FM4_INTREQ_IRQ074MON                      *((volatile uint32_t*)(0x4003132CUL))
#define FM_INTREQ_IRQ075MON                       *((volatile uint32_t*)(0x40031330UL))
#define FM4_INTREQ_IRQ075MON                      *((volatile uint32_t*)(0x40031330UL))
#define FM_INTREQ_IRQ076MON                       *((volatile uint32_t*)(0x40031334UL))
#define FM4_INTREQ_IRQ076MON                      *((volatile uint32_t*)(0x40031334UL))
#define FM_INTREQ_IRQ077MON                       *((volatile uint32_t*)(0x40031338UL))
#define FM4_INTREQ_IRQ077MON                      *((volatile uint32_t*)(0x40031338UL))
#define FM_INTREQ_IRQ078MON                       *((volatile uint32_t*)(0x4003133CUL))
#define FM4_INTREQ_IRQ078MON                      *((volatile uint32_t*)(0x4003133CUL))
#define FM_INTREQ_IRQ079MON                       *((volatile uint32_t*)(0x40031340UL))
#define FM4_INTREQ_IRQ079MON                      *((volatile uint32_t*)(0x40031340UL))
#define FM_INTREQ_IRQ080MON                       *((volatile uint32_t*)(0x40031344UL))
#define FM4_INTREQ_IRQ080MON                      *((volatile uint32_t*)(0x40031344UL))
#define FM_INTREQ_IRQ081MON                       *((volatile uint32_t*)(0x40031348UL))
#define FM4_INTREQ_IRQ081MON                      *((volatile uint32_t*)(0x40031348UL))
#define FM_INTREQ_IRQ082MON                       *((volatile uint32_t*)(0x4003134CUL))
#define FM4_INTREQ_IRQ082MON                      *((volatile uint32_t*)(0x4003134CUL))
#define FM_INTREQ_IRQ083MON                       *((volatile uint32_t*)(0x40031350UL))
#define FM4_INTREQ_IRQ083MON                      *((volatile uint32_t*)(0x40031350UL))
#define FM_INTREQ_IRQ084MON                       *((volatile uint32_t*)(0x40031354UL))
#define FM4_INTREQ_IRQ084MON                      *((volatile uint32_t*)(0x40031354UL))
#define FM_INTREQ_IRQ085MON                       *((volatile uint32_t*)(0x40031358UL))
#define FM4_INTREQ_IRQ085MON                      *((volatile uint32_t*)(0x40031358UL))
#define FM_INTREQ_IRQ086MON                       *((volatile uint32_t*)(0x4003135CUL))
#define FM4_INTREQ_IRQ086MON                      *((volatile uint32_t*)(0x4003135CUL))
#define FM_INTREQ_IRQ087MON                       *((volatile uint32_t*)(0x40031360UL))
#define FM4_INTREQ_IRQ087MON                      *((volatile uint32_t*)(0x40031360UL))
#define FM_INTREQ_IRQ088MON                       *((volatile uint32_t*)(0x40031364UL))
#define FM4_INTREQ_IRQ088MON                      *((volatile uint32_t*)(0x40031364UL))
#define FM_INTREQ_IRQ089MON                       *((volatile uint32_t*)(0x40031368UL))
