sol4ik/audio-steganography/try/fm4/s6e2ccxh/common/s6e2ccxh.h
/*******************************************************************************
* QPRC_NF Registers QPRC1_NF
*   Register Definition
*******************************************************************************/
#define FM_QPRC1_NF_NFCTLA                        *((volatile  uint8_t*)(0x40026110UL))
#define FM4_QPRC1_NF_NFCTLA                       *((volatile  uint8_t*)(0x40026110UL))
#define FM_QPRC1_NF_NFCTLB                        *((volatile  uint8_t*)(0x40026114UL))
#define FM4_QPRC1_NF_NFCTLB                       *((volatile  uint8_t*)(0x40026114UL))
#define FM_QPRC1_NF_NFCTLZ                        *((volatile  uint8_t*)(0x40026118UL))
#define FM4_QPRC1_NF_NFCTLZ                       *((volatile  uint8_t*)(0x40026118UL))

/*******************************************************************************
* QPRC Registers QPRC2
*   Register Definition
*******************************************************************************/
#define FM_QPRC2_QPCR                             *((volatile uint16_t*)(0x40026080UL))
#define FM4_QPRC2_QPCR                            *((volatile uint16_t*)(0x40026080UL))
#define FM_QPRC2_QRCR                             *((volatile uint16_t*)(0x40026084UL))
#define FM4_QPRC2_QRCR                            *((volatile uint16_t*)(0x40026084UL))
#define FM_QPRC2_QPCCR                            *((volatile uint16_t*)(0x40026088UL))
#define FM4_QPRC2_QPCCR                           *((volatile uint16_t*)(0x40026088UL))
#define FM_QPRC2_QPRCR                            *((volatile uint16_t*)(0x4002608CUL))
#define FM4_QPRC2_QPRCR                           *((volatile uint16_t*)(0x4002608CUL))
#define FM_QPRC2_QMPR                             *((volatile uint16_t*)(0x40026090UL))
#define FM4_QPRC2_QMPR                            *((volatile uint16_t*)(0x40026090UL))
#define FM_QPRC2_QICRL                            *((volatile  uint8_t*)(0x40026094UL))
#define FM4_QPRC2_QICRL                           *((volatile  uint8_t*)(0x40026094UL))
#define FM_QPRC2_QICRH                            *((volatile  uint8_t*)(0x40026095UL))
#define FM4_QPRC2_QICRH                           *((volatile  uint8_t*)(0x40026095UL))
#define FM_QPRC2_QCR                              *((volatile uint16_t*)(0x40026098UL))
#define FM4_QPRC2_QCR                             *((volatile uint16_t*)(0x40026098UL))
#define FM_QPRC2_QECR                             *((volatile uint16_t*)(0x4002609CUL))
#define FM4_QPRC2_QECR                            *((volatile uint16_t*)(0x4002609CUL))
#define FM_QPRC2_QPRCRR                           *((volatile uint32_t*)(0x400260BCUL))
#define FM4_QPRC2_QPRCRR                          *((volatile uint32_t*)(0x400260BCUL))

/*******************************************************************************
* QPRC_NF Registers QPRC2_NF
*   Register Definition
*******************************************************************************/
#define FM_QPRC2_NF_NFCTLA                        *((volatile  uint8_t*)(0x40026120UL))
#define FM4_QPRC2_NF_NFCTLA                       *((volatile  uint8_t*)(0x40026120UL))
#define FM_QPRC2_NF_NFCTLB                        *((volatile  uint8_t*)(0x40026124UL))
#define FM4_QPRC2_NF_NFCTLB                       *((volatile  uint8_t*)(0x40026124UL))
#define FM_QPRC2_NF_NFCTLZ                        *((volatile  uint8_t*)(0x40026128UL))
#define FM4_QPRC2_NF_NFCTLZ                       *((volatile  uint8_t*)(0x40026128UL))

/*******************************************************************************
* QPRC Registers QPRC3
*   Register Definition
*******************************************************************************/
#define FM_QPRC3_QPCR                             *((volatile uint16_t*)(0x400260C0UL))
#define FM4_QPRC3_QPCR                            *((volatile uint16_t*)(0x400260C0UL))
#define FM_QPRC3_QRCR                             *((volatile uint16_t*)(0x400260C4UL))
#define FM4_QPRC3_QRCR                            *((volatile uint16_t*)(0x400260C4UL))
#define FM_QPRC3_QPCCR                            *((volatile uint16_t*)(0x400260C8UL))
#define FM4_QPRC3_QPCCR                           *((volatile uint16_t*)(0x400260C8UL))
#define FM_QPRC3_QPRCR                            *((volatile uint16_t*)(0x400260CCUL))
#define FM4_QPRC3_QPRCR                           *((volatile uint16_t*)(0x400260CCUL))
#define FM_QPRC3_QMPR                             *((volatile uint16_t*)(0x400260D0UL))
#define FM4_QPRC3_QMPR                            *((volatile uint16_t*)(0x400260D0UL))
#define FM_QPRC3_QICRL                            *((volatile  uint8_t*)(0x400260D4UL))
#define FM4_QPRC3_QICRL                           *((volatile  uint8_t*)(0x400260D4UL))
#define FM_QPRC3_QICRH                            *((volatile  uint8_t*)(0x400260D5UL))
#define FM4_QPRC3_QICRH                           *((volatile  uint8_t*)(0x400260D5UL))
#define FM_QPRC3_QCR                              *((volatile uint16_t*)(0x400260D8UL))
#define FM4_QPRC3_QCR                             *((volatile uint16_t*)(0x400260D8UL))
#define FM_QPRC3_QECR                             *((volatile uint16_t*)(0x400260DCUL))
#define FM4_QPRC3_QECR                            *((volatile uint16_t*)(0x400260DCUL))
#define FM_QPRC3_QPRCRR                           *((volatile uint32_t*)(0x400260FCUL))
#define FM4_QPRC3_QPRCRR                          *((volatile uint32_t*)(0x400260FCUL))

/*******************************************************************************
* QPRC_NF Registers QPRC3_NF
*   Register Definition
*******************************************************************************/
#define FM_QPRC3_NF_NFCTLA                        *((volatile  uint8_t*)(0x40026130UL))
#define FM4_QPRC3_NF_NFCTLA                       *((volatile  uint8_t*)(0x40026130UL))
#define FM_QPRC3_NF_NFCTLB                        *((volatile  uint8_t*)(0x40026134UL))
#define FM4_QPRC3_NF_NFCTLB                       *((volatile  uint8_t*)(0x40026134UL))
#define FM_QPRC3_NF_NFCTLZ                        *((volatile  uint8_t*)(0x40026138UL))
#define FM4_QPRC3_NF_NFCTLZ                       *((volatile  uint8_t*)(0x40026138UL))

