sol4ik/audio-steganography/try/fm4/s6e2ccxh/common/s6e2ccxh.h
#define FM_CRG_SCM_CTL_AVAILABLE                  1
#define FM4_CRG_SCM_STR_AVAILABLE                 1
#define FM_CRG_SCM_STR_AVAILABLE                  1
#define FM4_CRG_STB_CTL_AVAILABLE                 1
#define FM_CRG_STB_CTL_AVAILABLE                  1
#define FM4_CRG_SWC_PSR_AVAILABLE                 1
#define FM_CRG_SWC_PSR_AVAILABLE                  1
#define FM4_CRG_TTC_PSR_AVAILABLE                 1
#define FM_CRG_TTC_PSR_AVAILABLE                  1
/*******************************************************************************
* CRTRIM
*******************************************************************************/
#define FM4_CRTRIM_MCR_FTRM_AVAILABLE             1
#define FM_CRTRIM_MCR_FTRM_AVAILABLE              1
#define FM4_CRTRIM_MCR_PSR_AVAILABLE              1
#define FM_CRTRIM_MCR_PSR_AVAILABLE               1
#define FM4_CRTRIM_MCR_RLR_AVAILABLE              1
#define FM_CRTRIM_MCR_RLR_AVAILABLE               1
#define FM4_CRTRIM_MCR_TTRM_AVAILABLE             1
#define FM_CRTRIM_MCR_TTRM_AVAILABLE              1
/*******************************************************************************
* DAC0
*******************************************************************************/
#define FM4_DAC_DACR_AVAILABLE                    1
#define FM_DAC_DACR_AVAILABLE                     1
#define FM4_DAC_DADR_AVAILABLE                    1
#define FM_DAC_DADR_AVAILABLE                     1
/*******************************************************************************
* DMAC
*******************************************************************************/
#define FM4_DMAC_DMACA0_AVAILABLE                 1
#define FM_DMAC_DMACA0_AVAILABLE                  1
#define FM4_DMAC_DMACA1_AVAILABLE                 1
#define FM_DMAC_DMACA1_AVAILABLE                  1
#define FM4_DMAC_DMACA2_AVAILABLE                 1
#define FM_DMAC_DMACA2_AVAILABLE                  1
#define FM4_DMAC_DMACA3_AVAILABLE                 1
#define FM_DMAC_DMACA3_AVAILABLE                  1
#define FM4_DMAC_DMACA4_AVAILABLE                 1
#define FM_DMAC_DMACA4_AVAILABLE                  1
#define FM4_DMAC_DMACA5_AVAILABLE                 1
#define FM_DMAC_DMACA5_AVAILABLE                  1
#define FM4_DMAC_DMACA6_AVAILABLE                 1
#define FM_DMAC_DMACA6_AVAILABLE                  1
#define FM4_DMAC_DMACA7_AVAILABLE                 1
#define FM_DMAC_DMACA7_AVAILABLE                  1
#define FM4_DMAC_DMACB0_AVAILABLE                 1
#define FM_DMAC_DMACB0_AVAILABLE                  1
#define FM4_DMAC_DMACB1_AVAILABLE                 1
#define FM_DMAC_DMACB1_AVAILABLE                  1
#define FM4_DMAC_DMACB2_AVAILABLE                 1
#define FM_DMAC_DMACB2_AVAILABLE                  1
#define FM4_DMAC_DMACB3_AVAILABLE                 1
#define FM_DMAC_DMACB3_AVAILABLE                  1
#define FM4_DMAC_DMACB4_AVAILABLE                 1
#define FM_DMAC_DMACB4_AVAILABLE                  1
#define FM4_DMAC_DMACB5_AVAILABLE                 1
#define FM_DMAC_DMACB5_AVAILABLE                  1
#define FM4_DMAC_DMACB6_AVAILABLE                 1
#define FM_DMAC_DMACB6_AVAILABLE                  1
#define FM4_DMAC_DMACB7_AVAILABLE                 1
#define FM_DMAC_DMACB7_AVAILABLE                  1
#define FM4_DMAC_DMACDA0_AVAILABLE                1
#define FM_DMAC_DMACDA0_AVAILABLE                 1
#define FM4_DMAC_DMACDA1_AVAILABLE                1
#define FM_DMAC_DMACDA1_AVAILABLE                 1
#define FM4_DMAC_DMACDA2_AVAILABLE                1
#define FM_DMAC_DMACDA2_AVAILABLE                 1
#define FM4_DMAC_DMACDA3_AVAILABLE                1
#define FM_DMAC_DMACDA3_AVAILABLE                 1
#define FM4_DMAC_DMACDA4_AVAILABLE                1
#define FM_DMAC_DMACDA4_AVAILABLE                 1
#define FM4_DMAC_DMACDA5_AVAILABLE                1
#define FM_DMAC_DMACDA5_AVAILABLE                 1
#define FM4_DMAC_DMACDA6_AVAILABLE                1
#define FM_DMAC_DMACDA6_AVAILABLE                 1
#define FM4_DMAC_DMACDA7_AVAILABLE                1
#define FM_DMAC_DMACDA7_AVAILABLE                 1
#define FM4_DMAC_DMACR_AVAILABLE                  1
#define FM_DMAC_DMACR_AVAILABLE                   1
#define FM4_DMAC_DMACSA0_AVAILABLE                1
#define FM_DMAC_DMACSA0_AVAILABLE                 1
#define FM4_DMAC_DMACSA1_AVAILABLE                1
#define FM_DMAC_DMACSA1_AVAILABLE                 1
#define FM4_DMAC_DMACSA2_AVAILABLE                1
#define FM_DMAC_DMACSA2_AVAILABLE                 1
#define FM4_DMAC_DMACSA3_AVAILABLE                1
#define FM_DMAC_DMACSA3_AVAILABLE                 1
#define FM4_DMAC_DMACSA4_AVAILABLE                1
#define FM_DMAC_DMACSA4_AVAILABLE                 1
#define FM4_DMAC_DMACSA5_AVAILABLE                1
#define FM_DMAC_DMACSA5_AVAILABLE                 1
#define FM4_DMAC_DMACSA6_AVAILABLE                1
#define FM_DMAC_DMACSA6_AVAILABLE                 1
#define FM4_DMAC_DMACSA7_AVAILABLE                1
#define FM_DMAC_DMACSA7_AVAILABLE                 1
/*******************************************************************************
* DS
*******************************************************************************/
#define FM4_DS_BUR01_AVAILABLE                    1
#define FM_DS_BUR01_AVAILABLE                     1
#define FM4_DS_BUR02_AVAILABLE                    1
#define FM_DS_BUR02_AVAILABLE                     1
#define FM4_DS_BUR03_AVAILABLE                    1
#define FM_DS_BUR03_AVAILABLE                     1
#define FM4_DS_BUR04_AVAILABLE                    1
#define FM_DS_BUR04_AVAILABLE                     1
#define FM4_DS_BUR05_AVAILABLE                    1
#define FM_DS_BUR05_AVAILABLE                     1
#define FM4_DS_BUR06_AVAILABLE                    1
#define FM_DS_BUR06_AVAILABLE                     1
#define FM4_DS_BUR07_AVAILABLE                    1
#define FM_DS_BUR07_AVAILABLE                     1
#define FM4_DS_BUR08_AVAILABLE                    1
#define FM_DS_BUR08_AVAILABLE                     1
#define FM4_DS_BUR09_AVAILABLE                    1
#define FM_DS_BUR09_AVAILABLE                     1
#define FM4_DS_BUR10_AVAILABLE                    1
#define FM_DS_BUR10_AVAILABLE                     1
#define FM4_DS_BUR11_AVAILABLE                    1
#define FM_DS_BUR11_AVAILABLE                     1
#define FM4_DS_BUR12_AVAILABLE                    1
#define FM_DS_BUR12_AVAILABLE                     1
#define FM4_DS_BUR13_AVAILABLE                    1
#define FM_DS_BUR13_AVAILABLE                     1
#define FM4_DS_BUR14_AVAILABLE                    1
#define FM_DS_BUR14_AVAILABLE                     1
#define FM4_DS_BUR15_AVAILABLE                    1
#define FM_DS_BUR15_AVAILABLE                     1
#define FM4_DS_BUR16_AVAILABLE                    1
#define FM_DS_BUR16_AVAILABLE                     1
#define FM4_DS_DSRAMR_AVAILABLE                   1
#define FM_DS_DSRAMR_AVAILABLE                    1
#define FM4_DS_PMD_CTL_AVAILABLE                  1
#define FM_DS_PMD_CTL_AVAILABLE                   1
#define FM4_DS_RCK_CTL_AVAILABLE                  1
#define FM_DS_RCK_CTL_AVAILABLE                   1
#define FM4_DS_WIER_AVAILABLE                     1
#define FM_DS_WIER_AVAILABLE                      1
#define FM4_DS_WIFSR_AVAILABLE                    1
#define FM_DS_WIFSR_AVAILABLE                     1
#define FM4_DS_WILVR_AVAILABLE                    1
#define FM_DS_WILVR_AVAILABLE                     1
#define FM4_DS_WRFSR_AVAILABLE                    1
#define FM_DS_WRFSR_AVAILABLE                     1
/*******************************************************************************
* DSTC
*******************************************************************************/
#define FM4_DSTC_CFG_AVAILABLE                    1
#define FM_DSTC_CFG_AVAILABLE                     1
#define FM4_DSTC_CMD_AVAILABLE                    1
#define FM_DSTC_CMD_AVAILABLE                     1
#define FM4_DSTC_DESTP_AVAILABLE                  1
#define FM_DSTC_DESTP_AVAILABLE                   1
#define FM4_DSTC_DQMSK0_AVAILABLE                 1
#define FM_DSTC_DQMSK0_AVAILABLE                  1
#define FM4_DSTC_DQMSK1_AVAILABLE                 1
#define FM_DSTC_DQMSK1_AVAILABLE                  1
#define FM4_DSTC_DQMSK2_AVAILABLE                 1
#define FM_DSTC_DQMSK2_AVAILABLE                  1
#define FM4_DSTC_DQMSK3_AVAILABLE                 1
#define FM_DSTC_DQMSK3_AVAILABLE                  1
#define FM4_DSTC_DQMSK4_AVAILABLE                 1
#define FM_DSTC_DQMSK4_AVAILABLE                  1
#define FM4_DSTC_DQMSK5_AVAILABLE                 1
#define FM_DSTC_DQMSK5_AVAILABLE                  1
#define FM4_DSTC_DQMSK6_AVAILABLE                 1
#define FM_DSTC_DQMSK6_AVAILABLE                  1
#define FM4_DSTC_DQMSK7_AVAILABLE                 1
#define FM_DSTC_DQMSK7_AVAILABLE                  1
#define FM4_DSTC_DQMSKCLR0_AVAILABLE              1
#define FM_DSTC_DQMSKCLR0_AVAILABLE               1
#define FM4_DSTC_DQMSKCLR1_AVAILABLE              1
#define FM_DSTC_DQMSKCLR1_AVAILABLE               1
#define FM4_DSTC_DQMSKCLR2_AVAILABLE              1
#define FM_DSTC_DQMSKCLR2_AVAILABLE               1
#define FM4_DSTC_DQMSKCLR3_AVAILABLE              1
#define FM_DSTC_DQMSKCLR3_AVAILABLE               1
#define FM4_DSTC_DQMSKCLR4_AVAILABLE              1
#define FM_DSTC_DQMSKCLR4_AVAILABLE               1
#define FM4_DSTC_DQMSKCLR5_AVAILABLE              1
#define FM_DSTC_DQMSKCLR5_AVAILABLE               1
#define FM4_DSTC_DQMSKCLR6_AVAILABLE              1
#define FM_DSTC_DQMSKCLR6_AVAILABLE               1
#define FM4_DSTC_DQMSKCLR7_AVAILABLE              1
#define FM_DSTC_DQMSKCLR7_AVAILABLE               1
#define FM4_DSTC_DREQENB0_AVAILABLE               1
#define FM_DSTC_DREQENB0_AVAILABLE                1
#define FM4_DSTC_DREQENB1_AVAILABLE               1
#define FM_DSTC_DREQENB1_AVAILABLE                1
#define FM4_DSTC_DREQENB2_AVAILABLE               1
#define FM_DSTC_DREQENB2_AVAILABLE                1
#define FM4_DSTC_DREQENB3_AVAILABLE               1
#define FM_DSTC_DREQENB3_AVAILABLE                1
#define FM4_DSTC_DREQENB4_AVAILABLE               1
#define FM_DSTC_DREQENB4_AVAILABLE                1
#define FM4_DSTC_DREQENB5_AVAILABLE               1
#define FM_DSTC_DREQENB5_AVAILABLE                1
#define FM4_DSTC_DREQENB6_AVAILABLE               1
#define FM_DSTC_DREQENB6_AVAILABLE                1
#define FM4_DSTC_DREQENB7_AVAILABLE               1
#define FM_DSTC_DREQENB7_AVAILABLE                1
#define FM4_DSTC_HWDESP_AVAILABLE                 1
#define FM_DSTC_HWDESP_AVAILABLE                  1
#define FM4_DSTC_HWINT0_AVAILABLE                 1
#define FM_DSTC_HWINT0_AVAILABLE                  1
#define FM4_DSTC_HWINT1_AVAILABLE                 1
#define FM_DSTC_HWINT1_AVAILABLE                  1
#define FM4_DSTC_HWINT2_AVAILABLE                 1
#define FM_DSTC_HWINT2_AVAILABLE                  1
#define FM4_DSTC_HWINT3_AVAILABLE                 1
#define FM_DSTC_HWINT3_AVAILABLE                  1
#define FM4_DSTC_HWINT4_AVAILABLE                 1
#define FM_DSTC_HWINT4_AVAILABLE                  1
#define FM4_DSTC_HWINT5_AVAILABLE                 1
#define FM_DSTC_HWINT5_AVAILABLE                  1
#define FM4_DSTC_HWINT6_AVAILABLE                 1
#define FM_DSTC_HWINT6_AVAILABLE                  1
#define FM4_DSTC_HWINT7_AVAILABLE                 1
#define FM_DSTC_HWINT7_AVAILABLE                  1
#define FM4_DSTC_HWINTCLR0_AVAILABLE              1
#define FM_DSTC_HWINTCLR0_AVAILABLE               1
#define FM4_DSTC_HWINTCLR1_AVAILABLE              1
#define FM_DSTC_HWINTCLR1_AVAILABLE               1
#define FM4_DSTC_HWINTCLR2_AVAILABLE              1
#define FM_DSTC_HWINTCLR2_AVAILABLE               1
#define FM4_DSTC_HWINTCLR3_AVAILABLE              1
#define FM_DSTC_HWINTCLR3_AVAILABLE               1
#define FM4_DSTC_HWINTCLR4_AVAILABLE              1
#define FM_DSTC_HWINTCLR4_AVAILABLE               1
#define FM4_DSTC_HWINTCLR5_AVAILABLE              1
#define FM_DSTC_HWINTCLR5_AVAILABLE               1
#define FM4_DSTC_HWINTCLR6_AVAILABLE              1
#define FM_DSTC_HWINTCLR6_AVAILABLE               1
#define FM4_DSTC_HWINTCLR7_AVAILABLE              1
#define FM_DSTC_HWINTCLR7_AVAILABLE               1
#define FM4_DSTC_MONERS_AVAILABLE                 1
#define FM_DSTC_MONERS_AVAILABLE                  1
#define FM4_DSTC_SWTR_AVAILABLE                   1
#define FM_DSTC_SWTR_AVAILABLE                    1
/*******************************************************************************
* DT
*******************************************************************************/
#define FM4_DT_TIMER1BGLOAD_AVAILABLE             1
#define FM_DT_TIMER1BGLOAD_AVAILABLE              1
#define FM4_DT_TIMER1CONTROL_AVAILABLE            1
#define FM_DT_TIMER1CONTROL_AVAILABLE             1
#define FM4_DT_TIMER1INTCLR_AVAILABLE             1
#define FM_DT_TIMER1INTCLR_AVAILABLE              1
#define FM4_DT_TIMER1LOAD_AVAILABLE               1
#define FM_DT_TIMER1LOAD_AVAILABLE                1
#define FM4_DT_TIMER1MIS_AVAILABLE                1
#define FM_DT_TIMER1MIS_AVAILABLE                 1
#define FM4_DT_TIMER1RIS_AVAILABLE                1
#define FM_DT_TIMER1RIS_AVAILABLE                 1
#define FM4_DT_TIMER1VALUE_AVAILABLE              1
#define FM_DT_TIMER1VALUE_AVAILABLE               1
#define FM4_DT_TIMER2BGLOAD_AVAILABLE             1
#define FM_DT_TIMER2BGLOAD_AVAILABLE              1
#define FM4_DT_TIMER2CONTROL_AVAILABLE            1
#define FM_DT_TIMER2CONTROL_AVAILABLE             1
#define FM4_DT_TIMER2INTCLR_AVAILABLE             1
#define FM_DT_TIMER2INTCLR_AVAILABLE              1
#define FM4_DT_TIMER2LOAD_AVAILABLE               1
#define FM_DT_TIMER2LOAD_AVAILABLE                1
#define FM4_DT_TIMER2MIS_AVAILABLE                1
#define FM_DT_TIMER2MIS_AVAILABLE                 1
#define FM4_DT_TIMER2RIS_AVAILABLE                1
#define FM_DT_TIMER2RIS_AVAILABLE                 1
#define FM4_DT_TIMER2VALUE_AVAILABLE              1
#define FM_DT_TIMER2VALUE_AVAILABLE               1
/*******************************************************************************
* DUALFLASH_IF
*******************************************************************************/
#define FM4_DUALFLASH_IF_DFASZR_AVAILABLE         1
#define FM_DUALFLASH_IF_DFASZR_AVAILABLE          1
#define FM4_DUALFLASH_IF_DFRWTR_AVAILABLE         1
#define FM_DUALFLASH_IF_DFRWTR_AVAILABLE          1
#define FM4_DUALFLASH_IF_DFSTR_AVAILABLE          1
#define FM_DUALFLASH_IF_DFSTR_AVAILABLE           1
/*******************************************************************************
* ECC_CAPTURE
*******************************************************************************/
#define FM4_ECC_CAPTURE_FERRAD_AVAILABLE          1
#define FM_ECC_CAPTURE_FERRAD_AVAILABLE           1
/*******************************************************************************
* ETHERNET_CONTROL
*******************************************************************************/
#define FM4_ETHERNET_CONTROL_ETH_CLKG_AVAILABLE   1
#define FM_ETHERNET_CONTROL_ETH_CLKG_AVAILABLE    1
#define FM4_ETHERNET_CONTROL_ETH_MODE_AVAILABLE   1
#define FM_ETHERNET_CONTROL_ETH_MODE_AVAILABLE    1
/*******************************************************************************
* ETHERNET_MAC0
*******************************************************************************/
#define FM4_ETHERNET_MAC_AHBSR_AVAILABLE          1
#define FM_ETHERNET_MAC_AHBSR_AVAILABLE           1
#define FM4_ETHERNET_MAC_ATNR_AVAILABLE           1
#define FM_ETHERNET_MAC_ATNR_AVAILABLE            1
#define FM4_ETHERNET_MAC_ATSR_AVAILABLE           1
#define FM_ETHERNET_MAC_ATSR_AVAILABLE            1
#define FM4_ETHERNET_MAC_BMR_AVAILABLE            1
#define FM_ETHERNET_MAC_BMR_AVAILABLE             1
#define FM4_ETHERNET_MAC_CHRBAR_AVAILABLE         1
#define FM_ETHERNET_MAC_CHRBAR_AVAILABLE          1
#define FM4_ETHERNET_MAC_CHRDR_AVAILABLE          1
#define FM_ETHERNET_MAC_CHRDR_AVAILABLE           1
#define FM4_ETHERNET_MAC_CHTBAR_AVAILABLE         1
#define FM_ETHERNET_MAC_CHTBAR_AVAILABLE          1
#define FM4_ETHERNET_MAC_CHTDR_AVAILABLE          1
#define FM_ETHERNET_MAC_CHTDR_AVAILABLE           1
#define FM4_ETHERNET_MAC_FCR_AVAILABLE            1
#define FM_ETHERNET_MAC_FCR_AVAILABLE             1
#define FM4_ETHERNET_MAC_GAR_AVAILABLE            1
#define FM_ETHERNET_MAC_GAR_AVAILABLE             1
#define FM4_ETHERNET_MAC_GDR_AVAILABLE            1
#define FM_ETHERNET_MAC_GDR_AVAILABLE             1
#define FM4_ETHERNET_MAC_IER_AVAILABLE            1
#define FM_ETHERNET_MAC_IER_AVAILABLE             1
#define FM4_ETHERNET_MAC_IMR_AVAILABLE            1
#define FM_ETHERNET_MAC_IMR_AVAILABLE             1
#define FM4_ETHERNET_MAC_ISR_AVAILABLE            1
#define FM_ETHERNET_MAC_ISR_AVAILABLE             1
#define FM4_ETHERNET_MAC_LPICSR_AVAILABLE         1
#define FM_ETHERNET_MAC_LPICSR_AVAILABLE          1
#define FM4_ETHERNET_MAC_LPITCR_AVAILABLE         1
#define FM_ETHERNET_MAC_LPITCR_AVAILABLE          1
#define FM4_ETHERNET_MAC_MAR0H_AVAILABLE          1
#define FM_ETHERNET_MAC_MAR0H_AVAILABLE           1
#define FM4_ETHERNET_MAC_MAR0L_AVAILABLE          1
#define FM_ETHERNET_MAC_MAR0L_AVAILABLE           1
#define FM4_ETHERNET_MAC_MAR10H_AVAILABLE         1
#define FM_ETHERNET_MAC_MAR10H_AVAILABLE          1
#define FM4_ETHERNET_MAC_MAR10L_AVAILABLE         1
#define FM_ETHERNET_MAC_MAR10L_AVAILABLE          1
#define FM4_ETHERNET_MAC_MAR11H_AVAILABLE         1
#define FM_ETHERNET_MAC_MAR11H_AVAILABLE          1
#define FM4_ETHERNET_MAC_MAR11L_AVAILABLE         1
#define FM_ETHERNET_MAC_MAR11L_AVAILABLE          1
#define FM4_ETHERNET_MAC_MAR12H_AVAILABLE         1
#define FM_ETHERNET_MAC_MAR12H_AVAILABLE          1
#define FM4_ETHERNET_MAC_MAR12L_AVAILABLE         1
#define FM_ETHERNET_MAC_MAR12L_AVAILABLE          1
#define FM4_ETHERNET_MAC_MAR13H_AVAILABLE         1
#define FM_ETHERNET_MAC_MAR13H_AVAILABLE          1
#define FM4_ETHERNET_MAC_MAR13L_AVAILABLE         1
#define FM_ETHERNET_MAC_MAR13L_AVAILABLE          1
#define FM4_ETHERNET_MAC_MAR14H_AVAILABLE         1
#define FM_ETHERNET_MAC_MAR14H_AVAILABLE          1
#define FM4_ETHERNET_MAC_MAR14L_AVAILABLE         1
#define FM_ETHERNET_MAC_MAR14L_AVAILABLE          1
#define FM4_ETHERNET_MAC_MAR15H_AVAILABLE         1
#define FM_ETHERNET_MAC_MAR15H_AVAILABLE          1
#define FM4_ETHERNET_MAC_MAR15L_AVAILABLE         1
#define FM_ETHERNET_MAC_MAR15L_AVAILABLE          1
#define FM4_ETHERNET_MAC_MAR16H_AVAILABLE         1
#define FM_ETHERNET_MAC_MAR16H_AVAILABLE          1
#define FM4_ETHERNET_MAC_MAR16L_AVAILABLE         1
#define FM_ETHERNET_MAC_MAR16L_AVAILABLE          1
#define FM4_ETHERNET_MAC_MAR17H_AVAILABLE         1
#define FM_ETHERNET_MAC_MAR17H_AVAILABLE          1
#define FM4_ETHERNET_MAC_MAR17L_AVAILABLE         1
#define FM_ETHERNET_MAC_MAR17L_AVAILABLE          1
#define FM4_ETHERNET_MAC_MAR18H_AVAILABLE         1
#define FM_ETHERNET_MAC_MAR18H_AVAILABLE          1
#define FM4_ETHERNET_MAC_MAR18L_AVAILABLE         1
#define FM_ETHERNET_MAC_MAR18L_AVAILABLE          1
#define FM4_ETHERNET_MAC_MAR19H_AVAILABLE         1
#define FM_ETHERNET_MAC_MAR19H_AVAILABLE          1
#define FM4_ETHERNET_MAC_MAR19L_AVAILABLE         1
#define FM_ETHERNET_MAC_MAR19L_AVAILABLE          1
#define FM4_ETHERNET_MAC_MAR1H_AVAILABLE          1
#define FM_ETHERNET_MAC_MAR1H_AVAILABLE           1
#define FM4_ETHERNET_MAC_MAR1L_AVAILABLE          1
#define FM_ETHERNET_MAC_MAR1L_AVAILABLE           1
#define FM4_ETHERNET_MAC_MAR20H_AVAILABLE         1
#define FM_ETHERNET_MAC_MAR20H_AVAILABLE          1
#define FM4_ETHERNET_MAC_MAR20L_AVAILABLE         1
#define FM_ETHERNET_MAC_MAR20L_AVAILABLE          1
#define FM4_ETHERNET_MAC_MAR21H_AVAILABLE         1
#define FM_ETHERNET_MAC_MAR21H_AVAILABLE          1
#define FM4_ETHERNET_MAC_MAR21L_AVAILABLE         1
#define FM_ETHERNET_MAC_MAR21L_AVAILABLE          1
#define FM4_ETHERNET_MAC_MAR22H_AVAILABLE         1
#define FM_ETHERNET_MAC_MAR22H_AVAILABLE          1
#define FM4_ETHERNET_MAC_MAR22L_AVAILABLE         1
#define FM_ETHERNET_MAC_MAR22L_AVAILABLE          1
#define FM4_ETHERNET_MAC_MAR23H_AVAILABLE         1
#define FM_ETHERNET_MAC_MAR23H_AVAILABLE          1
#define FM4_ETHERNET_MAC_MAR23L_AVAILABLE         1
#define FM_ETHERNET_MAC_MAR23L_AVAILABLE          1
#define FM4_ETHERNET_MAC_MAR24H_AVAILABLE         1
#define FM_ETHERNET_MAC_MAR24H_AVAILABLE          1
#define FM4_ETHERNET_MAC_MAR24L_AVAILABLE         1
#define FM_ETHERNET_MAC_MAR24L_AVAILABLE          1
#define FM4_ETHERNET_MAC_MAR25H_AVAILABLE         1
#define FM_ETHERNET_MAC_MAR25H_AVAILABLE          1
#define FM4_ETHERNET_MAC_MAR25L_AVAILABLE         1
#define FM_ETHERNET_MAC_MAR25L_AVAILABLE          1
#define FM4_ETHERNET_MAC_MAR26H_AVAILABLE         1
#define FM_ETHERNET_MAC_MAR26H_AVAILABLE          1
#define FM4_ETHERNET_MAC_MAR26L_AVAILABLE         1
#define FM_ETHERNET_MAC_MAR26L_AVAILABLE          1
#define FM4_ETHERNET_MAC_MAR27H_AVAILABLE         1
#define FM_ETHERNET_MAC_MAR27H_AVAILABLE          1
#define FM4_ETHERNET_MAC_MAR27L_AVAILABLE         1
#define FM_ETHERNET_MAC_MAR27L_AVAILABLE          1
#define FM4_ETHERNET_MAC_MAR28H_AVAILABLE         1
#define FM_ETHERNET_MAC_MAR28H_AVAILABLE          1
#define FM4_ETHERNET_MAC_MAR28L_AVAILABLE         1
#define FM_ETHERNET_MAC_MAR28L_AVAILABLE          1
#define FM4_ETHERNET_MAC_MAR29H_AVAILABLE         1
#define FM_ETHERNET_MAC_MAR29H_AVAILABLE          1
#define FM4_ETHERNET_MAC_MAR29L_AVAILABLE         1
#define FM_ETHERNET_MAC_MAR29L_AVAILABLE          1
#define FM4_ETHERNET_MAC_MAR2H_AVAILABLE          1
#define FM_ETHERNET_MAC_MAR2H_AVAILABLE           1
#define FM4_ETHERNET_MAC_MAR2L_AVAILABLE          1
#define FM_ETHERNET_MAC_MAR2L_AVAILABLE           1
#define FM4_ETHERNET_MAC_MAR30H_AVAILABLE         1
#define FM_ETHERNET_MAC_MAR30H_AVAILABLE          1
#define FM4_ETHERNET_MAC_MAR30L_AVAILABLE         1
#define FM_ETHERNET_MAC_MAR30L_AVAILABLE          1
#define FM4_ETHERNET_MAC_MAR31H_AVAILABLE         1
#define FM_ETHERNET_MAC_MAR31H_AVAILABLE          1
#define FM4_ETHERNET_MAC_MAR31L_AVAILABLE         1
#define FM_ETHERNET_MAC_MAR31L_AVAILABLE          1
#define FM4_ETHERNET_MAC_MAR3H_AVAILABLE          1
#define FM_ETHERNET_MAC_MAR3H_AVAILABLE           1
#define FM4_ETHERNET_MAC_MAR3L_AVAILABLE          1
#define FM_ETHERNET_MAC_MAR3L_AVAILABLE           1
#define FM4_ETHERNET_MAC_MAR4H_AVAILABLE          1
#define FM_ETHERNET_MAC_MAR4H_AVAILABLE           1
#define FM4_ETHERNET_MAC_MAR4L_AVAILABLE          1
#define FM_ETHERNET_MAC_MAR4L_AVAILABLE           1
#define FM4_ETHERNET_MAC_MAR5H_AVAILABLE          1
#define FM_ETHERNET_MAC_MAR5H_AVAILABLE           1
#define FM4_ETHERNET_MAC_MAR5L_AVAILABLE          1
#define FM_ETHERNET_MAC_MAR5L_AVAILABLE           1
#define FM4_ETHERNET_MAC_MAR6H_AVAILABLE          1
#define FM_ETHERNET_MAC_MAR6H_AVAILABLE           1
#define FM4_ETHERNET_MAC_MAR6L_AVAILABLE          1
#define FM_ETHERNET_MAC_MAR6L_AVAILABLE           1
#define FM4_ETHERNET_MAC_MAR7H_AVAILABLE          1
#define FM_ETHERNET_MAC_MAR7H_AVAILABLE           1
#define FM4_ETHERNET_MAC_MAR7L_AVAILABLE          1
#define FM_ETHERNET_MAC_MAR7L_AVAILABLE           1
#define FM4_ETHERNET_MAC_MAR8H_AVAILABLE          1
#define FM_ETHERNET_MAC_MAR8H_AVAILABLE           1
