sol4ik/audio-steganography/try/fm4/s6e2ccxh/common/s6e2ccxh.h
/*******************************************************************************
* CANFD Registers CANFD0
*   Bitband Section
*******************************************************************************/
#define bFM_CANFD0_CCCR_INIT                      *((volatile  uint8_t *)(0x42E00300UL))
#define bFM4_CANFD0_CCCR_INIT                     *((volatile  uint8_t *)(0x42E00300UL))
#define bFM_CANFD0_CCCR_CCE                       *((volatile  uint8_t *)(0x42E00304UL))
#define bFM4_CANFD0_CCCR_CCE                      *((volatile  uint8_t *)(0x42E00304UL))
#define bFM_CANFD0_CCCR_ASM                       *((volatile  uint8_t *)(0x42E00308UL))
#define bFM4_CANFD0_CCCR_ASM                      *((volatile  uint8_t *)(0x42E00308UL))
#define bFM_CANFD0_CCCR_CSA                       *((volatile  uint8_t *)(0x42E0030CUL))
#define bFM4_CANFD0_CCCR_CSA                      *((volatile  uint8_t *)(0x42E0030CUL))
#define bFM_CANFD0_CCCR_CSR                       *((volatile  uint8_t *)(0x42E00310UL))
#define bFM4_CANFD0_CCCR_CSR                      *((volatile  uint8_t *)(0x42E00310UL))
#define bFM_CANFD0_CCCR_MON                       *((volatile  uint8_t *)(0x42E00314UL))
#define bFM4_CANFD0_CCCR_MON                      *((volatile  uint8_t *)(0x42E00314UL))
#define bFM_CANFD0_CCCR_DAR                       *((volatile  uint8_t *)(0x42E00318UL))
#define bFM4_CANFD0_CCCR_DAR                      *((volatile  uint8_t *)(0x42E00318UL))
#define bFM_CANFD0_CCCR_TEST                      *((volatile  uint8_t *)(0x42E0031CUL))
#define bFM4_CANFD0_CCCR_TEST                     *((volatile  uint8_t *)(0x42E0031CUL))
#define bFM_CANFD0_CCCR_FDO                       *((volatile  uint8_t *)(0x42E00330UL))
#define bFM4_CANFD0_CCCR_FDO                      *((volatile  uint8_t *)(0x42E00330UL))
#define bFM_CANFD0_CCCR_FDBS                      *((volatile  uint8_t *)(0x42E00334UL))
#define bFM4_CANFD0_CCCR_FDBS                     *((volatile  uint8_t *)(0x42E00334UL))
#define bFM_CANFD0_CCCR_TXP                       *((volatile  uint8_t *)(0x42E00338UL))
#define bFM4_CANFD0_CCCR_TXP                      *((volatile  uint8_t *)(0x42E00338UL))

#define bFM_CANFD0_ECR_RP                         *((volatile  uint8_t *)(0x42E0083CUL))
#define bFM4_CANFD0_ECR_RP                        *((volatile  uint8_t *)(0x42E0083CUL))

#define bFM_CANFD0_FBTP_TDC                       *((volatile  uint8_t *)(0x42E001DCUL))
#define bFM4_CANFD0_FBTP_TDC                      *((volatile  uint8_t *)(0x42E001DCUL))

#define bFM_CANFD0_FDECR_SEIE                     *((volatile  uint8_t *)(0x42E04000UL))
#define bFM4_CANFD0_FDECR_SEIE                    *((volatile  uint8_t *)(0x42E04000UL))
#define bFM_CANFD0_FDECR_DEIE                     *((volatile  uint8_t *)(0x42E04004UL))
#define bFM4_CANFD0_FDECR_DEIE                    *((volatile  uint8_t *)(0x42E04004UL))
#define bFM_CANFD0_FDECR_CEREN                    *((volatile  uint8_t *)(0x42E04008UL))
#define bFM4_CANFD0_FDECR_CEREN                   *((volatile  uint8_t *)(0x42E04008UL))
#define bFM_CANFD0_FDECR_CEIV                     *((volatile  uint8_t *)(0x42E0400CUL))
#define bFM4_CANFD0_FDECR_CEIV                    *((volatile  uint8_t *)(0x42E0400CUL))

#define bFM_CANFD0_FDESCR_SEIC                    *((volatile  uint8_t *)(0x42E040A0UL))
#define bFM4_CANFD0_FDESCR_SEIC                   *((volatile  uint8_t *)(0x42E040A0UL))
#define bFM_CANFD0_FDESCR_DEIC                    *((volatile  uint8_t *)(0x42E040A4UL))
#define bFM4_CANFD0_FDESCR_DEIC                   *((volatile  uint8_t *)(0x42E040A4UL))

#define bFM_CANFD0_FDESR_SEI                      *((volatile  uint8_t *)(0x42E04020UL))
#define bFM4_CANFD0_FDESR_SEI                     *((volatile  uint8_t *)(0x42E04020UL))
#define bFM_CANFD0_FDESR_DEI                      *((volatile  uint8_t *)(0x42E04024UL))
#define bFM4_CANFD0_FDESR_DEI                     *((volatile  uint8_t *)(0x42E04024UL))

#define bFM_CANFD0_GFC_RRFE                       *((volatile  uint8_t *)(0x42E01000UL))
#define bFM4_CANFD0_GFC_RRFE                      *((volatile  uint8_t *)(0x42E01000UL))
#define bFM_CANFD0_GFC_RRFS                       *((volatile  uint8_t *)(0x42E01004UL))
#define bFM4_CANFD0_GFC_RRFS                      *((volatile  uint8_t *)(0x42E01004UL))

#define bFM_CANFD0_HPMS_FLST                      *((volatile  uint8_t *)(0x42E012BCUL))
#define bFM4_CANFD0_HPMS_FLST                     *((volatile  uint8_t *)(0x42E012BCUL))

#define bFM_CANFD0_IE_RF0NE                       *((volatile  uint8_t *)(0x42E00A80UL))
#define bFM4_CANFD0_IE_RF0NE                      *((volatile  uint8_t *)(0x42E00A80UL))
#define bFM_CANFD0_IE_RF0WE                       *((volatile  uint8_t *)(0x42E00A84UL))
#define bFM4_CANFD0_IE_RF0WE                      *((volatile  uint8_t *)(0x42E00A84UL))
#define bFM_CANFD0_IE_RF0FE                       *((volatile  uint8_t *)(0x42E00A88UL))
#define bFM4_CANFD0_IE_RF0FE                      *((volatile  uint8_t *)(0x42E00A88UL))
#define bFM_CANFD0_IE_RF0LE                       *((volatile  uint8_t *)(0x42E00A8CUL))
#define bFM4_CANFD0_IE_RF0LE                      *((volatile  uint8_t *)(0x42E00A8CUL))
#define bFM_CANFD0_IE_RF1NE                       *((volatile  uint8_t *)(0x42E00A90UL))
#define bFM4_CANFD0_IE_RF1NE                      *((volatile  uint8_t *)(0x42E00A90UL))
#define bFM_CANFD0_IE_RF1WE                       *((volatile  uint8_t *)(0x42E00A94UL))
#define bFM4_CANFD0_IE_RF1WE                      *((volatile  uint8_t *)(0x42E00A94UL))
#define bFM_CANFD0_IE_RF1FE                       *((volatile  uint8_t *)(0x42E00A98UL))
#define bFM4_CANFD0_IE_RF1FE                      *((volatile  uint8_t *)(0x42E00A98UL))
#define bFM_CANFD0_IE_RF1LE                       *((volatile  uint8_t *)(0x42E00A9CUL))
#define bFM4_CANFD0_IE_RF1LE                      *((volatile  uint8_t *)(0x42E00A9CUL))
#define bFM_CANFD0_IE_HPME                        *((volatile  uint8_t *)(0x42E00AA0UL))
#define bFM4_CANFD0_IE_HPME                       *((volatile  uint8_t *)(0x42E00AA0UL))
#define bFM_CANFD0_IE_TCE                         *((volatile  uint8_t *)(0x42E00AA4UL))
#define bFM4_CANFD0_IE_TCE                        *((volatile  uint8_t *)(0x42E00AA4UL))
#define bFM_CANFD0_IE_TCFE                        *((volatile  uint8_t *)(0x42E00AA8UL))
#define bFM4_CANFD0_IE_TCFE                       *((volatile  uint8_t *)(0x42E00AA8UL))
#define bFM_CANFD0_IE_TFEE                        *((volatile  uint8_t *)(0x42E00AACUL))
#define bFM4_CANFD0_IE_TFEE                       *((volatile  uint8_t *)(0x42E00AACUL))
#define bFM_CANFD0_IE_TEFNE                       *((volatile  uint8_t *)(0x42E00AB0UL))
#define bFM4_CANFD0_IE_TEFNE                      *((volatile  uint8_t *)(0x42E00AB0UL))
#define bFM_CANFD0_IE_TEFWE                       *((volatile  uint8_t *)(0x42E00AB4UL))
#define bFM4_CANFD0_IE_TEFWE                      *((volatile  uint8_t *)(0x42E00AB4UL))
#define bFM_CANFD0_IE_TEFFE                       *((volatile  uint8_t *)(0x42E00AB8UL))
#define bFM4_CANFD0_IE_TEFFE                      *((volatile  uint8_t *)(0x42E00AB8UL))
#define bFM_CANFD0_IE_TEFLE                       *((volatile  uint8_t *)(0x42E00ABCUL))
#define bFM4_CANFD0_IE_TEFLE                      *((volatile  uint8_t *)(0x42E00ABCUL))
#define bFM_CANFD0_IE_TSWE                        *((volatile  uint8_t *)(0x42E00AC0UL))
#define bFM4_CANFD0_IE_TSWE                       *((volatile  uint8_t *)(0x42E00AC0UL))
#define bFM_CANFD0_IE_MRAFE                       *((volatile  uint8_t *)(0x42E00AC4UL))
#define bFM4_CANFD0_IE_MRAFE                      *((volatile  uint8_t *)(0x42E00AC4UL))
#define bFM_CANFD0_IE_TOOE                        *((volatile  uint8_t *)(0x42E00AC8UL))
#define bFM4_CANFD0_IE_TOOE                       *((volatile  uint8_t *)(0x42E00AC8UL))
#define bFM_CANFD0_IE_DRXE                        *((volatile  uint8_t *)(0x42E00ACCUL))
#define bFM4_CANFD0_IE_DRXE                       *((volatile  uint8_t *)(0x42E00ACCUL))
#define bFM_CANFD0_IE_BECE                        *((volatile  uint8_t *)(0x42E00AD0UL))
#define bFM4_CANFD0_IE_BECE                       *((volatile  uint8_t *)(0x42E00AD0UL))
#define bFM_CANFD0_IE_BEUE                        *((volatile  uint8_t *)(0x42E00AD4UL))
#define bFM4_CANFD0_IE_BEUE                       *((volatile  uint8_t *)(0x42E00AD4UL))
#define bFM_CANFD0_IE_ELOE                        *((volatile  uint8_t *)(0x42E00AD8UL))
#define bFM4_CANFD0_IE_ELOE                       *((volatile  uint8_t *)(0x42E00AD8UL))
#define bFM_CANFD0_IE_EPE                         *((volatile  uint8_t *)(0x42E00ADCUL))
#define bFM4_CANFD0_IE_EPE                        *((volatile  uint8_t *)(0x42E00ADCUL))
#define bFM_CANFD0_IE_EWE                         *((volatile  uint8_t *)(0x42E00AE0UL))
#define bFM4_CANFD0_IE_EWE                        *((volatile  uint8_t *)(0x42E00AE0UL))
#define bFM_CANFD0_IE_BOE                         *((volatile  uint8_t *)(0x42E00AE4UL))
#define bFM4_CANFD0_IE_BOE                        *((volatile  uint8_t *)(0x42E00AE4UL))
#define bFM_CANFD0_IE_WDIE                        *((volatile  uint8_t *)(0x42E00AE8UL))
#define bFM4_CANFD0_IE_WDIE                       *((volatile  uint8_t *)(0x42E00AE8UL))
#define bFM_CANFD0_IE_CRCEE                       *((volatile  uint8_t *)(0x42E00AECUL))
#define bFM4_CANFD0_IE_CRCEE                      *((volatile  uint8_t *)(0x42E00AECUL))
#define bFM_CANFD0_IE_BEE                         *((volatile  uint8_t *)(0x42E00AF0UL))
#define bFM4_CANFD0_IE_BEE                        *((volatile  uint8_t *)(0x42E00AF0UL))
#define bFM_CANFD0_IE_ACKEE                       *((volatile  uint8_t *)(0x42E00AF4UL))
#define bFM4_CANFD0_IE_ACKEE                      *((volatile  uint8_t *)(0x42E00AF4UL))
#define bFM_CANFD0_IE_FOEE                        *((volatile  uint8_t *)(0x42E00AF8UL))
#define bFM4_CANFD0_IE_FOEE                       *((volatile  uint8_t *)(0x42E00AF8UL))
#define bFM_CANFD0_IE_STEE                        *((volatile  uint8_t *)(0x42E00AFCUL))
#define bFM4_CANFD0_IE_STEE                       *((volatile  uint8_t *)(0x42E00AFCUL))

