sol4ik/audio-steganography/try/fm4/s6e2ccxh/common/s6e2ccxh.h
#define bFM_CANFD0_IR_RF0N                        *((volatile  uint8_t *)(0x42E00A00UL))
#define bFM4_CANFD0_IR_RF0N                       *((volatile  uint8_t *)(0x42E00A00UL))
#define bFM_CANFD0_IR_RF0W                        *((volatile  uint8_t *)(0x42E00A04UL))
#define bFM4_CANFD0_IR_RF0W                       *((volatile  uint8_t *)(0x42E00A04UL))
#define bFM_CANFD0_IR_RF0F                        *((volatile  uint8_t *)(0x42E00A08UL))
#define bFM4_CANFD0_IR_RF0F                       *((volatile  uint8_t *)(0x42E00A08UL))
#define bFM_CANFD0_IR_RF0L                        *((volatile  uint8_t *)(0x42E00A0CUL))
#define bFM4_CANFD0_IR_RF0L                       *((volatile  uint8_t *)(0x42E00A0CUL))
#define bFM_CANFD0_IR_RF1N                        *((volatile  uint8_t *)(0x42E00A10UL))
#define bFM4_CANFD0_IR_RF1N                       *((volatile  uint8_t *)(0x42E00A10UL))
#define bFM_CANFD0_IR_RF1W                        *((volatile  uint8_t *)(0x42E00A14UL))
#define bFM4_CANFD0_IR_RF1W                       *((volatile  uint8_t *)(0x42E00A14UL))
#define bFM_CANFD0_IR_RF1F                        *((volatile  uint8_t *)(0x42E00A18UL))
#define bFM4_CANFD0_IR_RF1F                       *((volatile  uint8_t *)(0x42E00A18UL))
#define bFM_CANFD0_IR_RF1L                        *((volatile  uint8_t *)(0x42E00A1CUL))
#define bFM4_CANFD0_IR_RF1L                       *((volatile  uint8_t *)(0x42E00A1CUL))
#define bFM_CANFD0_IR_HPM                         *((volatile  uint8_t *)(0x42E00A20UL))
#define bFM4_CANFD0_IR_HPM                        *((volatile  uint8_t *)(0x42E00A20UL))
#define bFM_CANFD0_IR_TC                          *((volatile  uint8_t *)(0x42E00A24UL))
#define bFM4_CANFD0_IR_TC                         *((volatile  uint8_t *)(0x42E00A24UL))
#define bFM_CANFD0_IR_TCF                         *((volatile  uint8_t *)(0x42E00A28UL))
#define bFM4_CANFD0_IR_TCF                        *((volatile  uint8_t *)(0x42E00A28UL))
#define bFM_CANFD0_IR_TFE                         *((volatile  uint8_t *)(0x42E00A2CUL))
#define bFM4_CANFD0_IR_TFE                        *((volatile  uint8_t *)(0x42E00A2CUL))
#define bFM_CANFD0_IR_TEFN                        *((volatile  uint8_t *)(0x42E00A30UL))
#define bFM4_CANFD0_IR_TEFN                       *((volatile  uint8_t *)(0x42E00A30UL))
#define bFM_CANFD0_IR_TEFW                        *((volatile  uint8_t *)(0x42E00A34UL))
#define bFM4_CANFD0_IR_TEFW                       *((volatile  uint8_t *)(0x42E00A34UL))
#define bFM_CANFD0_IR_TEFF                        *((volatile  uint8_t *)(0x42E00A38UL))
#define bFM4_CANFD0_IR_TEFF                       *((volatile  uint8_t *)(0x42E00A38UL))
#define bFM_CANFD0_IR_TEFL                        *((volatile  uint8_t *)(0x42E00A3CUL))
#define bFM4_CANFD0_IR_TEFL                       *((volatile  uint8_t *)(0x42E00A3CUL))
#define bFM_CANFD0_IR_TSW                         *((volatile  uint8_t *)(0x42E00A40UL))
#define bFM4_CANFD0_IR_TSW                        *((volatile  uint8_t *)(0x42E00A40UL))
#define bFM_CANFD0_IR_MRAF                        *((volatile  uint8_t *)(0x42E00A44UL))
#define bFM4_CANFD0_IR_MRAF                       *((volatile  uint8_t *)(0x42E00A44UL))
#define bFM_CANFD0_IR_TOO                         *((volatile  uint8_t *)(0x42E00A48UL))
#define bFM4_CANFD0_IR_TOO                        *((volatile  uint8_t *)(0x42E00A48UL))
#define bFM_CANFD0_IR_DRX                         *((volatile  uint8_t *)(0x42E00A4CUL))
#define bFM4_CANFD0_IR_DRX                        *((volatile  uint8_t *)(0x42E00A4CUL))
#define bFM_CANFD0_IR_BEC                         *((volatile  uint8_t *)(0x42E00A50UL))
#define bFM4_CANFD0_IR_BEC                        *((volatile  uint8_t *)(0x42E00A50UL))
#define bFM_CANFD0_IR_BEU                         *((volatile  uint8_t *)(0x42E00A54UL))
#define bFM4_CANFD0_IR_BEU                        *((volatile  uint8_t *)(0x42E00A54UL))
#define bFM_CANFD0_IR_ELO                         *((volatile  uint8_t *)(0x42E00A58UL))
#define bFM4_CANFD0_IR_ELO                        *((volatile  uint8_t *)(0x42E00A58UL))
#define bFM_CANFD0_IR_EP                          *((volatile  uint8_t *)(0x42E00A5CUL))
#define bFM4_CANFD0_IR_EP                         *((volatile  uint8_t *)(0x42E00A5CUL))
#define bFM_CANFD0_IR_EW                          *((volatile  uint8_t *)(0x42E00A60UL))
#define bFM4_CANFD0_IR_EW                         *((volatile  uint8_t *)(0x42E00A60UL))
#define bFM_CANFD0_IR_BO                          *((volatile  uint8_t *)(0x42E00A64UL))
#define bFM4_CANFD0_IR_BO                         *((volatile  uint8_t *)(0x42E00A64UL))
#define bFM_CANFD0_IR_WDI                         *((volatile  uint8_t *)(0x42E00A68UL))
#define bFM4_CANFD0_IR_WDI                        *((volatile  uint8_t *)(0x42E00A68UL))
#define bFM_CANFD0_IR_CRCE                        *((volatile  uint8_t *)(0x42E00A6CUL))
#define bFM4_CANFD0_IR_CRCE                       *((volatile  uint8_t *)(0x42E00A6CUL))
#define bFM_CANFD0_IR_BE                          *((volatile  uint8_t *)(0x42E00A70UL))
#define bFM4_CANFD0_IR_BE                         *((volatile  uint8_t *)(0x42E00A70UL))
#define bFM_CANFD0_IR_ACKE                        *((volatile  uint8_t *)(0x42E00A74UL))
#define bFM4_CANFD0_IR_ACKE                       *((volatile  uint8_t *)(0x42E00A74UL))
#define bFM_CANFD0_IR_FOE                         *((volatile  uint8_t *)(0x42E00A78UL))
#define bFM4_CANFD0_IR_FOE                        *((volatile  uint8_t *)(0x42E00A78UL))
#define bFM_CANFD0_IR_STE                         *((volatile  uint8_t *)(0x42E00A7CUL))
#define bFM4_CANFD0_IR_STE                        *((volatile  uint8_t *)(0x42E00A7CUL))

#define bFM_CANFD0_NDAT1_ND0                      *((volatile  uint8_t *)(0x42E01300UL))
#define bFM4_CANFD0_NDAT1_ND0                     *((volatile  uint8_t *)(0x42E01300UL))
#define bFM_CANFD0_NDAT1_ND1                      *((volatile  uint8_t *)(0x42E01304UL))
#define bFM4_CANFD0_NDAT1_ND1                     *((volatile  uint8_t *)(0x42E01304UL))
#define bFM_CANFD0_NDAT1_ND2                      *((volatile  uint8_t *)(0x42E01308UL))
#define bFM4_CANFD0_NDAT1_ND2                     *((volatile  uint8_t *)(0x42E01308UL))
#define bFM_CANFD0_NDAT1_ND3                      *((volatile  uint8_t *)(0x42E0130CUL))
#define bFM4_CANFD0_NDAT1_ND3                     *((volatile  uint8_t *)(0x42E0130CUL))
#define bFM_CANFD0_NDAT1_ND4                      *((volatile  uint8_t *)(0x42E01310UL))
#define bFM4_CANFD0_NDAT1_ND4                     *((volatile  uint8_t *)(0x42E01310UL))
#define bFM_CANFD0_NDAT1_ND5                      *((volatile  uint8_t *)(0x42E01314UL))
#define bFM4_CANFD0_NDAT1_ND5                     *((volatile  uint8_t *)(0x42E01314UL))
#define bFM_CANFD0_NDAT1_ND6                      *((volatile  uint8_t *)(0x42E01318UL))
#define bFM4_CANFD0_NDAT1_ND6                     *((volatile  uint8_t *)(0x42E01318UL))
#define bFM_CANFD0_NDAT1_ND7                      *((volatile  uint8_t *)(0x42E0131CUL))
#define bFM4_CANFD0_NDAT1_ND7                     *((volatile  uint8_t *)(0x42E0131CUL))
#define bFM_CANFD0_NDAT1_ND8                      *((volatile  uint8_t *)(0x42E01320UL))
#define bFM4_CANFD0_NDAT1_ND8                     *((volatile  uint8_t *)(0x42E01320UL))
#define bFM_CANFD0_NDAT1_ND9                      *((volatile  uint8_t *)(0x42E01324UL))
#define bFM4_CANFD0_NDAT1_ND9                     *((volatile  uint8_t *)(0x42E01324UL))
#define bFM_CANFD0_NDAT1_ND10                     *((volatile  uint8_t *)(0x42E01328UL))
#define bFM4_CANFD0_NDAT1_ND10                    *((volatile  uint8_t *)(0x42E01328UL))
#define bFM_CANFD0_NDAT1_ND11                     *((volatile  uint8_t *)(0x42E0132CUL))
#define bFM4_CANFD0_NDAT1_ND11                    *((volatile  uint8_t *)(0x42E0132CUL))
#define bFM_CANFD0_NDAT1_ND12                     *((volatile  uint8_t *)(0x42E01330UL))
#define bFM4_CANFD0_NDAT1_ND12                    *((volatile  uint8_t *)(0x42E01330UL))
#define bFM_CANFD0_NDAT1_ND13                     *((volatile  uint8_t *)(0x42E01334UL))
#define bFM4_CANFD0_NDAT1_ND13                    *((volatile  uint8_t *)(0x42E01334UL))
#define bFM_CANFD0_NDAT1_ND14                     *((volatile  uint8_t *)(0x42E01338UL))
#define bFM4_CANFD0_NDAT1_ND14                    *((volatile  uint8_t *)(0x42E01338UL))
#define bFM_CANFD0_NDAT1_ND15                     *((volatile  uint8_t *)(0x42E0133CUL))
#define bFM4_CANFD0_NDAT1_ND15                    *((volatile  uint8_t *)(0x42E0133CUL))
#define bFM_CANFD0_NDAT1_ND16                     *((volatile  uint8_t *)(0x42E01340UL))
#define bFM4_CANFD0_NDAT1_ND16                    *((volatile  uint8_t *)(0x42E01340UL))
#define bFM_CANFD0_NDAT1_ND17                     *((volatile  uint8_t *)(0x42E01344UL))
#define bFM4_CANFD0_NDAT1_ND17                    *((volatile  uint8_t *)(0x42E01344UL))
#define bFM_CANFD0_NDAT1_ND18                     *((volatile  uint8_t *)(0x42E01348UL))
#define bFM4_CANFD0_NDAT1_ND18                    *((volatile  uint8_t *)(0x42E01348UL))
#define bFM_CANFD0_NDAT1_ND19                     *((volatile  uint8_t *)(0x42E0134CUL))
#define bFM4_CANFD0_NDAT1_ND19                    *((volatile  uint8_t *)(0x42E0134CUL))
#define bFM_CANFD0_NDAT1_ND20                     *((volatile  uint8_t *)(0x42E01350UL))
#define bFM4_CANFD0_NDAT1_ND20                    *((volatile  uint8_t *)(0x42E01350UL))
#define bFM_CANFD0_NDAT1_ND21                     *((volatile  uint8_t *)(0x42E01354UL))
#define bFM4_CANFD0_NDAT1_ND21                    *((volatile  uint8_t *)(0x42E01354UL))
#define bFM_CANFD0_NDAT1_ND22                     *((volatile  uint8_t *)(0x42E01358UL))
#define bFM4_CANFD0_NDAT1_ND22                    *((volatile  uint8_t *)(0x42E01358UL))
#define bFM_CANFD0_NDAT1_ND23                     *((volatile  uint8_t *)(0x42E0135CUL))
#define bFM4_CANFD0_NDAT1_ND23                    *((volatile  uint8_t *)(0x42E0135CUL))
#define bFM_CANFD0_NDAT1_ND24                     *((volatile  uint8_t *)(0x42E01360UL))
#define bFM4_CANFD0_NDAT1_ND24                    *((volatile  uint8_t *)(0x42E01360UL))
#define bFM_CANFD0_NDAT1_ND25                     *((volatile  uint8_t *)(0x42E01364UL))
#define bFM4_CANFD0_NDAT1_ND25                    *((volatile  uint8_t *)(0x42E01364UL))
#define bFM_CANFD0_NDAT1_ND26                     *((volatile  uint8_t *)(0x42E01368UL))
#define bFM4_CANFD0_NDAT1_ND26                    *((volatile  uint8_t *)(0x42E01368UL))
#define bFM_CANFD0_NDAT1_ND27                     *((volatile  uint8_t *)(0x42E0136CUL))
#define bFM4_CANFD0_NDAT1_ND27                    *((volatile  uint8_t *)(0x42E0136CUL))
#define bFM_CANFD0_NDAT1_ND28                     *((volatile  uint8_t *)(0x42E01370UL))
#define bFM4_CANFD0_NDAT1_ND28                    *((volatile  uint8_t *)(0x42E01370UL))
#define bFM_CANFD0_NDAT1_ND29                     *((volatile  uint8_t *)(0x42E01374UL))
#define bFM4_CANFD0_NDAT1_ND29                    *((volatile  uint8_t *)(0x42E01374UL))
#define bFM_CANFD0_NDAT1_ND30                     *((volatile  uint8_t *)(0x42E01378UL))
#define bFM4_CANFD0_NDAT1_ND30                    *((volatile  uint8_t *)(0x42E01378UL))
#define bFM_CANFD0_NDAT1_ND31                     *((volatile  uint8_t *)(0x42E0137CUL))
#define bFM4_CANFD0_NDAT1_ND31                    *((volatile  uint8_t *)(0x42E0137CUL))

