sol4ik/audio-steganography/try/fm4/s6e2ccxh/common/s6e2ccxh.h
#define bFM_ETHERNET_MAC0_RGSR_LM                 *((volatile  uint8_t *)(0x42C81B00UL))
#define bFM4_ETHERNET_MAC0_RGSR_LM                *((volatile  uint8_t *)(0x42C81B00UL))
#define bFM_ETHERNET_MAC0_RGSR_LS                 *((volatile  uint8_t *)(0x42C81B0CUL))
#define bFM4_ETHERNET_MAC0_RGSR_LS                *((volatile  uint8_t *)(0x42C81B0CUL))

#define bFM_ETHERNET_MAC0_SR_TI                   *((volatile  uint8_t *)(0x42CA0280UL))
#define bFM4_ETHERNET_MAC0_SR_TI                  *((volatile  uint8_t *)(0x42CA0280UL))
#define bFM_ETHERNET_MAC0_SR_TPS                  *((volatile  uint8_t *)(0x42CA0284UL))
#define bFM4_ETHERNET_MAC0_SR_TPS                 *((volatile  uint8_t *)(0x42CA0284UL))
#define bFM_ETHERNET_MAC0_SR_TU                   *((volatile  uint8_t *)(0x42CA0288UL))
#define bFM4_ETHERNET_MAC0_SR_TU                  *((volatile  uint8_t *)(0x42CA0288UL))
#define bFM_ETHERNET_MAC0_SR_TJT                  *((volatile  uint8_t *)(0x42CA028CUL))
#define bFM4_ETHERNET_MAC0_SR_TJT                 *((volatile  uint8_t *)(0x42CA028CUL))
#define bFM_ETHERNET_MAC0_SR_OVF                  *((volatile  uint8_t *)(0x42CA0290UL))
#define bFM4_ETHERNET_MAC0_SR_OVF                 *((volatile  uint8_t *)(0x42CA0290UL))
#define bFM_ETHERNET_MAC0_SR_UNF                  *((volatile  uint8_t *)(0x42CA0294UL))
#define bFM4_ETHERNET_MAC0_SR_UNF                 *((volatile  uint8_t *)(0x42CA0294UL))
#define bFM_ETHERNET_MAC0_SR_RI                   *((volatile  uint8_t *)(0x42CA0298UL))
#define bFM4_ETHERNET_MAC0_SR_RI                  *((volatile  uint8_t *)(0x42CA0298UL))
#define bFM_ETHERNET_MAC0_SR_RU                   *((volatile  uint8_t *)(0x42CA029CUL))
#define bFM4_ETHERNET_MAC0_SR_RU                  *((volatile  uint8_t *)(0x42CA029CUL))
#define bFM_ETHERNET_MAC0_SR_RPS                  *((volatile  uint8_t *)(0x42CA02A0UL))
#define bFM4_ETHERNET_MAC0_SR_RPS                 *((volatile  uint8_t *)(0x42CA02A0UL))
#define bFM_ETHERNET_MAC0_SR_RWT                  *((volatile  uint8_t *)(0x42CA02A4UL))
#define bFM4_ETHERNET_MAC0_SR_RWT                 *((volatile  uint8_t *)(0x42CA02A4UL))
#define bFM_ETHERNET_MAC0_SR_ETI                  *((volatile  uint8_t *)(0x42CA02A8UL))
#define bFM4_ETHERNET_MAC0_SR_ETI                 *((volatile  uint8_t *)(0x42CA02A8UL))
#define bFM_ETHERNET_MAC0_SR_FBI                  *((volatile  uint8_t *)(0x42CA02B4UL))
#define bFM4_ETHERNET_MAC0_SR_FBI                 *((volatile  uint8_t *)(0x42CA02B4UL))
#define bFM_ETHERNET_MAC0_SR_ERI                  *((volatile  uint8_t *)(0x42CA02B8UL))
#define bFM4_ETHERNET_MAC0_SR_ERI                 *((volatile  uint8_t *)(0x42CA02B8UL))
#define bFM_ETHERNET_MAC0_SR_AIS                  *((volatile  uint8_t *)(0x42CA02BCUL))
#define bFM4_ETHERNET_MAC0_SR_AIS                 *((volatile  uint8_t *)(0x42CA02BCUL))
#define bFM_ETHERNET_MAC0_SR_NIS                  *((volatile  uint8_t *)(0x42CA02C0UL))
#define bFM4_ETHERNET_MAC0_SR_NIS                 *((volatile  uint8_t *)(0x42CA02C0UL))
#define bFM_ETHERNET_MAC0_SR_GLI                  *((volatile  uint8_t *)(0x42CA02E8UL))
#define bFM4_ETHERNET_MAC0_SR_GLI                 *((volatile  uint8_t *)(0x42CA02E8UL))
#define bFM_ETHERNET_MAC0_SR_GMI                  *((volatile  uint8_t *)(0x42CA02ECUL))
#define bFM4_ETHERNET_MAC0_SR_GMI                 *((volatile  uint8_t *)(0x42CA02ECUL))
#define bFM_ETHERNET_MAC0_SR_GPI                  *((volatile  uint8_t *)(0x42CA02F0UL))
#define bFM4_ETHERNET_MAC0_SR_GPI                 *((volatile  uint8_t *)(0x42CA02F0UL))
#define bFM_ETHERNET_MAC0_SR_TTI                  *((volatile  uint8_t *)(0x42CA02F4UL))
#define bFM4_ETHERNET_MAC0_SR_TTI                 *((volatile  uint8_t *)(0x42CA02F4UL))
#define bFM_ETHERNET_MAC0_SR_GLPII                *((volatile  uint8_t *)(0x42CA02F8UL))
#define bFM4_ETHERNET_MAC0_SR_GLPII               *((volatile  uint8_t *)(0x42CA02F8UL))

#define bFM_ETHERNET_MAC0_STNUR_ADDSUB            *((volatile  uint8_t *)(0x42C8E2FCUL))
#define bFM4_ETHERNET_MAC0_STNUR_ADDSUB           *((volatile  uint8_t *)(0x42C8E2FCUL))

#define bFM_ETHERNET_MAC0_TSCR_TSE                *((volatile  uint8_t *)(0x42C8E000UL))
#define bFM4_ETHERNET_MAC0_TSCR_TSE               *((volatile  uint8_t *)(0x42C8E000UL))
#define bFM_ETHERNET_MAC0_TSCR_TFCU               *((volatile  uint8_t *)(0x42C8E004UL))
#define bFM4_ETHERNET_MAC0_TSCR_TFCU              *((volatile  uint8_t *)(0x42C8E004UL))
#define bFM_ETHERNET_MAC0_TSCR_TSI                *((volatile  uint8_t *)(0x42C8E008UL))
#define bFM4_ETHERNET_MAC0_TSCR_TSI               *((volatile  uint8_t *)(0x42C8E008UL))
#define bFM_ETHERNET_MAC0_TSCR_TSU                *((volatile  uint8_t *)(0x42C8E00CUL))
#define bFM4_ETHERNET_MAC0_TSCR_TSU               *((volatile  uint8_t *)(0x42C8E00CUL))
#define bFM_ETHERNET_MAC0_TSCR_TITE               *((volatile  uint8_t *)(0x42C8E010UL))
#define bFM4_ETHERNET_MAC0_TSCR_TITE              *((volatile  uint8_t *)(0x42C8E010UL))
#define bFM_ETHERNET_MAC0_TSCR_TARU               *((volatile  uint8_t *)(0x42C8E014UL))
#define bFM4_ETHERNET_MAC0_TSCR_TARU              *((volatile  uint8_t *)(0x42C8E014UL))
#define bFM_ETHERNET_MAC0_TSCR_TSEA               *((volatile  uint8_t *)(0x42C8E020UL))
#define bFM4_ETHERNET_MAC0_TSCR_TSEA              *((volatile  uint8_t *)(0x42C8E020UL))
#define bFM_ETHERNET_MAC0_TSCR_TSDB               *((volatile  uint8_t *)(0x42C8E024UL))
#define bFM4_ETHERNET_MAC0_TSCR_TSDB              *((volatile  uint8_t *)(0x42C8E024UL))
#define bFM_ETHERNET_MAC0_TSCR_TSV2E              *((volatile  uint8_t *)(0x42C8E028UL))
#define bFM4_ETHERNET_MAC0_TSCR_TSV2E             *((volatile  uint8_t *)(0x42C8E028UL))
#define bFM_ETHERNET_MAC0_TSCR_TETSP              *((volatile  uint8_t *)(0x42C8E02CUL))
#define bFM4_ETHERNET_MAC0_TSCR_TETSP             *((volatile  uint8_t *)(0x42C8E02CUL))
#define bFM_ETHERNET_MAC0_TSCR_TSIP6E             *((volatile  uint8_t *)(0x42C8E030UL))
#define bFM4_ETHERNET_MAC0_TSCR_TSIP6E            *((volatile  uint8_t *)(0x42C8E030UL))
#define bFM_ETHERNET_MAC0_TSCR_TSIP4E             *((volatile  uint8_t *)(0x42C8E034UL))
#define bFM4_ETHERNET_MAC0_TSCR_TSIP4E            *((volatile  uint8_t *)(0x42C8E034UL))
#define bFM_ETHERNET_MAC0_TSCR_TETSEM             *((volatile  uint8_t *)(0x42C8E038UL))
#define bFM4_ETHERNET_MAC0_TSCR_TETSEM            *((volatile  uint8_t *)(0x42C8E038UL))
#define bFM_ETHERNET_MAC0_TSCR_TSMRM              *((volatile  uint8_t *)(0x42C8E03CUL))
#define bFM4_ETHERNET_MAC0_TSCR_TSMRM             *((volatile  uint8_t *)(0x42C8E03CUL))
#define bFM_ETHERNET_MAC0_TSCR_TSENMF             *((volatile  uint8_t *)(0x42C8E048UL))
#define bFM4_ETHERNET_MAC0_TSCR_TSENMF            *((volatile  uint8_t *)(0x42C8E048UL))
#define bFM_ETHERNET_MAC0_TSCR_ATSFC              *((volatile  uint8_t *)(0x42C8E060UL))
#define bFM4_ETHERNET_MAC0_TSCR_ATSFC             *((volatile  uint8_t *)(0x42C8E060UL))

#define bFM_ETHERNET_MAC0_TSR_TSSOVF              *((volatile  uint8_t *)(0x42C8E500UL))
#define bFM4_ETHERNET_MAC0_TSR_TSSOVF             *((volatile  uint8_t *)(0x42C8E500UL))
#define bFM_ETHERNET_MAC0_TSR_TSTART              *((volatile  uint8_t *)(0x42C8E504UL))
#define bFM4_ETHERNET_MAC0_TSR_TSTART             *((volatile  uint8_t *)(0x42C8E504UL))
#define bFM_ETHERNET_MAC0_TSR_ATSTS               *((volatile  uint8_t *)(0x42C8E508UL))
#define bFM4_ETHERNET_MAC0_TSR_ATSTS              *((volatile  uint8_t *)(0x42C8E508UL))
#define bFM_ETHERNET_MAC0_TSR_TRGTER              *((volatile  uint8_t *)(0x42C8E50CUL))
#define bFM4_ETHERNET_MAC0_TSR_TRGTER             *((volatile  uint8_t *)(0x42C8E50CUL))
#define bFM_ETHERNET_MAC0_TSR_ATSSTM              *((volatile  uint8_t *)(0x42C8E560UL))
#define bFM4_ETHERNET_MAC0_TSR_ATSSTM             *((volatile  uint8_t *)(0x42C8E560UL))

#define bFM_ETHERNET_MAC0_VTR_ETV                 *((volatile  uint8_t *)(0x42C803C0UL))
#define bFM4_ETHERNET_MAC0_VTR_ETV                *((volatile  uint8_t *)(0x42C803C0UL))


