sol4ik/audio-steganography/try/fm4/s6e2ccxh/common/s6e2ccxh.h
#define bFM_MFS12_CSIO_SMR_SOE                    *((volatile  uint8_t *)(0x42718000UL))
#define bFM4_MFS12_CSIO_SMR_SOE                   *((volatile  uint8_t *)(0x42718000UL))
#define bFM_MFS12_CSIO_SMR_SCKE                   *((volatile  uint8_t *)(0x42718004UL))
#define bFM4_MFS12_CSIO_SMR_SCKE                  *((volatile  uint8_t *)(0x42718004UL))
#define bFM_MFS12_CSIO_SMR_BDS                    *((volatile  uint8_t *)(0x42718008UL))
#define bFM4_MFS12_CSIO_SMR_BDS                   *((volatile  uint8_t *)(0x42718008UL))
#define bFM_MFS12_CSIO_SMR_SCINV                  *((volatile  uint8_t *)(0x4271800CUL))
#define bFM4_MFS12_CSIO_SMR_SCINV                 *((volatile  uint8_t *)(0x4271800CUL))

#define bFM_MFS12_CSIO_SSR_TBI                    *((volatile  uint8_t *)(0x427180A0UL))
#define bFM4_MFS12_CSIO_SSR_TBI                   *((volatile  uint8_t *)(0x427180A0UL))
#define bFM_MFS12_CSIO_SSR_TDRE                   *((volatile  uint8_t *)(0x427180A4UL))
#define bFM4_MFS12_CSIO_SSR_TDRE                  *((volatile  uint8_t *)(0x427180A4UL))
#define bFM_MFS12_CSIO_SSR_RDRF                   *((volatile  uint8_t *)(0x427180A8UL))
#define bFM4_MFS12_CSIO_SSR_RDRF                  *((volatile  uint8_t *)(0x427180A8UL))
#define bFM_MFS12_CSIO_SSR_ORE                    *((volatile  uint8_t *)(0x427180ACUL))
#define bFM4_MFS12_CSIO_SSR_ORE                   *((volatile  uint8_t *)(0x427180ACUL))
#define bFM_MFS12_CSIO_SSR_AWC                    *((volatile  uint8_t *)(0x427180B0UL))
#define bFM4_MFS12_CSIO_SSR_AWC                   *((volatile  uint8_t *)(0x427180B0UL))
#define bFM_MFS12_CSIO_SSR_REC                    *((volatile  uint8_t *)(0x427180BCUL))
#define bFM4_MFS12_CSIO_SSR_REC                   *((volatile  uint8_t *)(0x427180BCUL))

#define bFM_MFS12_I2C_EIBCR_BEC                   *((volatile  uint8_t *)(0x427183A0UL))
#define bFM4_MFS12_I2C_EIBCR_BEC                  *((volatile  uint8_t *)(0x427183A0UL))
#define bFM_MFS12_I2C_EIBCR_SOCE                  *((volatile  uint8_t *)(0x427183A4UL))
#define bFM4_MFS12_I2C_EIBCR_SOCE                 *((volatile  uint8_t *)(0x427183A4UL))
#define bFM_MFS12_I2C_EIBCR_SCLC                  *((volatile  uint8_t *)(0x427183A8UL))
#define bFM4_MFS12_I2C_EIBCR_SCLC                 *((volatile  uint8_t *)(0x427183A8UL))
#define bFM_MFS12_I2C_EIBCR_SDAC                  *((volatile  uint8_t *)(0x427183ACUL))
#define bFM4_MFS12_I2C_EIBCR_SDAC                 *((volatile  uint8_t *)(0x427183ACUL))
#define bFM_MFS12_I2C_EIBCR_SCLS                  *((volatile  uint8_t *)(0x427183B0UL))
#define bFM4_MFS12_I2C_EIBCR_SCLS                 *((volatile  uint8_t *)(0x427183B0UL))
#define bFM_MFS12_I2C_EIBCR_SDAS                  *((volatile  uint8_t *)(0x427183B4UL))
#define bFM4_MFS12_I2C_EIBCR_SDAS                 *((volatile  uint8_t *)(0x427183B4UL))

#define bFM_MFS12_I2C_FCR_FE1                     *((volatile  uint8_t *)(0x42718280UL))
#define bFM4_MFS12_I2C_FCR_FE1                    *((volatile  uint8_t *)(0x42718280UL))
#define bFM_MFS12_I2C_FCR_FE2                     *((volatile  uint8_t *)(0x42718284UL))
#define bFM4_MFS12_I2C_FCR_FE2                    *((volatile  uint8_t *)(0x42718284UL))
#define bFM_MFS12_I2C_FCR_FCL1                    *((volatile  uint8_t *)(0x42718288UL))
#define bFM4_MFS12_I2C_FCR_FCL1                   *((volatile  uint8_t *)(0x42718288UL))
#define bFM_MFS12_I2C_FCR_FCL2                    *((volatile  uint8_t *)(0x4271828CUL))
#define bFM4_MFS12_I2C_FCR_FCL2                   *((volatile  uint8_t *)(0x4271828CUL))
#define bFM_MFS12_I2C_FCR_FSET                    *((volatile  uint8_t *)(0x42718290UL))
#define bFM4_MFS12_I2C_FCR_FSET                   *((volatile  uint8_t *)(0x42718290UL))
#define bFM_MFS12_I2C_FCR_FLD                     *((volatile  uint8_t *)(0x42718294UL))
#define bFM4_MFS12_I2C_FCR_FLD                    *((volatile  uint8_t *)(0x42718294UL))
#define bFM_MFS12_I2C_FCR_FLST                    *((volatile  uint8_t *)(0x42718298UL))
#define bFM4_MFS12_I2C_FCR_FLST                   *((volatile  uint8_t *)(0x42718298UL))
#define bFM_MFS12_I2C_FCR_FSEL                    *((volatile  uint8_t *)(0x427182A0UL))
#define bFM4_MFS12_I2C_FCR_FSEL                   *((volatile  uint8_t *)(0x427182A0UL))
#define bFM_MFS12_I2C_FCR_FTIE                    *((volatile  uint8_t *)(0x427182A4UL))
#define bFM4_MFS12_I2C_FCR_FTIE                   *((volatile  uint8_t *)(0x427182A4UL))
#define bFM_MFS12_I2C_FCR_FDRQ                    *((volatile  uint8_t *)(0x427182A8UL))
#define bFM4_MFS12_I2C_FCR_FDRQ                   *((volatile  uint8_t *)(0x427182A8UL))
#define bFM_MFS12_I2C_FCR_FRIIE                   *((volatile  uint8_t *)(0x427182ACUL))
#define bFM4_MFS12_I2C_FCR_FRIIE                  *((volatile  uint8_t *)(0x427182ACUL))
#define bFM_MFS12_I2C_FCR_FLSTE                   *((volatile  uint8_t *)(0x427182B0UL))
#define bFM4_MFS12_I2C_FCR_FLSTE                  *((volatile  uint8_t *)(0x427182B0UL))

#define bFM_MFS12_I2C_IBCR_INT                    *((volatile  uint8_t *)(0x42718020UL))
#define bFM4_MFS12_I2C_IBCR_INT                   *((volatile  uint8_t *)(0x42718020UL))
#define bFM_MFS12_I2C_IBCR_BER                    *((volatile  uint8_t *)(0x42718024UL))
#define bFM4_MFS12_I2C_IBCR_BER                   *((volatile  uint8_t *)(0x42718024UL))
#define bFM_MFS12_I2C_IBCR_INTE                   *((volatile  uint8_t *)(0x42718028UL))
#define bFM4_MFS12_I2C_IBCR_INTE                  *((volatile  uint8_t *)(0x42718028UL))
#define bFM_MFS12_I2C_IBCR_CNDE                   *((volatile  uint8_t *)(0x4271802CUL))
#define bFM4_MFS12_I2C_IBCR_CNDE                  *((volatile  uint8_t *)(0x4271802CUL))
#define bFM_MFS12_I2C_IBCR_WSEL                   *((volatile  uint8_t *)(0x42718030UL))
#define bFM4_MFS12_I2C_IBCR_WSEL                  *((volatile  uint8_t *)(0x42718030UL))
#define bFM_MFS12_I2C_IBCR_ACKE                   *((volatile  uint8_t *)(0x42718034UL))
#define bFM4_MFS12_I2C_IBCR_ACKE                  *((volatile  uint8_t *)(0x42718034UL))
#define bFM_MFS12_I2C_IBCR_ACT_SCC                *((volatile  uint8_t *)(0x42718038UL))
#define bFM4_MFS12_I2C_IBCR_ACT_SCC               *((volatile  uint8_t *)(0x42718038UL))
#define bFM_MFS12_I2C_IBCR_MSS                    *((volatile  uint8_t *)(0x4271803CUL))
#define bFM4_MFS12_I2C_IBCR_MSS                   *((volatile  uint8_t *)(0x4271803CUL))

#define bFM_MFS12_I2C_IBSR_BB                     *((volatile  uint8_t *)(0x42718080UL))
#define bFM4_MFS12_I2C_IBSR_BB                    *((volatile  uint8_t *)(0x42718080UL))
#define bFM_MFS12_I2C_IBSR_SPC                    *((volatile  uint8_t *)(0x42718084UL))
#define bFM4_MFS12_I2C_IBSR_SPC                   *((volatile  uint8_t *)(0x42718084UL))
#define bFM_MFS12_I2C_IBSR_RSC                    *((volatile  uint8_t *)(0x42718088UL))
#define bFM4_MFS12_I2C_IBSR_RSC                   *((volatile  uint8_t *)(0x42718088UL))
#define bFM_MFS12_I2C_IBSR_AL                     *((volatile  uint8_t *)(0x4271808CUL))
#define bFM4_MFS12_I2C_IBSR_AL                    *((volatile  uint8_t *)(0x4271808CUL))
#define bFM_MFS12_I2C_IBSR_TRX                    *((volatile  uint8_t *)(0x42718090UL))
#define bFM4_MFS12_I2C_IBSR_TRX                   *((volatile  uint8_t *)(0x42718090UL))
#define bFM_MFS12_I2C_IBSR_RSA                    *((volatile  uint8_t *)(0x42718094UL))
#define bFM4_MFS12_I2C_IBSR_RSA                   *((volatile  uint8_t *)(0x42718094UL))
#define bFM_MFS12_I2C_IBSR_RACK                   *((volatile  uint8_t *)(0x42718098UL))
#define bFM4_MFS12_I2C_IBSR_RACK                  *((volatile  uint8_t *)(0x42718098UL))
#define bFM_MFS12_I2C_IBSR_FBT                    *((volatile  uint8_t *)(0x4271809CUL))
#define bFM4_MFS12_I2C_IBSR_FBT                   *((volatile  uint8_t *)(0x4271809CUL))

#define bFM_MFS12_I2C_ISBA_SAEN                   *((volatile  uint8_t *)(0x4271821CUL))
#define bFM4_MFS12_I2C_ISBA_SAEN                  *((volatile  uint8_t *)(0x4271821CUL))

#define bFM_MFS12_I2C_ISMK_EN                     *((volatile  uint8_t *)(0x4271823CUL))
#define bFM4_MFS12_I2C_ISMK_EN                    *((volatile  uint8_t *)(0x4271823CUL))

#define bFM_MFS12_I2C_SMR_TIE                     *((volatile  uint8_t *)(0x42718008UL))
#define bFM4_MFS12_I2C_SMR_TIE                    *((volatile  uint8_t *)(0x42718008UL))
#define bFM_MFS12_I2C_SMR_RIE                     *((volatile  uint8_t *)(0x4271800CUL))
#define bFM4_MFS12_I2C_SMR_RIE                    *((volatile  uint8_t *)(0x4271800CUL))

#define bFM_MFS12_I2C_SSR_TBI                     *((volatile  uint8_t *)(0x427180A0UL))
#define bFM4_MFS12_I2C_SSR_TBI                    *((volatile  uint8_t *)(0x427180A0UL))
#define bFM_MFS12_I2C_SSR_TDRE                    *((volatile  uint8_t *)(0x427180A4UL))
#define bFM4_MFS12_I2C_SSR_TDRE                   *((volatile  uint8_t *)(0x427180A4UL))
#define bFM_MFS12_I2C_SSR_RDRF                    *((volatile  uint8_t *)(0x427180A8UL))
#define bFM4_MFS12_I2C_SSR_RDRF                   *((volatile  uint8_t *)(0x427180A8UL))
#define bFM_MFS12_I2C_SSR_ORE                     *((volatile  uint8_t *)(0x427180ACUL))
#define bFM4_MFS12_I2C_SSR_ORE                    *((volatile  uint8_t *)(0x427180ACUL))
#define bFM_MFS12_I2C_SSR_TBIE                    *((volatile  uint8_t *)(0x427180B0UL))
#define bFM4_MFS12_I2C_SSR_TBIE                   *((volatile  uint8_t *)(0x427180B0UL))
#define bFM_MFS12_I2C_SSR_DMA                     *((volatile  uint8_t *)(0x427180B4UL))
#define bFM4_MFS12_I2C_SSR_DMA                    *((volatile  uint8_t *)(0x427180B4UL))
#define bFM_MFS12_I2C_SSR_TSET                    *((volatile  uint8_t *)(0x427180B8UL))
#define bFM4_MFS12_I2C_SSR_TSET                   *((volatile  uint8_t *)(0x427180B8UL))
#define bFM_MFS12_I2C_SSR_REC                     *((volatile  uint8_t *)(0x427180BCUL))
#define bFM4_MFS12_I2C_SSR_REC                    *((volatile  uint8_t *)(0x427180BCUL))

#define bFM_MFS12_LIN_BGR_EXT                     *((volatile  uint8_t *)(0x427181BCUL))
#define bFM4_MFS12_LIN_BGR_EXT                    *((volatile  uint8_t *)(0x427181BCUL))

