sol4ik/audio-steganography/try/fm4/s6e2ccxh/common/s6e2ccxh.h
/*******************************************************************************
* SBSSR Registers SBSSR
*   Bitband Section
*******************************************************************************/
#define bFM_SBSSR_BTSSSR_SSSR0                    *((volatile  uint8_t *)(0x424BFF80UL))
#define bFM4_SBSSR_BTSSSR_SSSR0                   *((volatile  uint8_t *)(0x424BFF80UL))
#define bFM_SBSSR_BTSSSR_SSSR1                    *((volatile  uint8_t *)(0x424BFF84UL))
#define bFM4_SBSSR_BTSSSR_SSSR1                   *((volatile  uint8_t *)(0x424BFF84UL))
#define bFM_SBSSR_BTSSSR_SSSR2                    *((volatile  uint8_t *)(0x424BFF88UL))
#define bFM4_SBSSR_BTSSSR_SSSR2                   *((volatile  uint8_t *)(0x424BFF88UL))
#define bFM_SBSSR_BTSSSR_SSSR3                    *((volatile  uint8_t *)(0x424BFF8CUL))
#define bFM4_SBSSR_BTSSSR_SSSR3                   *((volatile  uint8_t *)(0x424BFF8CUL))
#define bFM_SBSSR_BTSSSR_SSSR4                    *((volatile  uint8_t *)(0x424BFF90UL))
#define bFM4_SBSSR_BTSSSR_SSSR4                   *((volatile  uint8_t *)(0x424BFF90UL))
#define bFM_SBSSR_BTSSSR_SSSR5                    *((volatile  uint8_t *)(0x424BFF94UL))
#define bFM4_SBSSR_BTSSSR_SSSR5                   *((volatile  uint8_t *)(0x424BFF94UL))
#define bFM_SBSSR_BTSSSR_SSSR6                    *((volatile  uint8_t *)(0x424BFF98UL))
#define bFM4_SBSSR_BTSSSR_SSSR6                   *((volatile  uint8_t *)(0x424BFF98UL))
#define bFM_SBSSR_BTSSSR_SSSR7                    *((volatile  uint8_t *)(0x424BFF9CUL))
#define bFM4_SBSSR_BTSSSR_SSSR7                   *((volatile  uint8_t *)(0x424BFF9CUL))
#define bFM_SBSSR_BTSSSR_SSSR8                    *((volatile  uint8_t *)(0x424BFFA0UL))
#define bFM4_SBSSR_BTSSSR_SSSR8                   *((volatile  uint8_t *)(0x424BFFA0UL))
#define bFM_SBSSR_BTSSSR_SSSR9                    *((volatile  uint8_t *)(0x424BFFA4UL))
#define bFM4_SBSSR_BTSSSR_SSSR9                   *((volatile  uint8_t *)(0x424BFFA4UL))
#define bFM_SBSSR_BTSSSR_SSSR10                   *((volatile  uint8_t *)(0x424BFFA8UL))
#define bFM4_SBSSR_BTSSSR_SSSR10                  *((volatile  uint8_t *)(0x424BFFA8UL))
#define bFM_SBSSR_BTSSSR_SSSR11                   *((volatile  uint8_t *)(0x424BFFACUL))
#define bFM4_SBSSR_BTSSSR_SSSR11                  *((volatile  uint8_t *)(0x424BFFACUL))
#define bFM_SBSSR_BTSSSR_SSSR12                   *((volatile  uint8_t *)(0x424BFFB0UL))
#define bFM4_SBSSR_BTSSSR_SSSR12                  *((volatile  uint8_t *)(0x424BFFB0UL))
#define bFM_SBSSR_BTSSSR_SSSR13                   *((volatile  uint8_t *)(0x424BFFB4UL))
#define bFM4_SBSSR_BTSSSR_SSSR13                  *((volatile  uint8_t *)(0x424BFFB4UL))
#define bFM_SBSSR_BTSSSR_SSSR14                   *((volatile  uint8_t *)(0x424BFFB8UL))
#define bFM4_SBSSR_BTSSSR_SSSR14                  *((volatile  uint8_t *)(0x424BFFB8UL))
#define bFM_SBSSR_BTSSSR_SSSR15                   *((volatile  uint8_t *)(0x424BFFBCUL))
#define bFM4_SBSSR_BTSSSR_SSSR15                  *((volatile  uint8_t *)(0x424BFFBCUL))


/*******************************************************************************
* SDIF Registers SDIF
*   Bitband Section
*******************************************************************************/
#define bFM_SDIF_ADMAEST_ADMALENME                *((volatile  uint8_t *)(0x42DC0A88UL))
#define bFM4_SDIF_ADMAEST_ADMALENME               *((volatile  uint8_t *)(0x42DC0A88UL))

#define bFM_SDIF_AHBCFGL_SINEN                    *((volatile  uint8_t *)(0x42DC200CUL))
#define bFM4_SDIF_AHBCFGL_SINEN                   *((volatile  uint8_t *)(0x42DC200CUL))
#define bFM_SDIF_AHBCFGL_BSLOCK                   *((volatile  uint8_t *)(0x42DC2010UL))
#define bFM4_SDIF_AHBCFGL_BSLOCK                  *((volatile  uint8_t *)(0x42DC2010UL))
#define bFM_SDIF_AHBCFGL_BSLOCKSEL                *((volatile  uint8_t *)(0x42DC2014UL))
#define bFM4_SDIF_AHBCFGL_BSLOCKSEL               *((volatile  uint8_t *)(0x42DC2014UL))
#define bFM_SDIF_AHBCFGL_ENDIANSEL                *((volatile  uint8_t *)(0x42DC2018UL))
#define bFM4_SDIF_AHBCFGL_ENDIANSEL               *((volatile  uint8_t *)(0x42DC2018UL))

#define bFM_SDIF_CAPBLTY0_TOCLKUNIT               *((volatile  uint8_t *)(0x42DC081CUL))
#define bFM4_SDIF_CAPBLTY0_TOCLKUNIT              *((volatile  uint8_t *)(0x42DC081CUL))

#define bFM_SDIF_CAPBLTY1_EMBD8BIT                *((volatile  uint8_t *)(0x42DC0848UL))
#define bFM4_SDIF_CAPBLTY1_EMBD8BIT               *((volatile  uint8_t *)(0x42DC0848UL))
#define bFM_SDIF_CAPBLTY1_ADMA2SPT                *((volatile  uint8_t *)(0x42DC084CUL))
#define bFM4_SDIF_CAPBLTY1_ADMA2SPT               *((volatile  uint8_t *)(0x42DC084CUL))
#define bFM_SDIF_CAPBLTY1_HGHSPDSPT               *((volatile  uint8_t *)(0x42DC0854UL))
#define bFM4_SDIF_CAPBLTY1_HGHSPDSPT              *((volatile  uint8_t *)(0x42DC0854UL))
#define bFM_SDIF_CAPBLTY1_SDMASPT                 *((volatile  uint8_t *)(0x42DC0858UL))
#define bFM4_SDIF_CAPBLTY1_SDMASPT                *((volatile  uint8_t *)(0x42DC0858UL))
#define bFM_SDIF_CAPBLTY1_LWPWRSPT                *((volatile  uint8_t *)(0x42DC085CUL))
#define bFM4_SDIF_CAPBLTY1_LWPWRSPT               *((volatile  uint8_t *)(0x42DC085CUL))
#define bFM_SDIF_CAPBLTY1_V33SPT                  *((volatile  uint8_t *)(0x42DC0860UL))
#define bFM4_SDIF_CAPBLTY1_V33SPT                 *((volatile  uint8_t *)(0x42DC0860UL))
#define bFM_SDIF_CAPBLTY1_V30SPT                  *((volatile  uint8_t *)(0x42DC0864UL))
#define bFM4_SDIF_CAPBLTY1_V30SPT                 *((volatile  uint8_t *)(0x42DC0864UL))
#define bFM_SDIF_CAPBLTY1_V18SPT                  *((volatile  uint8_t *)(0x42DC0868UL))
#define bFM4_SDIF_CAPBLTY1_V18SPT                 *((volatile  uint8_t *)(0x42DC0868UL))
#define bFM_SDIF_CAPBLTY1_BUS64SPT                *((volatile  uint8_t *)(0x42DC0870UL))
#define bFM4_SDIF_CAPBLTY1_BUS64SPT               *((volatile  uint8_t *)(0x42DC0870UL))
#define bFM_SDIF_CAPBLTY1_ASYINTSPT               *((volatile  uint8_t *)(0x42DC0874UL))
#define bFM4_SDIF_CAPBLTY1_ASYINTSPT              *((volatile  uint8_t *)(0x42DC0874UL))

#define bFM_SDIF_CAPBLTY2_SDR50SPT                *((volatile  uint8_t *)(0x42DC0880UL))
#define bFM4_SDIF_CAPBLTY2_SDR50SPT               *((volatile  uint8_t *)(0x42DC0880UL))
#define bFM_SDIF_CAPBLTY2_SDR104SPT               *((volatile  uint8_t *)(0x42DC0884UL))
#define bFM4_SDIF_CAPBLTY2_SDR104SPT              *((volatile  uint8_t *)(0x42DC0884UL))
#define bFM_SDIF_CAPBLTY2_DDR50SPT                *((volatile  uint8_t *)(0x42DC0888UL))
#define bFM4_SDIF_CAPBLTY2_DDR50SPT               *((volatile  uint8_t *)(0x42DC0888UL))
#define bFM_SDIF_CAPBLTY2_DRVTPASPT               *((volatile  uint8_t *)(0x42DC0890UL))
#define bFM4_SDIF_CAPBLTY2_DRVTPASPT              *((volatile  uint8_t *)(0x42DC0890UL))
#define bFM_SDIF_CAPBLTY2_DRVTPCSPT               *((volatile  uint8_t *)(0x42DC0894UL))
#define bFM4_SDIF_CAPBLTY2_DRVTPCSPT              *((volatile  uint8_t *)(0x42DC0894UL))
#define bFM_SDIF_CAPBLTY2_DRVTPDSPT               *((volatile  uint8_t *)(0x42DC0898UL))
#define bFM4_SDIF_CAPBLTY2_DRVTPDSPT              *((volatile  uint8_t *)(0x42DC0898UL))
#define bFM_SDIF_CAPBLTY2_USETNSDR50              *((volatile  uint8_t *)(0x42DC08B4UL))
#define bFM4_SDIF_CAPBLTY2_USETNSDR50             *((volatile  uint8_t *)(0x42DC08B4UL))

